Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: Network
ca_es: Xarxa
cs_cz: Síť
de_de: Netzwerk
es_es: Red
fi_fi: Verkko
fr_fr: Réseau
hr_hr: Mreža
hu_hu: Hálózat
it_it: Rete
ja_jp: ネットワーク
pl_pl: Sieć
pt_br: Rede
ru_ru: Сеть
sk_sk: Sieť
sl_si: Omrežje
tr_tr: Ağ
uk_ua: Мережа
vi_vn: Nối mạng

source: Ports (COM & LPT)
ca_es: Ports (COM i LPT)
cs_cz: COM a LPT porty
de_de: Anschlüsse (COM & LPT)
es_es: Puertos (COM y LPT)
fi_fi: Portit (COM & LPT)
fr_fr: Ports (COM et LPT)
hr_hr: Vrata (COM & LPT)
hu_hu: Portok (COM és LPT)
it_it: Porte (COM & LPT)
ja_jp: ポート (COM/LPT)
pl_pl: Porty (COM & LPT)
pt_br: Portas (COM & LPT)
ru_ru: Порты (COM и LPT)
sk_sk: COM a LPT porty
sl_si: Vrata (COM & LPT)
tr_tr: Portlar (COM & LPT)
uk_ua: Порти (COM и LPT)
vi_vn: Cổng (COM và LPT)

source: Storage controllers
ca_es: Controladors d'emmagatzematge
cs_cz: Řadiče úložiště
de_de: Speichercontroller
es_es: Controladoras de Almacenamiento
fi_fi: Tallennusohjaimet
fr_fr: Contrôleurs de stockage
hr_hr: Kontroleri za diskove
hu_hu: Tárolóvezérlők
it_it: Controller memoria
ja_jp: ストレージコントローラ
pl_pl: Kontrolery pamięci
pt_br: Controladores de armaz.
ru_ru: Контроллеры дисков
sk_sk: Radiče úložiska
sl_si: Krmilniki shrambe
tr_tr: Depolama kontrolcüleri
uk_ua: Контролери дисків
vi_vn: Vi điều khiển bộ nhớ ổ cứng

source: Hard disks
ca_es: Discs durs
cs_cz: Pevné disky
de_de: Festplatten
es_es: Discos Duros
fi_fi: Kiintolevyt
fr_fr: Disques durs
hr_hr: Tvrdi diskovi
hu_hu: Merevlemezek
it_it: Hard disk
ja_jp: ハードディスク
pl_pl: Dyski twarde
pt_br: Discos rígidos
ru_ru: Жёсткие диски
sk_sk: Pevné disky
sl_si: Trdi diski
tr_tr: Hard diskler
uk_ua: Жорсткі диски
vi_vn: Ổ cứng

source: Floppy & CD-ROM drives
ca_es: Unitats de disquet i CD-ROM
cs_cz: Disketové a CD-ROM mechaniky
de_de: Disketten- & CD-ROM-Laufwerke
es_es: Disquetes y unidades de CD-ROM
fi_fi: Levyke ja CD-ROM
fr_fr: Lecteurs de disquette et CD-ROM
hr_hr: Floppy & CD-ROM pogoni
hu_hu: Floppy és CD-ROM meghajtók
it_it: Unità CD-ROM e Floppy
ja_jp: フロッピー／CD-ROMドライブ
pl_pl: Napędy dyskietek i CD-ROM
pt_br: Disquete & CD-ROM
ru_ru: Гибкие диски и CD-ROM
sk_sk: Disketové a CD-ROM mechaniky
sl_si: Disketni in CD-ROM pogoni
tr_tr: Disket & CD-ROM sürücüleri
uk_ua: Гнучкі диски і CD-ROM
vi_vn: Ổ (đĩa) mềm và CD-ROM

source: Other removable devices
ca_es: Altres dispositius extraïbles
cs_cz: Další vyměnitelná zařízení
de_de: Andere Wechsellaufwerke
es_es: Otros dispositivos extraíbles
fi_fi: Muut tallennuslaitteet
fr_fr: Autres dispositifs amovibles
hr_hr: Ostali uklonjivi uređaji
hu_hu: Egyéb cserélhető tárolók
it_it: Altri dispositivi rimuovibili
ja_jp: 他のリムーバブルデバイス
pl_pl: Inne urządzenia wymienne
pt_br: Dispos. removíveis
ru_ru: Другие съёмные устройства
sk_sk: Ďalšie vymeniteľné zariadenia
sl_si: Druge odstranljive naprave
tr_tr: Diğer kaldırılabilir cihazlar
uk_ua: Інші знімні при-ої
vi_vn: Thiết bị tháo rời được khác

source: Other peripherals
ca_es: Altres perifèrics
cs_cz: Jiné příslušenství
de_de: Andere Peripheriegeräte
es_es: Otros periféricos
fi_fi: Muut oheislaitteet
fr_fr: Autres périfériques
hr_hr: Ostali periferni uređaji
hu_hu: Egyéb perifériák
it_it: Altre periferiche
ja_jp: 他の周辺デバイス
pl_pl: Inne urządzenia peryferyjne
pt_br: Outros periféricos
ru_ru: Другая периферия
sk_sk: Iné príslušenstvo
sl_si: Druga periferija
tr_tr: Diğer cihazlar
uk_ua: Інша периферія
vi_vn: Thiết bị ngoại vi khác

source: Click to capture mouse
ca_es: Feu clic per capturar el ratolí
cs_cz: Klikněte pro zabraní myši
de_de: Zum Einfangen des Mauszeigers bitte klicken
es_es: Haga click para capturar el ratón
fi_fi: Kaappaa hiiri klikkaamalla
fr_fr: Cliquer pour capturer la souris
hr_hr: Kliknite da uhvatite miš
hu_hu: Kattintson az egér elfogásához
it_it: Fare clic per catturare mouse
ja_jp: 左クリックでマウスをキャプチャします
pl_pl: Kliknij w celu przechwycenia myszy
pt_br: Clique para capturar o mouse
ru_ru: Щёлкните мышью для захвата курсора
sk_sk: Kliknite pre zabráni myši
sl_si: Kliknite za zajem miške
tr_tr: Farenin yakalanması için tıklayın
uk_ua: Клацніть мишею для захвату курсора
vi_vn: Bấm để capture ('nhốt') chuột vào

source: Press %1 to release mouse
ca_es: Premeu %1 per alliberar el ratolí
cs_cz: Stiskněte %1 pro uvolnění myši
de_de: Bitte %1 zur Mausfreigabe drücken
es_es: Pulse %1 para liberar el ratón
fi_fi: Paina %1 vapauttaaksesi hiiren
fr_fr: Appuyer sur %1 pour libérer la souris
hr_hr: Pritisnite %1 za otpustanje miša
hu_hu: Nyomja meg az %1-t az egér elengédéséhez
it_it: Premi %1 per rilasciare il mouse
ja_jp: %1キーでマウスを解放します
pl_pl: Naciśnij klawisze %1 w celu uwolnienia myszy
pt_br: Aperte %1 para liberar o mouse
ru_ru: Нажмите %1, чтобы освободить курсор
sk_sk: Stlačte %1 pre uvoľnenie myši
sl_si: Pritisnite %1 za izpust miške
tr_tr: Farenin bırakılması için %1 tuşlarına basın
uk_ua: Натисніть %1, щоб звільнити курсор
vi_vn: Nhấn %1 để thả chuột

source: Press %1 or middle button to release mouse
ca_es: Premeu %1 o el botó central per alliberar el ratolí
cs_cz: Stiskněte %1 nebo prostřední tlačítko pro uvolnění myši
de_de: Bitte %1 oder die mittlere Maustaste zur Mausfreigabe drücken
es_es: Pulse %1 o el botón central para liberar el ratón
fi_fi: Paina %1 tai keskipainiketta vapauttaaksesi hiiren
fr_fr: Appuyer sur %1 ou le bouton central pour libérer la souris
hr_hr: Pritisnite %1 ili srednji gumb miša za otpuštanje miša
hu_hu: Nyomja meg az %1-t vagy a középső gombot az egér elengédéséhez
it_it: Premi %1 o pulsante centrale per rilasciare il mouse
ja_jp: %1キーまたは中クリックでマウスを解放します
pl_pl: Naciśnij klawisze %1 lub środkowy przycisk w celu uwolnienia myszy
pt_br: Aperte %1 ou botão do meio para liberar o mouse
ru_ru: Нажмите %1 или среднюю кнопку мыши, чтобы освободить курсор
sk_sk: Stlačte %1 alebo prostredné tlačidlo na uvoľnenie myši
sl_si: Pritisnite %1 ali srednji gumb za izpust miške
tr_tr: Farenin bırakılması için %1 veya farenin orta tuşuna basın
uk_ua: Натисніть %1 або середню кнопку миші, щоб звільнити курсор
vi_vn: Nhấn %1 hoặc nhấp chuột giữa để thả chuột

source: Bus
cs_cz: Sběrnice
fi_fi: Väylä
hu_hu: Busz
ja_jp: バス
pl_pl: Magistrala
pt_br: Barramento
ru_ru: Шина
sk_sk: Zbernica
sl_si: Vodilo
tr_tr: Veri yolu
uk_ua: Шина

source: File
ca_es: Fitxer
cs_cz: Soubor
de_de: Datei
es_es: Archivo
fi_fi: Tiedosto
hr_hr: Datoteka
hu_hu: Fájl
ja_jp: ファイル
pl_pl: Plik
pt_br: Arquivo
ru_ru: Файл
sk_sk: Súbor
sl_si: Datoteka
tr_tr: Dosya
uk_ua: Файл

source: MiB
fr_fr: Mio
ru_ru: МиБ
uk_ua: МіБ

source: KB
fi_fi: kt
fr_fr: Ko
ru_ru: КБ
uk_ua: КБ

source: Could not initialize the video renderer.
ca_es: No has estat possible inicialitzar el renderitzador de vídeo.
cs_cz: Nastala chyba při inicializaci video rendereru.
de_de: Der Videorenderer konnte nicht initialisiert werden.
es_es: No fué posible inicializar el renderizador de vídeo.
fi_fi: Videorenderöijän alustus epäonnistui
fr_fr: Impossible d'initialiser le moteur de rendu vidéo.
hr_hr: Nije moguće inicijalizirati renderer.
hu_hu: Nem sikerült inicializálni a videó megjelenítőt.
it_it: Impossibile inizializzare il renderer video.
ja_jp: ビデオレンダラーが初期化できません。
pl_pl: Nie można zainicjować renderera wideo.
pt_br: Não foi possível inicializar o renderizador de vídeo.
ru_ru: Не удалось инициализировать рендерер видео.
sk_sk: Nastala chyba pri inicializácii video renderera.
sl_si: Ne morem inicializirati pogona upodabljanja.
tr_tr: Video işleyici başlatılamadı.
uk_ua: Не вдалося ініціалізувати рендер відео.
vi_vn: Không thể khởi tạo trình kết xuất (renderer) video .

source: Default
ca_es: Per defecte
cs_cz: Výchozí
de_de: Standard
es_es: Por defecto
fi_fi: Oletus
fr_fr: Défaut
hr_hr: Standard
hu_hu: Alapértelmezett
it_it: Predefinito
ja_jp: 既定値
pl_pl: Domyślny
pt_br: Padrão
ru_ru: По умолчанию
sk_sk: Východiskové
sl_si: Privzeto
tr_tr: Varsayılan
uk_ua: За замовчуванням
vi_vn: Mặc định

source: %i Wait state(s)
cs_cz: %i čekací stav(y)
de_de: %i Wartezustände
es_es: %i estado(s) de Espera
fi_fi: %i odotustilaa
fr_fr: %i état(s) d'attente
hr_hr: %i stanje čekanja
hu_hu: %i várakozási ciklus(ok)
it_it: %i stati d'attesa
ja_jp: %iつのウェイト ステート
pl_pl: %i Stany oczekiwania
pt_br: %i estado(s) de espera
ru_ru: %i WS
sk_sk: %i čakací stav(y)
sl_si: %i stanj čakanja
tr_tr: %i Bekleme durumları
uk_ua: %i WS
vi_vn: %i trạng thái chờ

source: Type
ca_es: Tipus
cs_cz: Typ
de_de: Typ
es_es: Tipo
fi_fi: Tyyppi
hr_hr: Tip
hu_hu: Típus
it_it: Tipo
ja_jp: タイプ
pl_pl: Rodzaj
pt_br: Tipo
ru_ru: Тип
sk_sk: Typ
sl_si: Vrsta
tr_tr: Tür
uk_ua: Тип
vi_vn: Loại

source: No PCap devices found
ca_es: No s'han trobat dispositius PCap
cs_cz: Nebyla nalezena žádná PCap zařízení
de_de: Keine PCap-Geräte gefunden
es_es: No se encontraron dispositivos PCap
fi_fi: PCap-laitteita ei löytynyt
fr_fr: Aucun dispositif PCap trouvé
hr_hr: Nema PCap uređaja
hu_hu: Nem találhatóak PCap eszközök
it_it: Nessun dispositivo PCap trovato
ja_jp: PCapデバイスがありません
pl_pl: Nie znaleziono urządzeń PCap
pt_br: Nenhum dispositivo PCap encontrado
ru_ru: Устройства PCap не найдены
sk_sk: Neboli nájdené žiadne PCap zariadenia
sl_si: Nobena naprava PCap ni bila najdena
tr_tr: Herhangi bir PCap cihazı bulunamadı
uk_ua: Пристрої PCap не знайдені
vi_vn: Không tìm thấy thiết bị PCap

source: Invalid PCap device
ca_es: El dispositiu PCap no és vàlid
cs_cz: Neplatné PCap zařízení
de_de: Ungültiges PCap-Gerät
es_es: Dispositivo PCap inválido
fi_fi: Virheellinen PCap-laite
fr_fr: Dispositif PCap non valide
hr_hr: Nevažeći PCap uređaj
hu_hu: Érvénytelen PCap eszköz
it_it: Dispositivo PCap invalido
ja_jp: 不正なPCapデバイス
pl_pl: Nieprawidłowe urządzenie PCap
pt_br: Dispositivo PCap inválido
ru_ru: Неверное устройство PCap
sk_sk: Neplatné PCap zariadenie
sl_si: Neveljavna naprava PCap
tr_tr: Geçersiz PCap cihazı
uk_ua: Невірний пристрій PCap
vi_vn: Thiết bị PCap không hợp quy

source: Standard 2-button joystick(s)
ca_es: Joystick(s) estàndard de 2 botons
cs_cz: Standardní 2tlačítkový joystick
de_de: Standard 2-Tasten-Joystick(s)
es_es: Mando(s) de 2 botones estándar
fi_fi: Standardi 2-painikkeinen peliohjain/-ohjaimet
fr_fr: Manette(s) standard avec 2 boutons
hr_hr: Standardna palica za igru s 2 tipke
hu_hu: Szabványos 2-gombos játékvezérlő(k)
it_it: Joystick comune da 2 pulsanti
ja_jp: 標準ジョイスティック(2ボタン)
pl_pl: Standardowe joysticki 2-przyciskowe
pt_br: Joystick padrão de 2 botões
ru_ru: Стандартный 2-кнопочный джойстик
sk_sk: Štandardný 2tlačidlový joystick
sl_si: Standardna krmilna palica z 2 gumboma
tr_tr: Standart 2-button oyun kolları
uk_ua: Стандартний 2-кнопковий джойстик
vi_vn: Cần điều khiển hai nút tiêu chuẩn

source: Standard 4-button joystick
ca_es: Joystick(s) estàndard de 4 botons
cs_cz: Standardní 4tlačítkový joystick
de_de: Standard 4-Tasten-Joystick
es_es: Mando de 4 botones estándar
fi_fi: Standardi 4-painikkeinen peliohjain
fr_fr: Manette standard avec 4 boutons
hr_hr: Standardna palica za igru s 4 tipke
hu_hu: Szabványos 4-gombos játékvezérlő
it_it: Joystick comune da 4 pulsanti
ja_jp: 標準ジョイスティック(4ボタン)
pl_pl: Standardowy joystick 4-przyciskowy
pt_br: Joystick padrão de 4 botões
ru_ru: Стандартный 4-кнопочный джойстик
sk_sk: Štandardný 4tlačidlový joystick
sl_si: Standardna krmilna palica s 4 gumbi
tr_tr: Standart 4-button oyun kolu
uk_ua: Стандартний 4-кнопковий джойстик
vi_vn: Cần điều khiển bốn nút tiêu chuẩn

source: Standard 6-button joystick
ca_es: Joystick(s) estàndard de 6 botons
cs_cz: Standardní 6tlačítkový joystick
de_de: Standard 6-Tasten-Joystick
es_es: Mando de 6 botones estándar
fi_fi: Standardi 6-painikkeinen peliohjain
fr_fr: Manette standard avec 6 boutons
hr_hr: Standardna palica za igru s 6 tipke
hu_hu: Szabványos 6-gombos játékvezérlő
it_it: Joystick comune da 6 pulsanti
ja_jp: 標準ジョイスティック(6ボタン)
pl_pl: Standardowy joystick 6-przyciskowy
pt_br: Joystick padrão de 6 botões
ru_ru: Стандартный 6-кнопочный джойстик
sk_sk: Štandardný 6tlačidlový joystick
sl_si: Standardna krmilna palica s 6 gumbi
tr_tr: Standart 6-button oyun kolu
uk_ua: Стандартний 6-кнопковий джойстик
vi_vn: Cần điều khiển sáu nút tiêu chuẩn

source: Standard 8-button joystick
ca_es: Joystick(s) estàndard de 8 botons
cs_cz: Standardní 8tlačítkový joystick
de_de: Standard 8-Tasten-Joystick
es_es: Mando de 8 botones estándar
fi_fi: Standardi 8-painikkeinen peliohjain
fr_fr: Manette standard avec 6 boutons
hr_hr: Standardna palica za igru s 8 tipke
hu_hu: Szabványos 8-gombos játékvezérlő
it_it: Joystick comune da 8 pulsanti
ja_jp: 標準ジョイスティック(8ボタン)
pl_pl: Standardowy joystick 8-przyciskowy
pt_br: Joystick padrão de 8 botões
ru_ru: Стандартный 8-кнопочный джойстик
sk_sk: Štandardný 8tlačidlový joystick
sl_si: Standardna krmilna palica z 8 gumbi
tr_tr: Standart 8-button oyun kolu
uk_ua: Стандартний 8-кнопковий джойстик
vi_vn: Cần điều khiển tám nút tiêu chuẩn

source: Thrustmaster Flight Control System
fr_fr: Système de contrôle de vol Thrustmaster
ja_jp: Thrustmaster飛行制御システム
pt_br: Sistema de Controle de Voo Thrustmaster
ru_ru: Система управления полётом Thrustmaster
tr_tr: Thrustmaster Flight Kontrol Sistemi
uk_ua: Система управління польотом Thrustmaster

source: None
ca_es: Cap
cs_cz: Žadné
de_de: Ohne
es_es: Ninguno
fi_fi: Ei mikään
fr_fr: Aucun
hr_hr: Bez
hu_hu: Nincs
it_it: Nessuno
ja_jp: なし
pl_pl: Żaden
pt_br: Nada
ru_ru: Нет
sk_sk: Žiadne
sl_si: Brez
tr_tr: Hiçbiri
uk_ua: Ні
vi_vn: Không có

source: %u MB (CHS: %i, %i, %i)
fi_fi: %u Mt (CHS: %i, %i, %i)
fr_fr: %u Mo (CTS: %i, %i, %i)
ja_jp: %u MB (CHS値: %i、%i、%i)
ru_ru: %u МБ (CHS: %i, %i, %i)
uk_ua: %u МБ (CHS: %i, %i, %i)

source: Floppy %i (%s): %ls
ca_es: Disquet %i (%s): %ls
cs_cz: Disketová mechanika %i (%s): %ls
de_de: Diskette %i (%s): %ls
es_es: Disquete %i (%s): %ls
fi_fi: Levyke %i (%s): %ls
fr_fr: Disquette %i (%s): %ls
hr_hr: Disketa %i (%s): %ls
ja_jp: フロッピー %i (%s): %ls
pl_pl: Dyskietka %i (%s): %ls
pt_br: Disquete %i (%s): %ls
ru_ru: Дисковод %i (%s): %ls
sk_sk: Disketová mechanika %i (%s): %ls
sl_si: Disketa %i (%s): %ls
tr_tr: Disket %i (%s): %ls
uk_ua: Дисковод %i (%s): %ls
vi_vn: Đĩa mềm %i (%s): %ls

source: Advanced sector images
ca_es: Imatges avançates del sector
cs_cz: Rozšířené sektorové obrazy
de_de: Fortgeschrittene Sektorimages
es_es: Imágenes avanzadas de sector
fi_fi: Kehittyneet sektorilevykuvat
fr_fr: Images du secteur avancés
hr_hr: Napredne sektorske slike
hu_hu: Továbbfejlesztett szektor képek
it_it: Immagini da settori avanzati
ja_jp: アドバンスドセクターイメージ
pl_pl: Zaawansowane obrazy sektorów
pt_br: Imagens de setor avançado
ru_ru: Расширенные образы секторов
sk_sk: Rozšírené sektorové obrazy
sl_si: Napredne sektorske slike
tr_tr: Gelişmiş sektör imajları
uk_ua: Розширені образи секторів
vi_vn: Ảnh (đĩa) sector nâng cao

source: Flux images
ca_es: Imatges de flux
cs_cz: Obrazy magnetického toku
es_es: Imágenes de fluxo
fi_fi: Flux-levykuvat
fr_fr: Images du flux
hr_hr: Flux slike
hu_hu: Flux képekfájlok
it_it: Immagini flusso
ja_jp: Fluxイメージ
pt_br: Imagens de fluxo
ru_ru: Образы Flux
sk_sk: Obrazy magnetického toku
sl_si: Tokovne slike
uk_ua: Образи Flux
vi_vn: Ảnh thông lượng (flux)

source: Are you sure you want to hard reset the emulated machine?
ca_es: Esteu segur que voleu restablir la màquina emulada?
cs_cz: Opravdu chcete resetovat emulovaný počítač?
de_de: Sind Sie sich sicher, dass Sie einen Hard-Reset für das emulierte System durchführen wollen?
es_es: ¿Está seguro de que quieres hacer una reinicialización completa de la máquina emulada?
fi_fi: Haluatko varmasti käynnistää emuloidun tietokoneen uudelleen?
fr_fr: Etes-vous sûr de vouloir réinitialiser la machine émulée ?
hr_hr: Jeste li sigurni da želite hard resetirati emulirani sistem?
hu_hu: Biztosan szeretné újraindítani az emulált gépet?
it_it: Sei sicuro di voler riavviare la macchina emulata?
ja_jp: 使用中のマシンをハード リセットしますか？
pl_pl: Jesteś pewien że chcesz wykonać twardy reset emulowanej maszyny?
pt_br: Tem certeza de que deseja reiniciar completamente a máquina emulada?
ru_ru: Вы уверены, что хотите выполнить холодную перезагрузку эмулируемой машины?
sk_sk: Naozaj chcete resetovať emulovaný počítač?
sl_si: Ste prepričani, da želite ponovno zagnati emulirani sistem?
tr_tr: Emüle edilen makineyi yeniden başlatmak istediğinizden emin misiniz?
uk_ua: Ви впевнені, що хочете виконати холодне перезавантаження емульованої машини?
vi_vn: Bạn có thật sự buộc máy khởi động lại không?

source: Are you sure you want to exit 86Box?
ca_es: Esteu segur que voleu sortir de 86Box?
cs_cz: Opravdu chcete ukončit 86Box?
de_de: Sind Sie sich sicher, dass Sie 86Box beenden wollen?
es_es: ¿Está seguro de que quiere cerrar a 86Box?
fi_fi: Haluatko varmasti sulkea 86Boxin?
fr_fr: Etes-vous sûr de vouloir quitter 86Box?
hr_hr: Jeste li sigurni da želite zatvoriti 86Box?
hu_hu: Biztos benne, hogy ki szeretne lépni a 86Box-ból?
it_it: Sei sicuro di voler uscire da 86Box?
ja_jp: 86Boxを終了しますか？
pl_pl: Jesteś pewien że chcesz zakończyć 86Box?
pt_br: Tem certeza de que deseja sair do 86Box?
ru_ru: Вы уверены, что хотите выйти из 86Box?
sk_sk: Naozaj chcete ukončiť 86Box?
sl_si: Ste prepričani, da želite zapreti 86Box?
tr_tr: 86Box'tan çıkmak istediğinize emin misiniz?
uk_ua: Ви впевнені, що хочете вийти з 86Box?
vi_vn: Bạn có muốn thoát 86Box?

source: Unable to initialize Ghostscript
ca_es: No es pot inicialitzar Ghostscript
cs_cz: Nastala chyba při inicializaci knihovny Ghostscript
de_de: Ghostscript konnte nicht initialisiert werden
es_es: No fué posible inicializar Ghostscript
fi_fi: Ghostscriptin alustus epäonnistui
fr_fr: Impossible d'initialiser Ghostscript
hr_hr: Nije moguće inicijalizirati GhostScript
hu_hu: Nem sikerült inicializálni a Ghostscript-et
it_it: Impossibile inizializzare Ghostscript
ja_jp: Ghostscriptが初期化できません
pl_pl: Nie można zainicjować Ghostscript
pt_br: Não é possível inicializar o Ghostscript
ru_ru: Невозможно инициализировать Ghostscript
sk_sk: Nastala chyba pri inicializácii knižnice Ghostscript
sl_si: Ne morem inicializirati Ghostscript
tr_tr: Ghostscript başlatılamadı
uk_ua: Неможливо ініціалізувати Ghostscript
vi_vn: Không thể khởi tạo Ghostscript

source: MO %i (%ls): %ls
fr_fr: Magnéto-optique %i (%ls): %ls
ja_jp: 光磁気 %i (%ls): %ls
pt_br: Magneto-óptico %i (%ls): %ls
ru_ru: Магнитооптический %i (%ls): %ls
uk_ua: Магнітооптичний %i (%ls): %ls

source: MO images
ca_es: Imatges MO
cs_cz: Obrazy MO
es_es: Imágenes de MO
fi_fi: MO-levykuvat
fr_fr: Images magnéto-optiques
hr_hr: MO slike
hu_hu: MO-képfájlok
it_it: Immagini MO
ja_jp: 光磁気イメージ
pl_pl: Obrazy MO
pt_br: Imagens magneto-ópticas
ru_ru: Образы магнитооптических дисков
sk_sk: Obrazy MO
sl_si: Slike MO
tr_tr: MO imajları
uk_ua: Образи магнітооптичних дисків
vi_vn: Ảnh đĩa MO

source: Welcome to 86Box!
ca_es: Benvingut a 86Box!
cs_cz: Vítejte v programu 86Box!
de_de: Willkommen bei 86Box!
es_es: ¡Bienvenido a 86Box!
fi_fi: Tervetuloa 86Boxiin!
fr_fr: Bienvenue dans 86Box !
hr_hr: Dobrodošli u 86Box!
hu_hu: Üdvözli önt az 86Box!
it_it: Benvenuti in 86Box!
ja_jp: 86Boxへようこそ！
pl_pl: Witamy w 86Box!
pt_br: Bem-vindo ao 86Box!
ru_ru: Добро пожаловать в 86Box!
sk_sk: Vitajte v programe 86Box!
sl_si: Dobrodošli v 86Box!
tr_tr: 86Box'a hoşgeldiniz!
uk_ua: Ласкаво просимо в 86Box!
vi_vn: Chào mừng đến 86Box!

source: Internal controller
ca_es: Controlador intern
cs_cz: Vestavěný řadič
de_de: Interner Controller
es_es: Controladora interna
fi_fi: Sisäinen ohjain
fr_fr: Côntrolleur interne
hr_hr: Uunutarnji kontroler
hu_hu: Integrált vezérlő
it_it: Controller interno
ja_jp: 内蔵コントローラー
pl_pl: Kontroler wewnętrzny
pt_br: Controlador interno
ru_ru: Встроенный контроллер
sk_sk: Vstavaný radič
sl_si: Notranji krmilnik
tr_tr: Dahili kontrolcü
uk_ua: Вбудований контролер
vi_vn: Vi điều khiển nội bộ

source: Exit
ca_es: Sortir
cs_cz: Ukončit
de_de: Beenden
es_es: Salir
fi_fi: Poistu
fr_fr: Sortir
hr_hr: Izlazi
hu_hu: Kilépés
it_it: Esci
ja_jp: 終了
pl_pl: Zakończ
pt_br: Sair
ru_ru: Выход
sk_sk: Ukončiť
sl_si: Izhod
tr_tr: Çıkış
uk_ua: Вихід
vi_vn: Thoát

source: No ROMs found
ca_es: No s'ha trobat cap ROM
cs_cz: Nebyly nalezeny žádné obrazy ROM
de_de: Keine ROMs gefunden
es_es: No se encontraron ROMs
fi_fi: ROM-tiedostoja ei löytynyt
fr_fr: Pas de ROMs trouvées
hr_hr: Nisu pronađene ROM datoteke
hu_hu: Nem találhatóak meg a ROM-képek
it_it: Nessune immagini ROM trovate
ja_jp: ROMが見つかりません
pl_pl: Nie znaleziono obrazów ROM
pt_br: Nenhum ROM encontrada
ru_ru: ПЗУ не найдены
sk_sk: Neboli nájdené žiadne obrazy ROM
sl_si: Nobeni ROM-i niso bili najdeni
tr_tr: Hiçbir ROM imajı bulunamadı
uk_ua: ПЗУ не знайдені
vi_vn: Không tìm thấy ROM

source: Do you want to save the settings?
ca_es: Voleu desar les configuracions?
cs_cz: Chcete uložit nastavení?
de_de: Möchten Sie die Einstellungen speichern?
es_es: ¿Quiere guardar los configuraciones?
fi_fi: Tallennetaanko asetukset?
fr_fr: Voulez-vous sauvegarder les paramètres ?
hr_hr: Želite li spremiti postavke?
hu_hu: Szeretné menteni a beállításokat?
it_it: Vuole salvare queste impostazioni?
ja_jp: 設定を保存しますか？
pl_pl: Czy chcesz zapisać ustawienia?
pt_br: Você deseja salvar as configurações?
ru_ru: Хотите ли вы сохранить настройки?
sk_sk: Chcete uložiť nastavenia?
sl_si: Želite shraniti nastavitve?
tr_tr: Ayarları kaydetmek istediğinizden emin misiniz?
uk_ua: Чи бажаєте ви зберегти налаштування?
vi_vn: Bạn có muốn lưu cài đặt không?

source: This will hard reset the emulated machine.
ca_es: Es farà una reinicialització completa de la màquina emulada.
cs_cz: Pokračováním se resetuje emulovaný počítač.
de_de: Dies wird zu einem Hard-Reset des emulierten Systems führen.
es_es: Se hará una reinicialización completa de la máquina emulada.
fi_fi: Tämä käynnistää emuloidun tietokoneen uudelleen.
fr_fr: Cela entraînera la réinitialisation complète de la machine émulée.
hr_hr: Ovo će napraviti hard resetiranje emuliranog sistema.
hu_hu: Ezzel hardveresen újraindítja az emulált gépet.
it_it: Questo riavvierà la macchina emulata.
ja_jp: 使用中のマシンがハードリセットされます。
pl_pl: To spowoduje twardy reset wirtualnej maszyny.
pt_br: Isto fará com que a máquina emulada seja reinicializada.
ru_ru: Это приведёт к холодной перезагрузке эмулируемой машины.
sk_sk: Pokračovaním sa resetuje emulovaný počítač.
sl_si: To bo ponovno zagnalo emuliran sistem.
tr_tr: Bu makineyi yeniden başlatacak.
uk_ua: Це призведе до холодної перезагрузки емульованої машини.
vi_vn: Lệnh này sẽ buộc khởi động lại máy ảo.

source: Save
ca_es: Desar
cs_cz: Uložit
de_de: Speichern
es_es: Guardar
fi_fi: Tallenna
fr_fr: Sauvegarder
hr_hr: Spremaj
hu_hu: Mentés
it_it: Salva
ja_jp: 保存
pl_pl: Zapisz
pt_br: Salvar
ru_ru: Сохранить
sk_sk: Uložiť
sl_si: Shrani
tr_tr: Kaydet
uk_ua: Зберегти
vi_vn: Lưu

source: About 86Box
ca_es: Quant a 86Box
cs_cz: O programu 86Box
de_de: Über 86Box
es_es: Acerca de 86Box
fi_fi: Tietoja 86Box:sta
fr_fr: À propos de 86Box
hr_hr: O programu 86Box
hu_hu: A 86Box névjegye
it_it: Informazioni su 86Box
ja_jp: 86Boxのバージョン情報
pl_pl: O 86Box
pt_br: Sobre o 86Box
ru_ru: О 86Box
sk_sk: O programe 86Box
sl_si: O programu 86Box
tr_tr: 86Box Hakkında
uk_ua: Про 86Box
vi_vn: Về 86Box
