Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: Sound &gain...
ca_es: &Guany de so...
cs_cz: &Zesílení zvuku
de_de: &Klangverstärkung...
es_es: &Ganancia de sonido...
fi_fi: &Äänitasot...
fr_fr: &Gain Son...
hr_hr: &Pojačanje zvuka...
hu_hu: &Hangerőszabályzó...
it_it: Guadagno &suono...
ja_jp: 音量調整(&G)...
pl_pl: Wzmocnienie &dźwięku...
pt_br: &Ganho de som...
ru_ru: &Усиление звука...
sk_sk: &Zosilnenie zvuku
sl_si: &Ojačanje zvoka...
tr_tr: &Ses yükseltici...
uk_ua: &Посилення звуку...
vi_vn: Bộ &tăng âm...

source: Open screenshots folder...
ru_ru: Открыть папку скриншотов...

source: Begin trace Ctrl+T
ca_es: Començar traça Ctrl+T
cs_cz: Začít trace Ctrl+T
de_de: Tracing starten Strg+T
es_es: Comenzar traza Ctrl+T
fi_fi: Aloita jäljitys Ctrl+T
fr_fr: Démarrer traces Ctrl+T
hr_hr: Z&apočni praćenje Ctrl+T
hu_hu: Nyomkövetés megkezdése Ctrl+T
it_it: Inizia traccia Ctrl+T
ja_jp: トレース開始 Ctrl+T
pl_pl: Rozpocznij śledzenie Ctrl+T
pt_br: Inicio do rastreamento Ctrl+T
ru_ru: Начать трассировку Ctrl+T
sk_sk: Začať trace Ctrl+T
sl_si: Z&ačni sledenje Ctrl+T
uk_ua: Почати трасування Ctrl+T
vi_vn: Bắt đầu dò Ctrl+T

source: End trace Ctrl+T
ca_es: Acabar traça Ctrl+T
cs_cz: Zastavit trace Ctrl+T
de_de: Tracing beenden Strg+T
es_es: Terminar traza Ctrl+T
fi_fi: Lopeta jäljitys Ctrl+T
fr_fr: Finir traces Ctrl+T
hr_hr: &Svrši praćenje Ctrl+T
hu_hu: Nyomkövetés befejezése Ctrl+T
it_it: Ferma traccia Ctrl+T
ja_jp: トレース終了 Ctrl+T
pl_pl: Zakończ śledzenie Ctrl+T
pt_br: Fim do rastreamento Ctrl+T
ru_ru: Завершить трассировку Ctrl+T
sk_sk: Zastaviť trace Ctrl+T
sl_si: &Končaj sledenje Ctrl+T
uk_ua: Завершити трасування Ctrl+T
vi_vn: Ngưng dò Ctrl+T

source: &Help
ca_es: &Ajuda
cs_cz: Ná&pověda
de_de: &Hilfe
es_es: &Ayuda
fi_fi: &Ohje
fr_fr: &Aide
hr_hr: &Pomoć
hu_hu: &Súgó
ja_jp: ヘルプ(&H)
pl_pl: &Pomoc
pt_br: &Ajuda
ru_ru: &Помощь
sk_sk: &Pomoc
sl_si: &Pomoč
tr_tr: &Yardım
uk_ua: &Допомога
vi_vn: &Trợ giúp

source: &Documentation...
ca_es: &Documentació...
cs_cz: &Dokumentace
de_de: &Dokumentation...
es_es: &Documentación...
fi_fi: &Ohjekirja...
hr_hr: &Dokumentacija...
hu_hu: &Dokumentáció...
it_it: &Documentazione...
ja_jp: 文書(&D)...
pl_pl: &Dokumentacja...
pt_br: &Documentação...
ru_ru: &Документация...
sk_sk: &Dokumentácia
sl_si: &Dokumentacija...
tr_tr: &Dökümanlar...
uk_ua: &Документація...
vi_vn: &Trợ giúp...

source: &About 86Box...
ca_es: &Quant a 86Box...
cs_cz: &O programu 86Box
de_de: &Über 86Box...
es_es: &Acerca de 86Box...
fi_fi: &Tietoja 86Boxista...
fr_fr: &A Propos de 86Box...
hr_hr: &O programu 86Box...
hu_hu: A 86Box &névjegye...
it_it: &Informazioni su 86Box...
ja_jp: 86Boxのバージョン情報(&A)...
pl_pl: &O 86Box...
pt_br: &Sobre o 86Box...
ru_ru: &О программе 86Box...
sk_sk: &O programu 86Box
sl_si: &O programu 86Box...
tr_tr: &86Box Hakkında...
uk_ua: &Про програму 86Box...
vi_vn: &Về 86Box...

source: &New image...
ca_es: &Nova imatge...
cs_cz: &Nový obraz...
de_de: &Neues Image...
es_es: &Nueva imagen...
fi_fi: &Uusi kasettikuva...
fr_fr: &Nouvelle image...
hr_hr: &Nova slika...
hu_hu: &Új képfájl létrehozása...
it_it: &Nuova immagine...
ja_jp: 新規イメージ(&N)...
pl_pl: &Nowy obraz...
pt_br: &Nova imagem...
ru_ru: &Новый образ...
sk_sk: &Nový obraz...
sl_si: &Nova slika...
tr_tr: &Yeni imaj oluştur...
uk_ua: &Новий образ...
vi_vn: Tạo file ảnh đĩa mới...

source: &Existing image...
ca_es: Imatge &Existent...
cs_cz: &Existující obraz...
de_de: &Bestehendes Image...
es_es: Imagen &Existente...
fi_fi: &Olemassaoleva kasettikuva...
fr_fr: Image &Existante...
hr_hr: &Postojeća slika...
hu_hu: Meglévő képfájl &megnyitása...
it_it: &Immagine esistente...
ja_jp: 既存のイメージを開く(&E)...
pl_pl: &Istniejący obraz...
pt_br: &Imagem existente...
ru_ru: &Выбрать образ...
sk_sk: &Existujúci obraz...
sl_si: &Obstoječa slika...
tr_tr: &İmaj seç...
uk_ua: &Вибрати образ...
vi_vn: Ảnh đĩa có sẵn...

source: Existing image (&Write-protected)...
ca_es: Imatge Existent (&Només-lectura)...
cs_cz: Existující obraz (&ochrana proti zápisu)...
de_de: Bestehendes Image (&schreibgeschützt)...
es_es: Imagen Existente (&Sólo-lectura)...
fi_fi: Olemassaoleva kasettikuva (&kirjoitussuojattu)...
fr_fr: Image Existante(&Lecture seule)...
hr_hr: Postojeća slika (&zaštićena od pisanja)...
hu_hu: Meglévő képfájl megnyitása (&írásvédett)...
it_it: Immagine esistente (&protezione contro scrittura)...
ja_jp: 既存のイメージを開く(書き込み禁止)(&W)...
pl_pl: Istniejący obraz (&Chroniony przed zapisem)...
pt_br: Imagem existente (&protegida contra escrita)...
ru_ru: Выбрать образ (&Защита от записи)...
sk_sk: Existujúci obraz (&ochrana proti zápisu)...
sl_si: Obstoječa slika (&samo za branje)...
tr_tr: İmaj &seç (Yazma-korumalı)...
uk_ua: Вибрати образ (&Захист від запису)...
vi_vn: Ảnh đĩa có sẵn (chống ghi đè)...

source: &Record
ca_es: &Gravar
cs_cz: &Nahrávat
de_de: &Aufnehmen
es_es: &Grabar
fi_fi: &Nauhoita
fr_fr: En&registrer
hr_hr: &Snimi
hu_hu: &Felvétel
it_it: &Registra
ja_jp: 録音(&R)
pl_pl: &Nagraj
pt_br: &Gravar
ru_ru: &Запись
sk_sk: &Nahrávať
sl_si: Snemaj
tr_tr: &Kaydet
uk_ua: &Запис
vi_vn: &Ghi lại

source: &Play
ca_es: &Reproduir
cs_cz: &Přehrát
de_de: &Abspielen
es_es: &Reproducir
fi_fi: &Toista
fr_fr: &Jouer
hr_hr: &Pokreni
hu_hu: &Lejátszás
it_it: R&iproduci
ja_jp: 再生(&P)
pl_pl: &Odtwórz
pt_br: &Reproduzir
ru_ru: &Воспроизведение
sk_sk: &Prehrať
sl_si: Predvajaj
tr_tr: &Oynat
uk_ua: &Відтворення
vi_vn: &Phát

source: &Rewind to the beginning
ca_es: &Rebobinar a l'inici
cs_cz: Přetočit na &začátek
de_de: &An den Anfang zurückspulen
es_es: &Rebobinar al inicio
fi_fi: Kelaa &alkuun
fr_fr: &Revenir au debut
hr_hr: P&remotaj na početak
hu_hu: &Visszatekerés az elejére
it_it: Ri&avvolgi all'inizio
ja_jp: 先頭まで巻き戻す(&R)
pl_pl: &Przewiń do początku
pt_br: &Rebobinar até o começo
ru_ru: &Перемотка на начало
sk_sk: Previnuť na &začiatok
sl_si: Previj na začetek
tr_tr: &Başlangıca geri sar
uk_ua: &Перемотування на початок
vi_vn: &Tua về đầu

source: &Fast forward to the end
ca_es: &Avanç ràpid al final
cs_cz: Přetočit na &konec
de_de: &An das Ende vorspulen
es_es: &Avance rápido al final
fi_fi: Kelaa &loppuun
fr_fr: Aller à la &Fin
hr_hr: &Preskoči do kraja
hu_hu: &Előretekerés a végére
it_it: A&vanti veloce alla fine
ja_jp: 最後まで早送り(&F)
pl_pl: &Przewiń do końca
pt_br: &Avançar até o fim
ru_ru: &Перемотка в конец
sk_sk: Previnuť na &koniec
sl_si: Preskoči na konec
tr_tr: Sona doğru &ileri sar
uk_ua: &Перемотування у кінець
vi_vn: T&iến về cuối

source: E&ject
ca_es: E&xtreure
cs_cz: &Vyjmout
de_de: A&uswerfen
es_es: E&xtraer
fi_fi: &Poista kasettipesästä
fr_fr: E&jecter
hr_hr: &Izbaci
hu_hu: &Kiadás
it_it: &Espelli
ja_jp: 取り出す(&J)
pl_pl: W&yjmij
pt_br: E&jetar
ru_ru: И&звлечь
sk_sk: &Vystrihnúť
sl_si: Izvrzi
tr_tr: &Çıkar
uk_ua: &Вилучити
vi_vn: Đẩy đĩ&a ra

source: Eject %s
ru_ru: Извлечь %s

source: &Image...
ca_es: &Imatge...
cs_cz: &Obraz...
de_de: &Cartridgeimage...
es_es: &Imagen...
fi_fi: &ROM-moduulikuva...
hr_hr: &Slika...
hu_hu: Kép&fájl...
it_it: &Immagine...
ja_jp: イメージ(&I)...
pl_pl: &Obraz...
pt_br: &Imagem...
ru_ru: &Образ...
sk_sk: &Obraz...
sl_si: Slika...
tr_tr: &İmaj...
uk_ua: &Образ...
vi_vn: &Ảnh đĩa...

source: E&xport to 86F...
ca_es: E&xportar a 86F...
cs_cz: E&xportovat do 86F...
de_de: &In das 86F-Format e&xportieren...
es_es: E&xportar a 86F...
fi_fi: &Vie 86F-tiedostoon...
fr_fr: E&xport vers 86F...
hr_hr: &Izvozi u 86F...
hu_hu: E&xportálás 86F formátumba...
it_it: E&sporta in 86F...
ja_jp: 86Fイメージにエクスポート(&X)...
pl_pl: E&ksportuj do 86F...
pt_br: E&xportar para 86F...
ru_ru: Э&кспорт в 86F...
sk_sk: E&xportovať do 86F...
sl_si: &Izvozi v 86F...
tr_tr: &86F dosyası olarak aktar...
uk_ua: &Експорт в 86F...
vi_vn: Xuất ra f&ile 86F...

source: &Mute
ca_es: &Silenciar
cs_cz: &Ztišit
de_de: &Stummschalten
es_es: &Silenciar
fi_fi: &Mykistä
fr_fr: &Couper
hr_hr: &Isključi zvuk
hu_hu: &Némítás
it_it: &Muto
ja_jp: ミュート(&M)
pl_pl: &Ścisz
pt_br: &Sem som
ru_ru: О&тключить звук
sk_sk: &Stíšiť
sl_si: &Utišaj
tr_tr: &Sesi kapat
uk_ua: &Відключити звук
vi_vn: Tắt tiến&g

source: &Unmute
ru_ru: В&ключить звук

source: E&mpty
ca_es: E&xtreure disc
cs_cz: &Vyjmout
de_de: L&eer
es_es: E&xtraer disco
fi_fi: &Tyhjä
fr_fr: E&jecter
hr_hr: &Prazno
hu_hu: &Kiadás
it_it: &Espelli
ja_jp: なし(&M)
pl_pl: P&usty
pt_br: &Vazio
ru_ru: П&устой
sk_sk: &Vystrihnúť
sl_si: &Prazen
tr_tr: İmajı &çıkar
uk_ua: &Пустий
vi_vn: Làm trố&ng đĩa

source: &Reload previous image
ca_es: &Recarregar imatge prèvia
cs_cz: &Načíst znova předchozí obraz
de_de: &Voriges Image neu laden
es_es: &Recargar imagen previa
fi_fi: &Lataa edellinen levykuva uudelleen
fr_fr: &Recharger image précedente
hr_hr: &Ponovo učitaj prethodnu sliku
hu_hu: Előző képfájl &újratöltése
it_it: &Ricarica l'immagine precedente
ja_jp: 前のイメージを再読み込み(&R)
pl_pl: &Przeładuj poprzedni obraz
pt_br: &Recarregar imagem anterior
ru_ru: &Снова загрузить предыдущий образ
sk_sk: &Načítať znova predchádzajúci obraz
sl_si: &Naloži zadnjo sliko
tr_tr: &Önceki imajı seç
uk_ua: &Знову завантажити попередній образ
vi_vn: Load đĩ&a trước đó

source: &Folder...
ca_es: &Carpeta...
cs_cz: &Složka...
de_de: &Verzeichnis...
es_es: &Carpeta...
fi_fi: &Kansio...
fr_fr: &Dossier...
hr_hr: &Mapa...
hu_hu: &Mappa...
it_it: &Cartella...
ja_jp: フォルダ(&F)...
pl_pl: &Teczka...
pt_br: &Pasta...
ru_ru: &Папка...
sk_sk: &Zložka...
sl_si: &Mapa...
tr_tr: &Klasör...
uk_ua: &Тека...
vi_vn: Thư mụ&c

source: Target &framerate
ca_es: &Taxa de refresc objectiu
cs_cz: &Cílová snímková frekvence
de_de: Ziel&framerate
es_es: &Tasa de refresco objetivo
fi_fi: &Kuvataajuustavoite
fr_fr: &Taux de rafraîchissement cible
hr_hr: &Ciljni broj okvira u sekundi
hu_hu: Cél &képkockasebesség
it_it: Imposta obiettivo &fotogrammi
ja_jp: 目標フレームレート(&F)
pl_pl: Docelowa &liczba klatek na sekundę
pt_br: &Taxa de quadro pretendida
ru_ru: Целевая &частота кадров
sk_sk: &Cieľová snímková frekvencia
sl_si: &Ciljno št. sličic na sekundo
tr_tr: Hedef &kare oranı
uk_ua: Цільова &частота кадрів
vi_vn: Số khung hình mục tiêu

source: &Sync with video
ca_es: &Sincronitzar amb vídeo
cs_cz: &Synchronizovat s obrazem
de_de: &Mit Videoausgabe synchronisieren
es_es: &Sincronizar con vídeo
fi_fi: &Synkronisoi videoon
fr_fr: &Synchronisation avec la vidéo
hr_hr: &Sinkroniziraj s videom
hu_hu: &Szinkronizálás a videóval
it_it: &Sincronizza col video
ja_jp: ビデオと同期(&S)
pl_pl: &Zsynchronizuj z wideo
pt_br: &Sincronizar com vídeo
ru_ru: &Синхронизация с видео
sk_sk: &Synchronizovať s obrazom
sl_si: &Sinhroniziraj z videom
tr_tr: Video ile &senkronize et
uk_ua: &Синхронізація з відео
vi_vn: Đồng bộ &với video

source: &25 fps
fi_fi: &25 ruutua/s
fr_fr: &25 images par seconde
ja_jp: 25 fps(&2)
pt_br: &25 qps
ru_ru: &25 кадров в секунду
uk_ua: &25 кадрів в секунду

source: &30 fps
fi_fi: &30 ruutua/s
fr_fr: &30 images par seconde
ja_jp: 30 fps(&3)
pt_br: &30 qps
ru_ru: &30 кадров в секунду
uk_ua: &30 кадрів в секунду

source: &50 fps
fi_fi: &50 ruutua/s
fr_fr: &50 images par seconde
ja_jp: 50 fps(&5)
pt_br: &50 qps
ru_ru: &50 кадров в секунду
uk_ua: &50 кадрів в секунду

source: &60 fps
fi_fi: &60 ruutua/s
fr_fr: &60 images par seconde
ja_jp: 60 fps(&6)
pt_br: &60 qps
ru_ru: &60 кадров в секунду
uk_ua: &60 кадрів в секунду

source: &75 fps
fi_fi: &75 ruutua/s
fr_fr: &75 images par seconde
ja_jp: 75 fps(&7)
pt_br: &75 qps
ru_ru: &75 кадров в секунду
uk_ua: &75 кадрів в секунду

source: &Select shader...
ca_es: &Seleccionar shader...
cs_cz: &Zvolit shader...
de_de: &Shader auswählen...
es_es: &Seleccionar shader...
fi_fi: Valitse varjostin&ohjelma...
fr_fr: Sé&lectionnez le shader...
hr_hr: &Odaberi shader...
hu_hu: Shader &kiválasztása...
it_it: &Seleziona shader...
ja_jp: シェーダーを選択(&S)...
pl_pl: &Wybierz shader...
pt_br: &Selecionar shader...
ru_ru: &Выбрать шейдер...
sk_sk: &Zvoliť shader...
sl_si: &Izberi senčilnik...
tr_tr: Gölgelendirici &seç...
uk_ua: &Вибрати шейдер...
vi_vn: &Chọn shader...

source: &Remove shader
ca_es: &Eliminar shader
cs_cz: &Odebrat shader
de_de: &Shader entfernen
es_es: &Eliminar shader
fi_fi: &Poista varjostinohjelma
fr_fr: S&upprimer le shader
hr_hr: &Ukloni shader
hu_hu: Shader &eltávolítása
it_it: &Rimuovi shader
ja_jp: シェーダーを削除(&R)
pl_pl: &Usuń shader
pt_br: &Remover shader
ru_ru: &Удалить шейдер
sk_sk: &Odobrať shader
sl_si: &Odstrani senčilnik
tr_tr: &Gölgelendiriciyi kaldır
uk_ua: &Видалити шейдер
vi_vn: &Bỏ shader

source: Preferences
ca_es: Preferències
cs_cz: Předvolby
de_de: Einstellungen
es_es: Preferencias
fi_fi: Sovellusasetukset
fr_fr: Préférences
hr_hr: Postavke
hu_hu: Beállítások
it_it: Preferenze
ja_jp: 環境設定
pl_pl: Preferencje
pt_br: Preferências
ru_ru: Параметры
sk_sk: Predvoľby
sl_si: Možnosti
tr_tr: Tercihler
uk_ua: Параметри
vi_vn: Tùy biến

source: Sound Gain
ca_es: Guany de So
cs_cz: Zesílení zvuku
de_de: Klangverstärkung
es_es: Ganancia de Sonido
fi_fi: Äänen taso
fr_fr: Gain son
hr_hr: Pojačavanje zvuka
hu_hu: Hangerőszabályzó
it_it: Guadagno del suono
ja_jp: 音量ゲイン
pl_pl: Wzmocnienie dźwięku
pt_br: Ganho de som
ru_ru: Усиление звука
sk_sk: Zosilnenie zvuku
sl_si: Ojačanje zvoka
tr_tr: Ses Artırma
uk_ua: Посилення звуку
vi_vn: Tăng âm

source: New Image
ca_es: Nova Imatge
cs_cz: Nový obraz
de_de: Neues Image
es_es: Nueva Imagen
fi_fi: Uusi levykuva
fr_fr: Nouvelle image
hr_hr: Nova slika
hu_hu: Új képfájl létrehozása
it_it: Nuova immagine
ja_jp: 新規のイメージ
pl_pl: Nowy obraz
pt_br: Nova imagem de disquete
ru_ru: Новый образ
sk_sk: Nový obraz
sl_si: Nova slika
tr_tr: Yeni İmaj
uk_ua: Новий образ
vi_vn: Ảnh đĩa mới

source: Settings
ca_es: Ajustaments
cs_cz: Nastavení
de_de: Optionen
es_es: Configuraciones
fi_fi: Kokoonpano
fr_fr: Réglages
hr_hr: Opcije
hu_hu: Konfigurálás
it_it: Impostazioni
ja_jp: 設定
pl_pl: Ustawienia
pt_br: Configurações
ru_ru: Настройки
sk_sk: Nastavenia
sl_si: Nastavitve
tr_tr: Ayarlar
uk_ua: Налаштування
vi_vn: Cài đặt

source: Specify Main Window Dimensions
ca_es: Especificar Dimensions de la Finestra Principal
cs_cz: Zadat rozměry hlavního okna
de_de: Fenstergröße einstellen
es_es: Especificar Dimensiones de la Ventana Principal
fi_fi: Määritä pääikkunan koko
fr_fr: Spécifier le détournement de la fenêtre principale
hr_hr: Odredite glavne dimenzije prozora
hu_hu: Főablak méreteinek megadása
it_it: Specifica dimensioni della finestra principale
ja_jp: メインウィンドウのサイズ指定
pl_pl: Określ rozmiary okna
pt_br: Especifique as dimensões da janela principal
ru_ru: Указать размеры главного окна
sk_sk: Zadať rozmery hlavného okna
sl_si: Določi velikost glavnega okna
tr_tr: Ana Pencere Boyutunu Belirle
uk_ua: Вказати розміри головного вікна
vi_vn: Tùy biến kích thước cửa sổ chính

source: Cancel
ca_es: Anuŀlació
cs_cz: Storno
de_de: Abbrechen
es_es: Cancelar
fi_fi: Peruuta
fr_fr: Annuler
hr_hr: Otkaži
hu_hu: Mégse
it_it: Annulla
ja_jp: キャンセル
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
sk_sk: Storno
sl_si: Prekliči
tr_tr: İptal et
uk_ua: Відміна
vi_vn: Thôi

source: Save these settings as &global defaults
ca_es: Salvar aquests paràmetres com per &defecte globalment
cs_cz: Uložit toto nastavení jako &globální výchozí stav
de_de: Einstellungen als &globalen Standard speichern
es_es: Salvar estos configuraciones como por &defecto globalmente
fi_fi: Tallenna nämä asetukset &globaaleiksi oletuksiksi
fr_fr: Sauvegarder ces paramètres comme valeurs par défaut &globales
hr_hr: Spremite ove postavke kao &globalne zadane postavke
hu_hu: Beállítások mentése &globális alapértékként
it_it: Salva queste impostazioni come &predefinite globali
ja_jp: これらの設定をグローバル既定値として保存(&G)
pl_pl: Zapisz ustawienia jako &globalne ustawienia domyślne
pt_br: Usar estas configurações como &padrões globais
ru_ru: Сохранить эти параметры как &глобальные по умолчанию
sk_sk: Uložiť toto nastavenie ako &globálny východiskový stav
sl_si: Shrani te nastavitve kot globalne privzete
tr_tr: Bu ayarları &varsayılan olarak kaydet
uk_ua: Зберегти ці параметри як &глобальні за замовчуванням
vi_vn: Lưu cài đặt làm mặc định chung

source: &Default
ca_es: &Per defecte
cs_cz: &Výchozí
de_de: &Standard
es_es: &Por defecto
fi_fi: &Oletus
fr_fr: &Défaut
hr_hr: Zadano
hu_hu: &Alapértelmezett
it_it: &Predefinito
ja_jp: 既定値(&D)
pl_pl: &Domyślny
pt_br: &Padrão
ru_ru: &По умолчанию
sk_sk: &Východiskové
sl_si: Privzeto
tr_tr: &Varsayılan
uk_ua: &За замовчуванням
vi_vn: &Mặc định

source: Language:
ca_es: Idioma:
cs_cz: Jazyk:
de_de: Sprache:
es_es: Idioma:
fi_fi: Kieli:
fr_fr: Langue:
hr_hr: Jezik:
hu_hu: Nyelv:
it_it: Lingua:
ja_jp: 言語:
pl_pl: Język:
pt_br: Idioma:
ru_ru: Язык:
sk_sk: Jazyk:
sl_si: Jezik:
tr_tr: Dil:
uk_ua: Мова:
vi_vn: Ngôn ngữ:

source: Icon set:
ca_es: Conjunt d'icones:
cs_cz: Sada ikon:
de_de: Icon-Satz:
es_es: Juego de iconos:
fi_fi: Kuvakkeet:
fr_fr: Ensemble d'icônes:
hr_hr: Paket ikona:
hu_hu: Ikonkészlet:
it_it: Pacchetto di icone:
ja_jp: アイコンセット:
pl_pl: Zestaw ikon:
pt_br: Pacote de ícones:
ru_ru: Набор иконок:
sk_sk: Súprava ikon:
sl_si: Komplet ikon:
tr_tr: Simge seti:
uk_ua: Набір іконок:
vi_vn: Bộ biểu tượng:

source: Gain
ca_es: Guany
cs_cz: Zesílení
de_de: Verstärkung
es_es: Ganancia
fi_fi: Taso
hr_hr: Pojačavanje
hu_hu: Hangerő
it_it: Guadagno
ja_jp: 音量
pl_pl: Wzmacniacz
pt_br: Ganho
ru_ru: Усиление
sk_sk: Zosilnenie
sl_si: Ojačanje
tr_tr: Artırma
uk_ua: Посилення
vi_vn: Tăng

source: File name:
ca_es: Nom del fitxer:
cs_cz: Název souboru:
de_de: Dateiname:
es_es: Nombre de archivo:
fi_fi: Tiedostonimi:
fr_fr: Nom fichier:
hr_hr: Ime datoteke:
hu_hu: Fájlnév:
it_it: Nome file:
ja_jp: ファイル名:
pl_pl: Nazwa pliku:
pt_br: Nome:
ru_ru: Имя файла:
sk_sk: Názov súboru:
sl_si: Ime datoteke:
tr_tr: Dosya adı:
uk_ua: Ім'я файлу:
vi_vn: Tên tập tin:

source: Disk size:
ca_es: Grandària de disc:
cs_cz: Velikost disku:
de_de: Plattengröße:
es_es: Tamaño de disco:
fi_fi: Levyn koko:
fr_fr: Taille disque:
hr_hr: Veličina diska:
hu_hu: Méret:
it_it: Dimensioni disco:
ja_jp: ディスクサイズ:
pl_pl: Rozmiar dysku:
pt_br: Tamanho:
ru_ru: Размер диска:
sk_sk: Veľkosť disku:
sl_si: Velikost diska:
tr_tr: Disk boyutu:
uk_ua: Розмір диска:
vi_vn: Kích thước đĩa:

source: RPM mode:
ca_es: Mode RPM:
cs_cz: Režím ot./m:
de_de: Drehzahlmodus:
es_es: Modo RPM:
fi_fi: Kierroslukutila:
fr_fr: Mode RPM:
hr_hr: Način broja okretaja:
hu_hu: RPM-mód:
it_it: Modalità RPM:
ja_jp: RPMモード:
pl_pl: Tryb RPM:
pt_br: Modo RPM:
ru_ru: RPM режим:
sk_sk: Režim ot./m:
sl_si: Način števila obratov:
tr_tr: RPM modu:
uk_ua: RPM режим:
vi_vn: Tốc độ vòng quay:

source: Progress:
ca_es: Progrés:
cs_cz: Průběh:
de_de: Fortschritt:
es_es: Progreso:
fi_fi: Edistyminen:
fr_fr: Progrès:
hr_hr: Napredak:
hu_hu: Folyamat:
it_it: Progresso:
ja_jp: 進行状況:
pl_pl: Postęp:
pt_br: Progresso:
ru_ru: Прогресс:
sk_sk: Priebeh:
sl_si: Napredek:
tr_tr: İşlem:
uk_ua: Прогрес:
vi_vn: Tiến trình:

source: Width:
ca_es: Amplada:
cs_cz: Šířka:
de_de: Breite:
es_es: Ancho:
fi_fi: Leveys:
fr_fr: Largeur:
hr_hr: Širina:
hu_hu: Szélesség:
it_it: Larghezza:
ja_jp: 幅:
pl_pl: Szerokość:
pt_br: Largura:
ru_ru: Ширина:
sk_sk: Šírka:
sl_si: Širina:
tr_tr: Genişlik:
uk_ua: Ширина:
vi_vn: Chiều rộng:

source: Height:
ca_es: Alçada:
cs_cz: Výška:
de_de: Höhe:
es_es: Alto:
fi_fi: Korkeus:
fr_fr: Hauteur:
hr_hr: Visina:
hu_hu: Magasság:
it_it: Altezza:
ja_jp: 高さ:
pl_pl: Wysokość:
pt_br: Altura:
ru_ru: Высота:
sk_sk: Výška:
sl_si: Višina:
tr_tr: Yükseklik:
uk_ua: Висота:
vi_vn: Chiều cao:

source: Lock to this size
ca_es: Bloquejar aquesta mida
cs_cz: Uzamknout na tyto rozměry
de_de: Feste Größe
es_es: Bloquear a este tamaño
fi_fi: Lukitse tähän kokoon
fr_fr: Verrouiller à cette taille
hr_hr: Zaključajte na ovu veličinu
hu_hu: Rögzítés a megadott méretre
it_it: Blocca in queste dimensioni
ja_jp: サイズを固定
pl_pl: Stały rozmiar
pt_br: Travar nesse tamanho
ru_ru: Зафиксировать размер
sk_sk: Uzamknúť na tieto rozmery
sl_si: Zakleni na to velikost
tr_tr: Bu boyuta kilitle
uk_ua: Зафіксувати розмір
vi_vn: Cố định kích thước hình hiện tại

source: Machine type:
ca_es: Tipus de màquina:
cs_cz: Typ počítače:
de_de: Systemtyp:
es_es: Tipo de máquina:
fi_fi: Tietokoneen tyyppi:
fr_fr: Type de machine:
hr_hr: Tip sistema:
hu_hu: Géptípus:
it_it: Tipo di piastra madre:
ja_jp: マシンタイプ:
pl_pl: Rodzaj maszyny:
pt_br: Tipo de máquina:
ru_ru: Тип машины:
sk_sk: Typ počítača:
sl_si: Vrsta sistema:
tr_tr: Makine türü:
uk_ua: Тип машини:
vi_vn: Loại máy:

source: Machine:
ca_es: Màquina:
cs_cz: Počítač:
de_de: System:
es_es: Máquina:
fi_fi: Tietokone:
hr_hr: Sistem:
hu_hu: Számítógép:
it_it: Piastra madre:
ja_jp: マシン:
pl_pl: Maszyna:
pt_br: Máquina:
ru_ru: Системная плата:
sk_sk: Počítač:
sl_si: Sistem:
tr_tr: Makine:
uk_ua: Системна плата:
vi_vn: Mẫu máy:

source: Configure
ca_es: Configurar
cs_cz: Nastavit
de_de: Einstellen
es_es: Configurar
fi_fi: Määritys
fr_fr: Configurer
hr_hr: Namjesti
hu_hu: Beállítások...
it_it: Configura
ja_jp: 設定
pl_pl: Konfiguruj
pt_br: Configurar
ru_ru: Настройка
sk_sk: Nastaviť
sl_si: Nastavi
tr_tr: Ayarla
uk_ua: Налаштування
vi_vn: Tinh chỉnh

source: CPU type:
ca_es: Tipus de CPU:
cs_cz: Procesor:
de_de: CPU-Typ:
es_es: Tipo de CPU:
fi_fi: Suorittimen tyyppi:
fr_fr: Type du processeur:
hr_hr: Tip procesora:
hu_hu: Processzor:
it_it: Tipo del CPU:
ja_jp: CPUタイプ:
pl_pl: Rodzaj procesora:
pt_br: Tipo de CPU:
ru_ru: Тип ЦП:
sk_sk: Procesor:
sl_si: Vrsta procesorja:
tr_tr: CPU türü:
uk_ua: Тип ЦП:
vi_vn: Loại CPU:

source: Speed:
ca_es: Velocitat:
cs_cz: Rychlost:
de_de: Takt:
es_es: Velocidad:
fi_fi: Nopeus:
fr_fr: Vitesse:
hr_hr: Brzina:
hu_hu: Seb.:
it_it: Veloc.:
ja_jp: 速度:
pl_pl: Szybkość:
pt_br: Veloc.:
ru_ru: Скорость:
sk_sk: Rýchlosť:
sl_si: Hitrost:
tr_tr: Hız:
uk_ua: Швидкість:
vi_vn: Tốc độ:

source: Frequency:
ca_es: Freqüència:
cs_cz: Frekvence:
de_de: Frequenz:
es_es: Frecuencia:
fi_fi: Taajuus:
fr_fr: Fréquence:
hr_hr: Frekvencija:
hu_hu: Frekvencia:
it_it: Frequenza:
ja_jp: 頻度:
pl_pl: Częstotliwość:
pt_br: Frequência:
ru_ru: Частота:
sk_sk: Frekvencia:
sl_si: Pogostost:
tr_tr: Sıklık:
uk_ua: Частота:
vi_vn: Tần số xung:

source: Wait states:
ca_es: Estats en espera:
cs_cz: Čekací stavy:
de_de: Wartezustände:
es_es: Estados en espera:
fi_fi: Odotustilat:
fr_fr: États d'attente:
hr_hr: Stanja čekanja:
hu_hu: Várak. ciklusok:
it_it: Stati di attesa:
ja_jp: ウェイトステート:
pl_pl: Stany oczekiwania:
pt_br: Estados de espera:
ru_ru: Циклы ожидания:
sk_sk: Čakacie stavy:
sl_si: Čakalna stanja:
tr_tr: Bekleme süreleri:
uk_ua: Цикли очікування:
vi_vn: Trạng thái chờ:

source: MB
fi_fi: Mt
fr_fr: Mo
ru_ru: МБ
uk_ua: МБ

source: Memory:
ca_es: Memòria:
cs_cz: Pamět:
de_de: Hauptspeicher:
es_es: Memoria:
fi_fi: Muisti:
fr_fr: Mémoire:
hr_hr: Memorija:
hu_hu: Memória:
it_it: Memoria:
ja_jp: メモリ:
pl_pl: Pamięć:
pt_br: Memória:
ru_ru: Память:
sk_sk: Pamäť:
sl_si: Spomin:
tr_tr: Bellek:
uk_ua: Пам'ять:
vi_vn: Bộ nhớ (RAM):

source: Time synchronization
ca_es: Sincronització horària
cs_cz: Synchronizace času
de_de: Zeitsynchronisierung
es_es: Sincronización horaria
fi_fi: Kellon synkronointi
fr_fr: Synchronisation du temps
hr_hr: Sinkronizacija vremena
hu_hu: Idő szinkronizáció
it_it: Sincronizzazione dell'ora
ja_jp: 時刻同期機能
pl_pl: Synchronizacja czasu
pt_br: Sincronização da hora
ru_ru: Синхронизация времени
sk_sk: Synchronizácia času
sl_si: Sinhronizacija časa
tr_tr: Zaman senkronizasyonu
uk_ua: Синхронізація часу
vi_vn: Đồng bộ thời gian

source: Disabled
ca_es: Desactuvat
cs_cz: Vypnuta
de_de: Deaktiviert
es_es: Deshabilitado
fi_fi: Ei käytössä
fr_fr: Désactivé
hr_hr: Isključeno
hu_hu: Letiltva
it_it: Disabilitata
ja_jp: 無効
pl_pl: Wyłączona
pt_br: Desativar
ru_ru: Отключено
sk_sk: Vypnutá
sl_si: Onemogočeno
tr_tr: Devre dışı
uk_ua: Відключити
vi_vn: Vô hiệu hóa
