Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: Enabled (local time)
ca_es: Activat (hora local)
cs_cz: Zapnuta (místní čas)
de_de: Aktiviert (Lokale Uhrzeit)
es_es: Habilitado (hora local)
fi_fi: Käytössä (paikallinen)
fr_fr: Activé (heure locale)
hr_hr: Uključeno (lokalno vrijeme)
hu_hu: Engedélyezve (helyi idő)
it_it: Abilitata (ora locale)
ja_jp: 有効(現地時間)
pl_pl: Włączona (czas lokalny)
pt_br: Ativar (hora local)
ru_ru: Включено (местное)
sk_sk: Zapnutá (miestny čas)
sl_si: Omogočeno (lokalni čas)
tr_tr: Etkin (yerel zaman)
uk_ua: Увімкнути (місцеве)
vi_vn: Bật (giờ địa phương)

source: Enabled (UTC)
ca_es: Activat (UTC)
cs_cz: Zapnuta (UTC)
de_de: Aktiviert (UTC)
es_es: Habilitado (UTC)
fi_fi: Käytössä (UTC)
fr_fr: Activé (UTC)
hr_hr: Uključeno (UTC)
hu_hu: Engedélyezve (UTC)
it_it: Abilitata (UTC)
ja_jp: 有効(UTC)
pl_pl: Włączona (UTC)
pt_br: Ativar (UTC)
ru_ru: Включено (UTC)
sk_sk: Zapnutá (UTC)
sl_si: Omogočeno (UTC)
tr_tr: Etkin (UTC)
uk_ua: Увімкнути (UTC)
vi_vn: Bật (UTC)

source: Dynamic Recompiler
ca_es: Recopilador Dinàmic
cs_cz: Dynamický překladač
de_de: Dynamischer Recompiler
es_es: Recompilador Dinámico
fi_fi: Dynaaminen uudelleenkääntäjä
fr_fr: Recompilateur dynamique
hr_hr: Dinamički rekompilator
hu_hu: Dinamikus újrafordítás
it_it: Ricompilatore dinamico
ja_jp: 動的再コンパイル
pl_pl: Dynamiczny rekompilator
pt_br: Recompilador dinâmico
ru_ru: Динамический рекомпилятор
sk_sk: Dynamický prekladač
sl_si: Dinamični prevajalnik
tr_tr: Dinamik Derleyici
uk_ua: Динамічний рекомпілятор
vi_vn: Bộ tái biên dịch động (Dynamic Recompiler)

source: Video:
ca_es: Vídeo:
cs_cz: Grafika:
de_de: Videokarte:
es_es: Vídeo:
fi_fi: Näytönohjain:
fr_fr: Vidéo:
hu_hu: Videokártya:
ja_jp: ビデオカード:
pl_pl: Wideo:
pt_br: Vídeo:
ru_ru: Видеокарта 1:
sk_sk: Grafika:
tr_tr: Ekran kartı:
uk_ua: Відеокарта:

source: Video #2:
ru_ru: Видеокарта 2:

source: Voodoo Graphics
ca_es: Gràfics Voodoo
cs_cz: Použít grafický akcelerátor Voodoo
de_de: Voodoo-Grafik
fi_fi: Voodoo-grafiikkasuoritin
fr_fr: Graphique Voodoo
hr_hr: Voodoo grafika
hu_hu: Voodoo-gyorsítókártya
it_it: Grafica Voodoo
ja_jp: Voodooグラフィック
pl_pl: Grafika Voodoo
pt_br: 3DFX Voodoo
ru_ru: Ускоритель Voodoo
sk_sk: Použiť grafický akcelerátor Voodoo
sl_si: Voodoo grafika
tr_tr: Voodoo Grafikleri
uk_ua: Прискорювач Voodoo
vi_vn: Đồ họa Voodoo

source: IBM 8514/A Graphics
ca_es: Gràfics IBM 8514/A
cs_cz: Grafika IBM 8514/A
de_de: IBM 8514/A-Grafik
fi_fi: IBM 8514/A-grafiikkasuoritin
fr_fr: Graphique IBM 8514/A
hr_hr: IBM 8514/A grafika
hu_hu: IBM 8514/A-gyorsítókártya
it_it: Grafica IBM 8514/A
ja_jp: IBM 8514/Aグラフィック
pl_pl: Grafika IBM 8514/A
pt_br: Gráficos IBM 8514/A
ru_ru: Ускоритель IBM 8514/A
sk_sk: Grafika IBM 8514/A
sl_si: IBM 8514/A grafika
tr_tr: IBM 8514/A Grafikleri
uk_ua: Прискорювач IBM 8514/A
vi_vn: Đồ họa IBM 8514/A

source: XGA Graphics
ca_es: Gràfics XGA
cs_cz: Grafika XGA
de_de: XGA-Grafik
fi_fi: XGA-grafiikkasuoritin
fr_fr: Graphique XGA
hr_hr: XGA grafika
hu_hu: XGA-gyorsítókártya
it_it: Grafica XGA
ja_jp: XGAグラフィック
pl_pl: Grafika XGA
pt_br: Gráficos XGA
ru_ru: Ускоритель XGA
sk_sk: Grafika XGA
sl_si: XGA grafika
tr_tr: XGA Grafikleri
uk_ua: Прискорювач XGA
vi_vn: Đồ họa XGA

source: Mouse:
ca_es: Ratolí:
cs_cz: Myš:
de_de: Maus:
es_es: Ratón:
fi_fi: Hiiri:
fr_fr: Souris:
hr_hr: Miš:
hu_hu: Egér:
ja_jp: マウス:
pl_pl: Mysz:
ru_ru: Мышь:
sk_sk: Myš:
sl_si: Miška:
tr_tr: Fare:
uk_ua: Миша:
vi_vn: Chuột:

source: Joystick:
es_es: Mando:
fi_fi: Peliohjain:
fr_fr: Manette de commande:
hr_hr: Palica za igru:
hu_hu: Játékvezérlő:
ja_jp: ジョイスティック:
ru_ru: Джойстик:
sl_si: Igralna palica:
tr_tr: Oyun kolu:
uk_ua: Джойстик:
vi_vn: Cần điều khiển:

source: Joystick 1...
es_es: Mando 1...
fi_fi: Peliohjain 1...
fr_fr: Manette 1...
hr_hr: Palica za igru 1...
hu_hu: Játékvez. 1...
ja_jp: ジョイスティック1...
ru_ru: Джойстик 1...
sl_si: Igralna palica 1...
tr_tr: Oyun kolu 1...
uk_ua: Джойстик 1...
vi_vn: Cần điều khiển 1...

source: Joystick 2...
es_es: Mando 2...
fi_fi: Peliohjain 2...
fr_fr: Manette 2...
hr_hr: Palica za igru 2...
hu_hu: Játékvez. 2...
ja_jp: ジョイスティック2...
ru_ru: Джойстик 2...
sl_si: Igralna palica 2...
tr_tr: Oyun kolu 2...
uk_ua: Джойстик 2...
vi_vn: Cần điều khiển 2...

source: Joystick 3...
es_es: Mando 3...
fi_fi: Peliohjain 3...
fr_fr: Manette 3...
hr_hr: Palica za igru 3...
hu_hu: Játékvez. 3...
ja_jp: ジョイスティック3...
ru_ru: Джойстик 3...
sl_si: Igralna palica 3...
tr_tr: Oyun kolu 3...
uk_ua: Джойстик 3...
vi_vn: Cần điều khiển 3...

source: Joystick 4...
es_es: Mando 4...
fi_fi: Peliohjain 4...
fr_fr: Manette 4...
hr_hr: Palica za igru 4...
hu_hu: Játékvez. 4...
ja_jp: ジョイスティック4...
ru_ru: Джойстик 4...
sl_si: Igralna palica 4...
tr_tr: Oyun kolu 4...
uk_ua: Джойстик 4...
vi_vn: Cần điều khiển 4...

source: Sound card #1:
ca_es: Targeta de so 1:
cs_cz: Zvuková karta 1:
de_de: Soundkarte 1:
es_es: Tarjeta de sonido 1:
fi_fi: Äänikortti 1:
fr_fr: Carte son 1:
hr_hr: Zvučna kartica 1:
hu_hu: Hangkártya 1:
it_it: Scheda audio 1:
ja_jp: サウンドカード1:
pl_pl: Karta dźwiękowa 1:
pt_br: Placa de som 1:
ru_ru: Звуковая карта 1:
sk_sk: Zvuková karta 1:
sl_si: Zvočna kartica 1:
tr_tr: Ses kartı 1:
uk_ua: Звукова карта 1:
vi_vn: Card âm thanh 1:

source: Sound card #2:
ca_es: Targeta de so 2:
cs_cz: Zvuková karta 2:
de_de: Soundkarte 2:
es_es: Tarjeta de sonido 2:
fi_fi: Äänikortti 2:
fr_fr: Carte son 2:
hr_hr: Zvučna kartica 2:
hu_hu: Hangkártya 2:
it_it: Scheda audio 2:
ja_jp: サウンドカード2:
pl_pl: Karta dźwiękowa 2:
pt_br: Placa de som 2:
ru_ru: Звуковая карта 2:
sk_sk: Zvuková karta 2:
sl_si: Zvočna kartica 2:
tr_tr: Ses kartı 2:
uk_ua: Звукова карта 2:
vi_vn: Card âm thanh 2:

source: Sound card #3:
ca_es: Targeta de so 3:
cs_cz: Zvuková karta 3:
de_de: Soundkarte 3:
es_es: Tarjeta de sonido 3:
fi_fi: Äänikortti 3:
fr_fr: Carte son 3:
hr_hr: Zvučna kartica 3:
hu_hu: Hangkártya 3:
it_it: Scheda audio 3:
ja_jp: サウンドカード3:
pl_pl: Karta dźwiękowa 3:
pt_br: Placa de som 3:
ru_ru: Звуковая карта 3:
sk_sk: Zvuková karta 3:
sl_si: Zvočna kartica 3:
tr_tr: Ses kartı 3:
uk_ua: Звукова карта 3:
vi_vn: Card âm thanh 3:

source: Sound card #4:
ca_es: Targeta de so 4:
cs_cz: Zvuková karta 4:
de_de: Soundkarte 4:
es_es: Tarjeta de sonido 4:
fi_fi: Äänikortti 4:
fr_fr: Carte son 4:
hr_hr: Zvučna kartica 4:
hu_hu: Hangkártya 4:
it_it: Scheda audio 4:
ja_jp: サウンドカード4:
pl_pl: Karta dźwiękowa 4:
pt_br: Placa de som 4:
ru_ru: Звуковая карта 4:
sk_sk: Zvuková karta 4:
sl_si: Zvočna kartica 4:
tr_tr: Ses kartı 4:
uk_ua: Звукова карта 4:
vi_vn: Card âm thanh 4:

source: MIDI Out Device:
ca_es: Dispositiu de sortida MIDI:
cs_cz: MIDI výstup:
de_de: MIDI Out-Gerät:
es_es: Dispositivo MIDI de salida:
fi_fi: MIDI-ulostulo:
fr_fr: Sortie MIDI:
hr_hr: Izlazni uređaj MIDI:
hu_hu: MIDI-kimenet:
it_it: Uscita MIDI:
ja_jp: MIDI出力デバイス:
pl_pl: Urządzenie wyjściowe MIDI:
pt_br: Disp. de saída MIDI:
ru_ru: MIDI Out устройство:
sk_sk: MIDI výstup:
sl_si: Izhodna naprava MIDI:
tr_tr: MIDI Çıkış Cihazı:
uk_ua: MIDI Out при-ій:
vi_vn: Thiết bị MIDI out:

source: MIDI In Device:
ca_es: Dispositiu d'entrada MIDI:
cs_cz: MIDI vstup:
de_de: MIDI In-Gerät:
es_es: Dispositivo MIDI de entrada:
fi_fi: MIDI-sisääntulo:
fr_fr: Entrée MIDI:
hr_hr: Ulazni uređaj MIDI:
hu_hu: MIDI-bemenet:
it_it: Entrata MIDI:
ja_jp: MIDI入力デバイス:
pl_pl: Urządzenie wejściowe MIDI:
pt_br: Disp. de entrada MIDI:
ru_ru: MIDI In устройство:
sk_sk: MIDI vstup:
sl_si: Vhodna naprava MIDI:
tr_tr: MIDI Giriş Cihazı:
uk_ua: MIDI In при-ій:
vi_vn: Thiết bị MIDI in:

source: Standalone MPU-401
ca_es: MPU-401 autònom
cs_cz: Samostatný MPU-401
de_de: Standalone-MPU-401-Gerät
es_es: MPU-401 independiente
fi_fi: Erillinen MPU-401
fr_fr: MPU-401 autonome
hr_hr: Samostalni MPU-401
hu_hu: Különálló MPU-401
it_it: MPU-401 autonomo
ja_jp: 独立型MPU-401
pl_pl: Samodzielne urządzenie MPU-401
pt_br: MPU-401 autônomo
ru_ru: Отдельный MPU-401
sk_sk: Samostatný MPU-401
sl_si: Samostojen MPU-401
tr_tr: Bağımsız MPU-401
uk_ua: Окремий MPU-401
vi_vn: MPU-401 độc lập

source: Use FLOAT32 sound
ca_es: Usar so FLOAT32
cs_cz: Použít zvuk FLOAT32
de_de: FLOAT32-Wiedergabe benutzen
es_es: Usar sonido FLOAT32
fi_fi: Käytä FLOAT32-ääntä
fr_fr: Utiliser le son FLOAT32
hr_hr: Koristi FLOAT32 za zvuk
hu_hu: FLOAT32 használata
it_it: Usa suono FLOAT32
ja_jp: FLOAT32サウンドを使用する
pl_pl: Użyj dźwięku FLOAT32
pt_br: Usar som FLOAT32
ru_ru: FLOAT32 звук
sk_sk: Použiť zvuk FLOAT32
sl_si: Uporabi FLOAT32 za zvok
tr_tr: FLOAT32 ses kullan
uk_ua: FLOAT32 звук
vi_vn: Dùng âm FLOAT32

source: FM synth driver
ca_es: Manejador de sintet. FM
de_de: FM-Synth-Treiber
es_es: Controlador de sintet. FM
fi_fi: FM-syntetisaattoriohjain
fr_fr: Pilote de synthétiseur FM
hr_hr: Drajver za FM sintisajzer
hu_hu: FM szintetizátor meghajtó
it_it: Driver sint. FM
ja_jp: FMシンセドライバー
pl_pl: Sterownik syntezy FM
pt_br: Controlador de sint. FM
ru_ru: Драйвер FM-синтезатора
sk_sk: Ovládač FM syntetizátora
sl_si: Gonilnik sintetizacije FM
tr_tr: FM sentez sürücüsü
uk_ua: Драйвер FM-синтезатора
vi_vn: Driver bộ tổng hợp âm FM

source: Nuked (more accurate)
ca_es: Nuked (més acurat)
cs_cz: Nuked (přesnější)
de_de: Nuked (genauer)
es_es: Nuked (más preciso)
fi_fi: Nuked (tarkempi)
fr_fr: Nuked (plus précis)
hr_hr: Nuked (precizniji)
hu_hu: Nuked (pontosabb)
it_it: Nuked (più accurato)
ja_jp: Nuked(高精度化)
pl_pl: Nuked (dokładniejszy)
pt_br: Nuked (mais preciso)
ru_ru: Nuked (более точный)
sk_sk: Nuked (presnejší)
sl_si: Nuked (točnejši)
tr_tr: Nuked (daha doğru)
uk_ua: Nuked (більш точний)
vi_vn: Nuked (chính xác hơn)

source: YMFM (faster)
ca_es: YMFM (més ràpid)
cs_cz: YMFM (rychlejší)
de_de: YMFM (schneller)
es_es: YMFM (más rápido)
fi_fi: YMFM (nopeampi)
fr_fr: YMFM (plus rapide)
hr_hr: YMFM (brži)
hu_hu: YMFM (gyorsabb)
it_it: YMFM (più veloce)
ja_jp: YMFM(より速く)
pl_pl: YMFM (szybszy)
pt_br: YMFM (mais rápido)
ru_ru: YMFM (быстрее)
sk_sk: YMFM (rýchlejší)
sl_si: YMFM (hitrejši)
tr_tr: YMFM (daha hızlı)
uk_ua: YMFM (швидший)
vi_vn: YMFM (nhanh hơn)

source: Network type:
ca_es: Tipus de xarxa:
cs_cz: Druh sítě:
de_de: Netzwerktyp:
es_es: Tipo de red:
fi_fi: Verkon tyyppi:
fr_fr: Type de réseau:
hr_hr: Tip mreže:
hu_hu: Hálózati típusa:
it_it: Tipo di rete:
ja_jp: ネットワーク タイプ:
pl_pl: Rodzaj sieci:
pt_br: Tipo de rede:
ru_ru: Тип сети:
sk_sk: Druh siete:
sl_si: Vrsta omrežja:
tr_tr: Ağ tipi:
uk_ua: Тип мережі:
vi_vn: Kiểu loại mạng:

source: PCap device:
ca_es: Dispositiu PCap:
cs_cz: PCap zařízení:
de_de: PCap-Gerät:
es_es: Dispositivo PCap:
fi_fi: PCap-laite:
fr_fr: Dispositif PCap:
hr_hr: Uređaj PCap:
hu_hu: PCap eszköz:
it_it: Dispositivo PCap:
ja_jp: PCapデバイス:
pl_pl: Urządzenie PCap:
pt_br: Dispositivo PCap:
ru_ru: Устройство PCap:
sk_sk: PCap zariadenia:
sl_si: Naprava PCap:
tr_tr: PCap cihazı:
uk_ua: Пристрій PCap:
vi_vn: Thiết bị PCap:

source: Network adapter:
ca_es: Adaptador de xarxa:
cs_cz: Síťový adaptér:
de_de: Netzwerkadapter:
es_es: Adaptador de red:
fi_fi: Verkkokortti:
fr_fr: Adaptateur de réseau:
hr_hr: Mrežna kartica:
hu_hu: Hálózati kártya:
it_it: Scheda di rete:
ja_jp: ネットワークアダプター:
pl_pl: Karta sieciowa:
pt_br: Adaptador de rede:
ru_ru: Сетевая карта:
sk_sk: Sieťový adaptér:
sl_si: Omrežna kartica:
tr_tr: Ağ cihazı:
uk_ua: Мережевий адаптер:
vi_vn: Bộ thích ứng (adapter) mạng:

source: Network Card #1
ru_ru: Сетевая карта 1:

source: Network Card #2
ru_ru: Сетевая карта 2:

source: Network Card #3
ru_ru: Сетевая карта 3:

source: Network Card #4
ru_ru: Сетевая карта 4:

source: Mode
ru_ru: Режим:

source: Interface
ru_ru: Интерфейс:

source: Adapter
ru_ru: Адаптер:

source: COM1 Device:
ca_es: Dispositiu COM1:
cs_cz: Zařízení na COM1:
de_de: COM1-Gerät:
es_es: Dispositivo COM1:
fi_fi: COM1-laite:
fr_fr: Dispositif COM1:
hr_hr: Uređaj COM1:
hu_hu: COM1 eszköz:
it_it: Dispositivo COM1:
ja_jp: COM1デバイス:
pl_pl: Urządzenie COM1:
pt_br: Dispositivo COM1:
ru_ru: Устройство COM1:
sk_sk: Zariadenie na COM1:
sl_si: Naprava COM1:
tr_tr: COM1 Cihazı:
uk_ua: Пристрій COM1:
vi_vn: Thiết bị COM1:

source: COM2 Device:
ca_es: Dispositiu COM2:
cs_cz: Zařízení na COM2:
de_de: COM2-Gerät:
es_es: Dispositivo COM2:
fi_fi: COM2-laite:
fr_fr: Dispositif COM2:
hr_hr: Uređaj COM2:
hu_hu: COM2 eszköz:
it_it: Dispositivo COM2:
ja_jp: COM2デバイス:
pl_pl: Urządzenie COM2:
pt_br: Dispositivo COM2:
ru_ru: Устройство COM2:
sk_sk: Zariadenie na COM2:
sl_si: Naprava COM2:
tr_tr: COM2 Cihazı:
uk_ua: Пристрій COM2:
vi_vn: Thiết bị COM2:

source: COM3 Device:
ca_es: Dispositiu COM3:
cs_cz: Zařízení na COM3:
de_de: COM3-Gerät:
es_es: Dispositivo COM3:
fi_fi: COM3-laite:
fr_fr: Dispositif COM3:
hr_hr: Uređaj COM3:
hu_hu: COM3 eszköz:
it_it: Dispositivo COM3:
ja_jp: COM3デバイス:
pl_pl: Urządzenie COM3:
pt_br: Dispositivo COM3:
ru_ru: Устройство COM3:
sk_sk: Zariadenie na COM3:
sl_si: Naprava COM3:
tr_tr: COM3 Cihazı:
uk_ua: Пристрій COM3:
vi_vn: Thiết bị COM3:

source: COM4 Device:
ca_es: Dispositiu COM4:
cs_cz: Zařízení na COM4:
de_de: COM4-Gerät:
es_es: Dispositivo COM4:
fi_fi: COM4-laite:
fr_fr: Dispositif COM4:
hr_hr: Uređaj COM4:
hu_hu: COM4 eszköz:
it_it: Dispositivo COM4:
ja_jp: COM4デバイス:
pl_pl: Urządzenie COM4:
pt_br: Dispositivo COM4:
ru_ru: Устройство COM4:
sk_sk: Zariadenie na COM4:
sl_si: Naprava COM4:
tr_tr: COM4 Cihazı:
uk_ua: Пристрій COM4:
vi_vn: Thiết bị COM4:

source: LPT1 Device:
ca_es: Dispositiu LPT1:
cs_cz: Zařízení na LPT1:
de_de: LPT1-Gerät:
es_es: Dispositivo LPT1:
fi_fi: LPT1-laite:
fr_fr: Dispositif LPT1:
hr_hr: Uređaj LPT1:
hu_hu: LPT1 eszköz:
it_it: Dispositivo LPT1:
ja_jp: LPT1デバイス:
pl_pl: Urządzenie LPT1:
pt_br: Dispositivo LPT1:
ru_ru: Устройство LPT1:
sk_sk: Zariadenie na LPT1:
sl_si: Naprava LPT1:
tr_tr: LPT1 Cihazı:
uk_ua: Пристрій LPT1:
vi_vn: Thiết bị LPT1:

source: LPT2 Device:
ca_es: Dispositiu LPT2:
cs_cz: Zařízení na LPT2:
de_de: LPT2-Gerät:
es_es: Dispositivo LPT2:
fi_fi: LPT2-laite:
fr_fr: Dispositif LPT2:
hr_hr: Uređaj LPT2:
hu_hu: LPT2 eszköz:
it_it: Dispositivo LPT2:
ja_jp: LPT2デバイス:
pl_pl: Urządzenie LPT2:
pt_br: Dispositivo LPT2:
ru_ru: Устройство LPT2:
sk_sk: Zariadenie na LPT2:
sl_si: Naprava LPT2:
tr_tr: LPT2 Cihazı:
uk_ua: Пристрій LPT2:
vi_vn: Thiết bị LPT2:

source: LPT3 Device:
ca_es: Dispositiu LPT3:
cs_cz: Zařízení na LPT3:
de_de: LPT3-Gerät:
es_es: Dispositivo LPT3:
fi_fi: LPT3-laite:
fr_fr: Dispositif LPT3:
hr_hr: Uređaj LPT3:
hu_hu: LPT3 eszköz:
it_it: Dispositivo LPT3:
ja_jp: LPT3デバイス:
pl_pl: Urządzenie LPT3:
pt_br: Dispositivo LPT3:
ru_ru: Устройство LPT3:
sk_sk: Zariadenie na LPT3:
sl_si: Naprava LPT3:
tr_tr: LPT3 Cihazı:
uk_ua: Пристрій LPT3:
vi_vn: Thiết bị LPT3:

source: LPT4 Device:
ca_es: Dispositiu LPT4:
cs_cz: Zařízení na LPT4:
de_de: LPT4-Gerät:
es_es: Dispositivo LPT4:
fi_fi: LPT4-laite:
fr_fr: Dispositif LPT4:
hr_hr: Uređaj LPT4:
hu_hu: LPT4 eszköz:
it_it: Dispositivo LPT4:
ja_jp: LPT4デバイス:
pl_pl: Urządzenie LPT4:
pt_br: Dispositivo LPT4:
ru_ru: Устройство LPT4:
sk_sk: Zariadenie na LPT4:
sl_si: Naprava LPT4:
tr_tr: LPT4 Cihazı:
uk_ua: Пристрій LPT4:
vi_vn: Thiết bị LPT4:

source: Serial port 1
ca_es: Port sèrie 1
cs_cz: Povolit port COM1
de_de: Serielle Schnittstelle 1
es_es: Puerto serie 1
fi_fi: Sarjaportti 1
fr_fr: Port série 1
hr_hr: Serijska vrata 1
hu_hu: Soros port 1
it_it: Porta seriale 1
ja_jp: シリアルポート1
pl_pl: Port szeregowy 1
pt_br: Porta serial 1
ru_ru: Последовательный порт COM1
sk_sk: Povoliť port COM1
sl_si: Serijska vrata 1
tr_tr: Seri port 1
uk_ua: Послідов. порт COM1
vi_vn: Cổng serial 1

source: Serial port 2
ca_es: Port sèrie 2
cs_cz: Povolit port COM2
de_de: Serielle Schnittstelle 2
es_es: Puerto serie 2
fi_fi: Sarjaportti 2
fr_fr: Port série 2
hr_hr: Serijska vrata 2
hu_hu: Soros port 2
it_it: Porta seriale 2
ja_jp: シリアルポート2
pl_pl: Port szeregowy 2
pt_br: Porta serial 2
ru_ru: Последовательный порт COM2
sk_sk: Povoliť port COM2
sl_si: Serijska vrata 2
tr_tr: Seri port 2
uk_ua: Послідов. порт COM2
vi_vn: Cổng serial 2

source: Serial port 3
ca_es: Port sèrie 3
cs_cz: Povolit port COM3
de_de: Serielle Schnittstelle 3
es_es: Puerto serie 3
fi_fi: Sarjaportti 3
fr_fr: Port série 3
hr_hr: Serijska vrata 3
hu_hu: Soros port 3
it_it: Porta seriale 3
ja_jp: シリアルポート3
pl_pl: Port szeregowy 3
pt_br: Porta serial 3
ru_ru: Последовательный порт COM3
sk_sk: Povoliť port COM3
sl_si: Serijska vrata 3
tr_tr: Seri port 3
uk_ua: Послідов. порт COM3
vi_vn: Cổng serial 3

source: Serial port 4
ca_es: Port sèrie 4
cs_cz: Povolit port COM4
de_de: Serielle Schnittstelle 4
es_es: Puerto serie 4
fi_fi: Sarjaportti 4
fr_fr: Port série 4
hr_hr: Serijska vrata 4
hu_hu: Soros port 4
it_it: Porta seriale 4
ja_jp: シリアルポート4
pl_pl: Port Szeregowy 4
pt_br: Porta serial 4
ru_ru: Последовательный порт COM4
sk_sk: Povoliť port COM4
sl_si: Serijska vrata 4
tr_tr: Seri port 4
uk_ua: Послідов. порт COM4
vi_vn: Cổng serial 4

source: Serial port passthrough 1
ru_ru: Сквозной последовательный порт COM1

source: Serial port passthrough 2
ru_ru: Сквозной последовательный порт COM2

source: Serial port passthrough 3
ru_ru: Сквозной последовательный порт COM3

source: Serial port passthrough 4
ru_ru: Сквозной последовательный порт COM4

source: Parallel port 1
ca_es: Port paral·lel 1
cs_cz: Povolit port LPT1
es_es: Puerto paralelo 1
fi_fi: Rinnakkaisportti 1
fr_fr: Port parallèle 1
hr_hr: Paralelna vrata 1
hu_hu: Párhuzamos port 1
it_it: Porta parallela 1
ja_jp: パラレルポート1
pl_pl: Port równoległy 1
pt_br: Porta paralela 1
ru_ru: Параллельный порт LPT1
sk_sk: Povoliť port LPT1
sl_si: Paralelna vrata 1
tr_tr: Paralel port 1
uk_ua: Паралельний порт LPT1
vi_vn: Cổng parallel 1

source: Parallel port 2
ca_es: Port paral·lel 2
cs_cz: Povolit port LPT2
es_es: Puerto paralelo 2
fi_fi: Rinnakkaisportti 2
fr_fr: Port parallèle 2
hr_hr: Paralelna vrata 2
hu_hu: Párhuzamos port 2
it_it: Porta parallela 2
ja_jp: パラレルポート2
pl_pl: Port równoległy 2
pt_br: Porta paralela 2
ru_ru: Параллельный порт LPT2
sk_sk: Povoliť port LPT2
sl_si: Paralelna vrata 2
tr_tr: Paralel port 2
uk_ua: Паралельний порт LPT2
vi_vn: Cổng parallel 2

source: Parallel port 3
ca_es: Port paral·lel 3
cs_cz: Povolit port LPT3
es_es: Puerto paralelo 3
fi_fi: Rinnakkaisportti 3
fr_fr: Port parallèle 3
hr_hr: Paralelna vrata 3
hu_hu: Párhuzamos port 3
it_it: Porta parallela 3
ja_jp: パラレルポート3
pl_pl: Port równoległy 3
pt_br: Porta paralela 3
ru_ru: Параллельный порт LPT3
sk_sk: Povoliť port LPT3
sl_si: Paralelna vrata 3
tr_tr: Paralel port 3
uk_ua: Паралельний порт LPT3
vi_vn: Cổng parallel 3

source: Parallel port 4
ca_es: Port paral·lel 4
cs_cz: Povolit port LPT4
es_es: Puerto paralelo 4
fi_fi: Rinnakkaisportti 4
fr_fr: Port parallèle 4
hr_hr: Paralelna vrata 4
hu_hu: Párhuzamos port 4
it_it: Porta parallela 4
ja_jp: パラレルポート4
pl_pl: Port równoległy 4
pt_br: Porta paralela 4
ru_ru: Параллельный порт LPT4
sk_sk: Povoliť port LPT4
sl_si: Paralelna vrata 4
tr_tr: Paralel port 4
uk_ua: Паралельний порт LPT4
vi_vn: Cổng parallel 4

source: HD Controller:
ca_es: Controlador de HD:
cs_cz: Řadič disku:
de_de: HDD-Controller:
es_es: Controladora HD:
fi_fi: Kiintolevyohjain:
fr_fr: Contrôleur HD:
hr_hr: Kontroler tvrdog diska:
hu_hu: Merevl.-vezérlő:
it_it: Controller HD:
ja_jp: HDDコントローラー:
pl_pl: Kontroler dysku twardego:
pt_br: Controlador HD:
ru_ru: Контроллер HD:
sk_sk: Radič disku:
sl_si: Krmilnik trdega diska:
tr_tr: HD Kontrolcüsü:
uk_ua: Контролер HD:
vi_vn: Bộ điều khiển ổ cứng:

source: FD Controller:
ca_es: Controlador de FD:
cs_cz: Disketový řadič:
es_es: Controladora FD:
fi_fi: Levykeohjain:
fr_fr: Contrôleur FD:
hr_hr: Kontroler diskete:
hu_hu: Floppy-vezérlő:
it_it: Controller FD:
ja_jp: FDDコントローラー:
pl_pl: Kontroler dyskietek:
pt_br: Controlador FD:
ru_ru: Контроллер FD:
sk_sk: Disketový radič:
sl_si: Krmilnik disketnika:
tr_tr: FD Kontrolcüsü:
uk_ua: Контролер FD:
vi_vn: Bộ điều khiển ổ mềm:

source: Tertiary IDE Controller
ca_es: Controlador IDE terciari
cs_cz: Třetí řadič IDE
de_de: Tertiärer IDE-Controller
es_es: Tercera controladora IDE
fi_fi: Kolmas IDE-ohjain
fr_fr: Contrôleur IDE tertiaire
hr_hr: Tercijarni IDE kontroler
hu_hu: Harmadlagos IDE-vezérlő
it_it: Controller IDE terziario
ja_jp: 第三IDEコントローラー
pl_pl: Trzeciorzędowy kontroler IDE
pt_br: Controlador IDE terciário
ru_ru: Третичный IDE контроллер
sk_sk: Tretí radič IDE
sl_si: Terciarni krmilnik IDE
tr_tr: Üçlü IDE Kontrolcüsü
uk_ua: Третинний IDE контролер
vi_vn: Bộ điều khiển IDE thứ ba

source: Quaternary IDE Controller
ca_es: Controlador IDE quaternari
cs_cz: Čtvrtý řadič IDE
de_de: Quartärer IDE-Controller
es_es: Cuarta controladora IDE
fi_fi: Neljäs IDE-ohjain
fr_fr: Contrôleur IDE quaternair
hr_hr: Kvaternarni IDE kontroler
hu_hu: Negyedleges IDE-vezérlő
it_it: Controller IDE quaternario
ja_jp: 第四IDEコントローラー
pl_pl: Czwartorzędowy kontroler IDE
pt_br: Controlador IDE quaternário
ru_ru: Четвертичный IDE контроллер
sk_sk: Štvrtý radič IDE
sl_si: Kvartarni krmilnik IDE
tr_tr: Dörtlü IDE Kontrolcüsü
uk_ua: Четвертинний IDE контролер
vi_vn: Bộ điều khiển IDE thứ tư

source: Controller 1:
ca_es: Controlador 1:
cs_cz: Řadič 1:
es_es: Controladora 1:
fi_fi: Ohjain 1:
fr_fr: Contrôleur 1:
hr_hr: Kontroler 1:
hu_hu: Gazdaadapt. 1:
ja_jp: コントローラー1:
pl_pl: Kontroler 1:
pt_br: Controlador 1:
ru_ru: Контроллер 1:
sk_sk: Radič 1:
sl_si: Krmilnik 1:
tr_tr: Kontrolcü 1:
uk_ua: Контролер 1:
vi_vn: Bộ điều khiển 1:

source: Controller 2:
ca_es: Controlador 2:
cs_cz: Řadič 2:
es_es: Controladora 2:
fi_fi: Ohjain 2:
fr_fr: Contrôleur 2:
hr_hr: Kontroler 2:
hu_hu: Gazdaadapt. 2:
ja_jp: コントローラー2:
pl_pl: Kontroler 2:
pt_br: Controlador 2:
ru_ru: Контроллер 2:
sk_sk: Radič 2:
sl_si: Krmilnik 2:
tr_tr: Kontrolcü 2:
uk_ua: Контролер 2:
vi_vn: Bộ điều khiển 2:

source: Controller 3:
ca_es: Controlador 3:
cs_cz: Řadič 3:
es_es: Controladora 3:
fi_fi: Ohjain 3:
fr_fr: Contrôleur 3:
hr_hr: Kontroler 3:
hu_hu: Gazdaadapt. 3:
ja_jp: コントローラー3:
pl_pl: Kontroler 3:
pt_br: Controlador 3:
ru_ru: Контроллер 3:
sk_sk: Radič 3:
sl_si: Krmilnik 3:
tr_tr: Kontrolcü 3:
uk_ua: Контролер 3:
vi_vn: Bộ điều khiển 3:

source: Controller 4:
ca_es: Controlador 4:
cs_cz: Řadič 4:
es_es: Controladora 4:
fi_fi: Ohjain 4:
fr_fr: Contrôleur 4:
hr_hr: Kontroler 4:
hu_hu: Gazdaadapt. 4:
ja_jp: コントローラー4:
pl_pl: Kontroler 4:
pt_br: Controlador 4:
ru_ru: Контроллер 4:
sk_sk: Radič 4:
sl_si: Krmilnik 4:
tr_tr: Kontrolcü 4:
uk_ua: Контролер 4:
vi_vn: Bộ điều khiển 4:

source: Cassette
ca_es: Casset
cs_cz: Kazeta
de_de: Kassette
fi_fi: Kasettiasema
hr_hr: Audio kaseta
hu_hu: Magnókazetta
it_it: Cassetta
ja_jp: カセット
pl_pl: Kaseta
pt_br: Cassete
ru_ru: Кассета
sk_sk: Kazeta
sl_si: Kasetnik
tr_tr: Kaset
uk_ua: Касета

source: Hard disks:
ca_es: Discs durs:
cs_cz: Pevné disky:
de_de: Festplatten:
es_es: Discos duros:
fi_fi: Kiintolevyt:
fr_fr: Disques durs:
hr_hr: Tvrdi diskovi:
hu_hu: Merevlemezek:
it_it: Hard disk:
ja_jp: ハード ディスク:
pl_pl: Dyski twarde:
pt_br: Discos rígidos:
ru_ru: Жёсткие диски:
sk_sk: Pevné disky:
sl_si: Trdi diski:
tr_tr: Hard diskler:
uk_ua: Жорсткі диски:
vi_vn: Đĩa cứng:

source: &New...
ca_es: &Nou...
cs_cz: &Nový...
de_de: &Neu...
es_es: &Nuevo...
fi_fi: &Uusi...
fr_fr: &Nouveau...
hr_hr: &Novi...
hu_hu: &Új...
it_it: &Nuovo...
ja_jp: 新規(&N)...
pl_pl: &Nowy...
pt_br: &Novo...
ru_ru: &Создать...
sk_sk: &Nový...
sl_si: Nov...
tr_tr: &Yeni...
uk_ua: &Створити...
vi_vn: Tạ&o mới...

source: &Existing...
ca_es: &Existent...
cs_cz: &Existující...
de_de: &Vorhanden...
es_es: &Existente...
fi_fi: &Olemassaoleva...
fr_fr: &Existant...
hr_hr: &Postojeći...
hu_hu: &Megnyitás...
it_it: &Esistente...
ja_jp: 既定(&E)...
pl_pl: &Istniejący...
pt_br: &Existente...
ru_ru: &Выбрать...
sk_sk: &Existujúcý...
sl_si: Obstoječ...
tr_tr: &Var olan...
uk_ua: &Вибрати...
vi_vn: &Có sẵn...

source: Browse...
ru_ru: Выбрать...

source: &Remove
ca_es: E&liminar
cs_cz: &Odebrat
de_de: &Entfernen
es_es: E&liminar
fi_fi: &Poista
fr_fr: &Supprimer
hr_hr: &Ukloni
hu_hu: &Eltávolítás
it_it: &Rimouvi
ja_jp: 削除(&R)
pl_pl: &Usuń
pt_br: &Remover
ru_ru: &Удалить
sk_sk: &Odobrať
sl_si: Odstrani
tr_tr: &Kaldır
uk_ua: &Прибрати
vi_vn: Loạ&i bỏ
