Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: 320 kB
fi_fi: 320 kt
fr_fr: 320 Ko
ru_ru: 320 кБ
uk_ua: 320 кБ

source: 360 kB
fi_fi: 360 kt
fr_fr: 360 Ko
ru_ru: 360 кБ
uk_ua: 360 кБ

source: 640 kB
fi_fi: 640 kt
fr_fr: 640 Ko
ru_ru: 640 кБ
uk_ua: 640 кБ

source: 720 kB
fi_fi: 720 kt
fr_fr: 720 Ko
ru_ru: 720 кБ
uk_ua: 720 кБ

source: 1.2 MB
fi_fi: 1.2 Mt
fr_fr: 1.2 Mo
ru_ru: 1.2 МБ
uk_ua: 1.2 МБ

source: 1.25 MB
fi_fi: 1.25 Mt
fr_fr: 1.25 Mo
ru_ru: 1.25 МБ
uk_ua: 1.25 МБ

source: 1.44 MB
fi_fi: 1.44 Mt
fr_fr: 1.44 Mo
ru_ru: 1.44 МБ
uk_ua: 1.44 МБ

source: DMF (cluster 1024)
ca_es: DMF (clúster 1024)
de_de: DMF (1024 Cluster)
fi_fi: DMF (lohko 1024)
hr_hr: DMF (1024 clusteri)
hu_hu: DMF (1024 klaszter)
ja_jp: DMF (クラスター1024)
pl_pl: DMF (klaster 1024)
ru_ru: DMF (кластер 1024)
sl_si: DMF (grozd 1024)
uk_ua: DMF (кластер 1024)

source: DMF (cluster 2048)
ca_es: DMF (clúster 2048)
de_de: DMF (2048 Cluster)
fi_fi: DMF (lohko 2048)
hr_hr: DMF (2048 clusteri)
hu_hu: DMF (2048 klaszter)
ja_jp: DMF (クラスター2048)
pl_pl: DMF (klaster 2048)
ru_ru: DMF (кластер 2048)
sl_si: DMF (grozd 2048)
uk_ua: DMF (кластер 2048)

source: 2.88 MB
fi_fi: 2.88 Mt
fr_fr: 2.88 Mo
ru_ru: 2.88 МБ
uk_ua: 2.88 МБ

source: 3.5" 128 MB (ISO 10090)
de_de: 3,5-Zoll 128 MB (ISO 10090)
fi_fi: 3.5" 128 Mt (ISO 10090)
fr_fr: 3.5" 128 Mo (ISO 10090)
ru_ru: 3.5" 128 МБ (ISO 10090)
uk_ua: 3.5" 128 МБ (ISO 10090)

source: 3.5" 230 MB (ISO 13963)
de_de: 3,5-Zoll 230 MB (ISO 13963)
fi_fi: 3.5" 230 Mt (ISO 13963)
fr_fr: 3.5" 230 Mo (ISO 13963)
ru_ru: 3.5" 230 МБ (ISO 13963)
uk_ua: 3.5" 230 МБ (ISO 13963)

source: 3.5" 540 MB (ISO 15498)
de_de: 3,5-Zoll 540 MB (ISO 15498)
fi_fi: 3.5" 540 Mt (ISO 15498)
fr_fr: 3.5" 540 Mo (ISO 15498)
ru_ru: 3.5" 540 МБ (ISO 15498)
uk_ua: 3.5" 540 МБ (ISO 15498)

source: 3.5" 640 MB (ISO 15498)
de_de: 3,5-Zoll 640 MB (ISO 15498)
fi_fi: 3.5" 640 Mt (ISO 15498)
fr_fr: 3.5" 640 Mo (ISO 15498)
ru_ru: 3.5" 640 МБ (ISO 15498)
uk_ua: 3.5" 640 МБ (ISO 15498)

source: 3.5" 1.3 GB (GigaMO)
de_de: 3,5-Zoll 1,3 GB (GigaMO)
fi_fi: 3.5" 1.3 Gt (GigaMO)
fr_fr: 3.5" 1.3 Go (GigaMO)
ru_ru: 3.5" 1.3 ГБ (GigaMO)
uk_ua: 3.5" 1.3 ГБ (GigaMO)

source: 3.5" 2.3 GB (GigaMO 2)
de_de: 3,5-Zoll 2,3 GB (GigaMO 2)
fi_fi: 3.5" 2.3 Gt (GigaMO 2)
fr_fr: 3.5" 2.3 Go (GigaMO 2)
ru_ru: 3.5" 2.3 ГБ (GigaMO 2)
uk_ua: 3.5" 2.3 ГБ (GigaMO 2)

source: 5.25" 600 MB
de_de: 5,25-Zoll 600 MB
fi_fi: 5.25" 600 Mt
fr_fr: 5.25" 600 Mo
ru_ru: 5.25" 600 МБ
uk_ua: 5.25" 600 МБ

source: 5.25" 650 MB
de_de: 5,25-Zoll 650 MB
fi_fi: 5.25" 650 Mt
fr_fr: 5.25" 650 Mo
ru_ru: 5.25" 650 МБ
uk_ua: 5.25" 650 МБ

source: 5.25" 1 GB
de_de: 5,25-Zoll 1 GB
fi_fi: 5.25" 1 Gt
fr_fr: 5.25" 1 Go
ru_ru: 5.25" 1 ГБ
uk_ua: 5.25" 1 ГБ

source: 5.25" 1.3 GB
de_de: 5,25-Zoll 1,3 GB
fi_fi: 5.25" 1.3 Gt
fr_fr: 5.25" 1.3 Go
ru_ru: 5.25" 1.3 ГБ
uk_ua: 5.25" 1.3 ГБ

source: Perfect RPM
ca_es: RPM perfectes
cs_cz: Dokonalé otáčky za minutu
de_de: Perfekte Drehzahl
es_es: RPM perfectas
fi_fi: Täydellinen RPM
fr_fr: RPM précis
hr_hr: Savršeni broj okretaja u minuti
hu_hu: Tökéletes RPM
it_it: RPM perfette
ja_jp: 既定RPM
pl_pl: Idealne obroty
pt_br: RPM perfeita
ru_ru: Точный RPM
sk_sk: Dokonalé otáčky za minútu
sl_si: Popolni obrati na minuto
tr_tr: Mükemmel RPM
uk_ua: Точний RPM
vi_vn: Số RPM(vòng quay đĩa/phút) hoàn thiện

source: 1% below perfect RPM
ca_es: 1% per sota de RPM perfectes
cs_cz: 1% pod dokonalými ot./m
de_de: 1% unterhalb der perfekten Drehzahl
es_es: 1% por debajo de RPM perfectas
fi_fi: 1% alle täydellisen RPM:n
fr_fr: Précision RPM de moins 1%
hr_hr: 1% ispod savršenog broja okretaja
hu_hu: 1%-kal a tökéletes RPM alatt
it_it: RPM 1% sotto perfezione
ja_jp: 1%低いRPM
pl_pl: 1% poniżej idealnych obrotów
pt_br: 1% abaixo das RPM perfeita
ru_ru: На 1% медленнее точного RPM
sk_sk: 1% pod dokonalými ot./m
sl_si: 1% pod popolnimi obrati
tr_tr: mükemmel RPM değerinin 1% altı
uk_ua: На 1% повільніше точного RPM
vi_vn: 1% thấp hơn số RPM hoàn thiện

source: 1.5% below perfect RPM
ca_es: 1.5% per sota de RPM perfectes
cs_cz: 1.5% pod dokonalými ot./m
de_de: 1,5% unterhalb der perfekten Drehzahl
es_es: 1.5% por debajo de RPM perfectas
fi_fi: 1.5% alle täydellisen RPM:n
fr_fr: Précision RPM de moins 1.5%
hr_hr: 1,5% ispod savršenog broja okretaja
hu_hu: 1.5%-kal a tökéletes RPM alatt
it_it: RPM 1.5% sotto perfezione
ja_jp: 1.5%低いRPM
pl_pl: 1.5% poniżej idealnych obrotów
pt_br: 1.5% abaixo das RPM perfeita
ru_ru: На 1.5% медленнее точного RPM
sk_sk: 1.5% pod dokonalými ot./m
sl_si: 1.5% pod popolnimi obrati
tr_tr: mükemmel RPM değerinin 1.5% altı
uk_ua: На 1.5% повільніше точного RPM
vi_vn: 1.5% thấp hơn số RPM hoàn thiện

source: 2% below perfect RPM
ca_es: 2% per sota de RPM perfectes
cs_cz: 2% pod dokonalými ot./m
de_de: 2% unterhalb der perfekten Drehzahl
es_es: 2% por debajo de RPM perfectas
fi_fi: 2% alle täydellisen RPM:n
fr_fr: Précision RPM de moins 2%
hr_hr: 2% ispod savršenog broja okretaja
hu_hu: 2%-kal a tökéletes RPM alatt
it_it: RPM 2% sotto perfezione
ja_jp: 2%低いRPM
pl_pl: 2% poniżej idealnych obrotów
pt_br: 2% abaixo das RPM perfeita
ru_ru: На 2% медленнее точного RPM
sk_sk: 2% pod dokonalými ot./m
sl_si: 2% pod popolnimi obrati
tr_tr: mükemmel RPM değerinin 2% altı
uk_ua: На 2% повільніше точного RPM
vi_vn: 2% thấp hơn số RPM hoàn thiện

source: (System Default)
ca_es: (Per defecte del sistema)
cs_cz: (Výchozí nastavení systému)
de_de: (Systemstandard)
es_es: (Por defecto del sistema)
fi_fi: (Järjestelmän oletus)
fr_fr: (Défaut du système)
hr_hr: (Zadana postavka operativnog sustava)
hu_hu: (A rendszer nyelve)
it_it: (Predefinito del sistema)
ja_jp: (システム既定値)
pl_pl: (Domyślne ustawienie systemowe)
pt_br: (Padrão do sistema)
ru_ru: (Системный)
sk_sk: (Predvolené nastavenie systému)
sl_si: (Sistemsko privzeto)
tr_tr: (Sistem Varsayılanı)
uk_ua: (Системний)
vi_vn: (Mặc định hệ thống)

source: Failed to initialize network driver
ca_es: No has estat possible inicialitzar el controlador de xarxa
cs_cz: Nepodařilo se inicializovat síťový ovladač
de_de: Netzwerktreiber konnte nicht initialisiert werden
es_es: No fué posible inicializar el controlador de red
fi_fi: Verkkoajurin alustaminen epäonnistui
fr_fr: Échec de l'initialisation du pilote réseau
hr_hr: Neuspješno pokretanje mrežnog upravljačkog programa
hu_hu: Nem sikerült inicializálni a hálózati illesztőprogramot
it_it: Impossibile inizializzare il driver di rete
ja_jp: ネットワークドライバの初期化に失敗しました
pl_pl: Nie udało się zainicjować sterownika sieciowego
pt_br: Falha ao inicializar o driver de rede
ru_ru: Не удалось инициализировать сетевой драйвер
sk_sk: Nepodarilo sa inicializovať sieťový ovládač
sl_si: Ni uspelo inicializirati omrežnega gonilnika
tr_tr: Ağ sürücüsü başlatılamadı
uk_ua: Не вдалося ініціалізувати мережевий драйвер
vi_vn: Không thể khởi tạo trình điều khiển (driver) mạng

source: The network configuration will be switched to the null driver
ca_es: La configuració de la xarxa es canviarà al controlador nul
cs_cz: Konfigurace sítě bude přepnuta na nulový ovladač
de_de: Die Netzwerkkonfiguration wird auf den Nulltreiber umgestellt
es_es: La configuración de red se cambiará al controlador nulo
fi_fi: Verkkokokoonpano vaihtuu nolla-ajuriin
fr_fr: La configuration du réseau passera au pilote nul
hr_hr: Konfiguracija mreže bit će prebačena na nulti upravljački program
hu_hu: A hálózati konfiguráció átvált a null illesztőprogramra
it_it: La configurazione di rete verrà commutata sul driver nullo
ja_jp: ネットワーク設定がヌルドライバに切り替えられます
pl_pl: Konfiguracja sieci zostanie przełączona na sterownik null
pt_br: A configuração de rede será alterada para o driver nulo
ru_ru: Сетевая конфигурация будет переключена на нулевой драйвер
sk_sk: Konfigurácia siete bude prepnutá na nulový ovládač
sl_si: Omrežne nastavitve bodo preklopljene na ničelni gonilnik
tr_tr: Ağ yapılandırması null sürücüye geçirilecektir
uk_ua: Конфігурацію мережі буде змінено на нульовий драйвер
vi_vn: Cấu hình mạng sẽ chuyển sang null driver (không có mạng)

source: Mouse sensitivity:
ca_es: Sensibilitat del ratolí:
cs_cz: Citlivost myší:
de_de: Empfindlichkeit der Maus:
es_es: Sensibilidad del ratón:
fi_fi: Hiiren herkkyys:
fr_fr: Sensibilité de la souris:
hr_hr: Osjetljivost miša:
hu_hu: Egér érzékenység:
it_it: Sensitività del mouse:
ja_jp: マウスの感度:
pl_pl: Wrażliwość myszy:
pt_br: Sensibilidade do rato:
ru_ru: Чувствительность мыши:
sk_sk: Citlivosť myší:
sl_si: Občutljivost miške:
tr_tr: Fare hassasiyeti:
uk_ua: Чутливість миші:
vi_vn: Độ nhạy chuột:

source: Select media images from program working directory
ca_es: Seleccioneu imatges multimèdia del directori de treball del programa
cs_cz: Výběr mediálních obrazů z pracovního adresáře programu
de_de: Medienbilder aus dem Arbeitsverzeichnis des Programms auswählen
es_es: Seleccionar imágenes de media del directorio de trabajo del programa
fi_fi: Valitse mediakuvat ohjelman työhakemistosta
fr_fr: Sélectionner des images dans le répertoire de travail du programme
hr_hr: Medijske slike su odabrane iz radnog direktorija programa
hu_hu: Médiaképek kiválasztása a program munkakönyvtárából
it_it: Seleziona le immagini media dalla directory di lavoro del programma
ja_jp: プログラムの作業ディレクトリからメディアイメージを選択してください
pl_pl: Wybór obrazów multimedialnych z katalogu roboczego programu
pt_br: Selecione imagens de mídia do diretório de trabalho do programa
ru_ru: Выбор медиа-образов из рабочего каталога программы
sk_sk: Výber mediálnych obrazov z pracovného adresára programu
sl_si: Izberi slike medijev iz delovnega imenika programa
tr_tr: Program çalışma dizininden medya görüntülerini seçme
uk_ua: Виберіть медіа-зображення з робочої директорії програми
vi_vn: Chọn ảnh đĩa phương tiện từ thư mục làm việc của chương trình

source: PIT mode:
ca_es: Mode PIT:
cs_cz: Režim PIT:
de_de: PIT-Modus:
es_es: Modalidad PIT:
fi_fi: PIT-tila:
fr_fr: Mode PIT:
hr_hr: PIT način:
hu_hu: PIT üzemmód:
it_it: Modalità PIT:
ja_jp: PITモード:
pl_pl: Tryb PIT:
pt_br: Modo PIT:
ru_ru: Режим PIT:
sk_sk: Režim PIT:
sl_si: Način PIT:
tr_tr: PIT modu:
uk_ua: Режим PIT:
vi_vn: Chế độ PIT:

source: Auto
ca_es: Automàtic
cs_cz: Automatický
es_es: Automática
fi_fi: Automaattinen
hu_hu: Automatikus
it_it: Automatica
ja_jp: 自動
pl_pl: Automatyczny
pt_br: Automático
ru_ru: Авто
sk_sk: Automatický
sl_si: Samodejni
tr_tr: Otomatik
uk_ua: Авто
vi_vn: Tự động

source: Slow
ca_es: Lent
cs_cz: Pomalý
de_de: Langsam
es_es: Lenta
fi_fi: Hidas
fr_fr: Lent
hr_hr: Spori
hu_hu: Lassú
it_it: Lenta
ja_jp: 遅い
pl_pl: Powolny
pt_br: Lento
ru_ru: Медленный
sk_sk: Pomalý
sl_si: Počasni
tr_tr: Yavaş
uk_ua: Повільний
vi_vn: Chậm

source: Fast
ca_es: Ràpid
cs_cz: Rychlý
de_de: Schnell
es_es: Rápida
fi_fi: Nopea
fr_fr: Rapide
hr_hr: Brzi
hu_hu: Gyors
it_it: Veloce
ja_jp: 速い
pl_pl: Szybki
pt_br: Rápido
ru_ru: Быстрый
sk_sk: Rýchly
sl_si: Hitri
tr_tr: Hızlı
uk_ua: Швидкий
vi_vn: Nhanh

source: &Auto-pause on focus loss
ca_es: &Pausa automàtica en la pèrdua del focus
cs_cz: &Automatická pauza při ztrátě zaměření okna
de_de: &Auto-Pause bei Fokusverlust
es_es: &Pausa automática al perder el foco
fi_fi: &Automaattinen tauko tarkennuksen hävitessä
fr_fr: &Pause automatique à perte de mise au point
hr_hr: &Automatska pauza pri gubitku fokusa
hu_hu: &Automatikus szünet fókuszvesztéskor
it_it: &Pausa automatica alla perdita della messa a fuoco
ja_jp: フォーカスが奪われると自動停止(&A)
pl_pl: &Automatyczna pauza po utracie fokusu
pt_br: Pausa &automática ao perder o foco
ru_ru: &Автопауза при потере фокуса
sk_sk: &Automatická pauza pri strate fokusu okna
sl_si: &Samodejni premor ob izgubi fokusa
tr_tr: &Odak kaybında otomatik duraklatma
uk_ua: &Автопауза при втраті фокусу
vi_vn: &Tự tạm dừng giả lập khi không tập trung ở cửa sổ

source: WinBox is no longer supported
cs_cz: WinBox již není podporován
de_de: WinBox wird nicht mehr unterstützt
es_es: WinBox ya no recibe soporte
fi_fi: WinBoxia ei enää tueta
fr_fr: WinBox n'est plus pris en charge
hu_hu: A WinBox már nem támogatott
it_it: WinBox non è più supportato
ja_jp: WinBoxはサポート終了
pl_pl: WinBox nie jest już wspierany
pt_br: O WinBox não é mais suportado
ru_ru: WinBox больше не поддерживается
sk_sk: WinBox už nie je podporovaný
sl_si: WinBox ni več podprt
tr_tr: WinBox artık desteklenmiyor
uk_ua: WinBox більше не підтримується
vi_vn: WinBox không còn được hỗ trợ

source: Development of the WinBox manager stopped in 2022 due to a lack of maintainers. As we direct our efforts towards making 86Box even better, we have made the decision to no longer support WinBox as a manager. No further updates will be provided through WinBox, and you may encounter incorrect behavior should you continue using it with newer versions of 86Box. Any bug reports related to WinBox behavior will be closed as invalid. Go to 86box.net for a list of other managers you can use.
cs_cz: Vývoj správce WinBox byl zastaven v roce 2022 z důvodu nedostatku správců. Vzhledem k tomu, že naše úsilí směřujeme k tomu, abychom 86Box ještě vylepšili, rozhodli jsme se WinBox jako správce již nepodporovat. Prostřednictvím WinBoxu nebudou poskytovány žádné další aktualizace a pokud jej budete nadále používat s novějšími verzemi 86Boxu, můžete se setkat s nesprávným chováním. Veškerá hlášení o chybách souvisejících s chováním WinBoxu budou uzavřena jako neplatná. Seznam dalších správců, které můžete používat, najdete na webu 86box.net.
de_de: Die Entwicklung des WinBox-Managers wurde im Jahr 2022 eingestellt, da es an Betreuern mangelte. Da wir unsere Bemühungen darauf richten, 86Box noch besser zu machen, haben wir uns entschlossen, WinBox nicht mehr als Manager zu unterstützen. Es werden keine weiteren Updates für WinBox zur Verfügung gestellt, und es kann zu fehlerhaftem Verhalten kommen, wenn Sie WinBox weiterhin mit neueren Versionen von 86Box verwenden. Alle Fehlerberichte, die sich auf das Verhalten von WinBox beziehen, werden als ungültig geschlossen. Auf 86box.net finden Sie eine Liste anderer Manager, die Sie verwenden können.
es_es: El desarrollo del gestor WinBox se detuvo en 2022 debido a la falta de mantenedores. Como dirigimos nuestros esfuerzos a hacer 86Box aún mejor, hemos tomado la decisión de dejar de dar soporte a WinBox como gestor. No se proporcionarán más actualizaciones a través de WinBox, y puede encontrar un comportamiento incorrecto si continúa usándolo con versiones más nuevas de 86Box. Cualquier informe de error relacionado con el comportamiento de WinBox será cerrado como inválido. Vaya a 86box.net para una lista de otros gestores que puede utilizar.
fi_fi: WinBox-managerin kehitys lopetettiin vuonna 2022, koska ylläpitäjiä ei ollut riittävästi. Koska suuntaamme ponnistuksemme 86Boxin parantamiseen entisestään, olemme päättäneet olla enää tukematta WinBoxia managerina. WinBoxin kautta ei enää toimiteta päivityksiä, ja saatat kohdata virheellistä käyttäytymistä, jos jatkat sen käyttöä 86Boxin uudemmissa versioissa. Kaikki WinBoxin käyttäytymiseen liittyvät vikailmoitukset suljetaan virheellisinä. Siirry osoitteeseen 86box.net saadaksesi luettelon muista käyttämistäsi hallintaohjelmista.
fr_fr: Le développement du gestionnaire WinBox s'est arrêté en 2022 en raison d'un manque de mainteneurs. Comme nous concentrons nos efforts sur l'amélioration de 86Box, nous avons pris la décision de ne plus supporter WinBox en tant que gestionnaire. Aucune mise à jour ne sera fournie par WinBox, et vous pourriez rencontrer des comportements incorrects si vous continuez à l'utiliser avec des versions plus récentes de 86Box. Tous les rapports de bogues relatifs au comportement de WinBox seront classés comme non valides. Allez sur 86box.net pour une liste d'autres gestionnaires que vous pouvez utiliser.
hu_hu: A WinBox menedzser fejlesztése 2022-ben leállt karbantartók hiányában. Mivel erőfeszítéseinket a 86Box még jobbá tételére irányítjuk, úgy döntöttünk, hogy a WinBox-ot mint menedzsert nem támogatjuk tovább. A WinBoxon keresztül nem lesznek további frissítések, és hibás viselkedéssel találkozhat, ha továbbra is a 86Box újabb verzióival használja. A WinBox viselkedésével kapcsolatos hibajelentéseket érvénytelennek nyilvánítjuk. A 86box.net oldalon talál egy listát más kezelőkről, amelyeket használhat.
it_it: Lo sviluppo del gestore WinBox si è interrotto nel 2022 per mancanza di manutentori. Poiché i nostri sforzi sono rivolti a rendere 86Box ancora migliore, abbiamo deciso di non supportare più WinBox come gestore. Non saranno forniti ulteriori aggiornamenti tramite WinBox e si potrebbe riscontrare un comportamento non corretto se si continua a utilizzarlo con versioni più recenti di 86Box. Tutte le segnalazioni di bug relative al comportamento di WinBox saranno chiuse in quanto non valide. Per un elenco di altri gestori utilizzabili, visitare 86box.net.
ja_jp: WinBoxマネージャーの開発は、メンテナ不足のため2022年に停止しました。86Boxをより良いものにするため、WinBoxをマネージャーとしてサポートしないことを決定しました。 WinBoxを使ったアップデートは今後提供されませんし、86Boxの新しいバージョンでWinBoxを使い続けると、正しくない動作に遭遇するかもしれません。WinBoxの動作に関連するバグレポートは無効としてクローズされます。 86box.netに他のマネージャのリストがあります。
pl_pl: Rozwój menedżera WinBox został zatrzymany w 2022 roku z powodu braku opiekunów. Ponieważ kierujemy nasze wysiłki na uczynienie 86Box jeszcze lepszym, podjęliśmy decyzję o zaprzestaniu wspierania WinBox jako menedżera. Żadne dalsze aktualizacje nie będą dostarczane za pośrednictwem WinBox i możesz napotkać nieprawidłowe zachowanie, jeśli będziesz go nadal używać z nowszymi wersjami 86Box. Wszelkie zgłoszenia błędów związane z działaniem WinBox zostaną zamknięte jako nieważne. Lista innych menedżerów, z których można korzystać, znajduje się na stronie 86box.net.
pt_br: O desenvolvimento do gerenciador WinBox foi interrompido em 2022 devido à falta de mantenedores. Conforme direcionamos nossos esforços para tornar o 86Box ainda melhor, tomamos a decisão de não oferecer mais suporte ao WinBox como gerenciador. Atualizações não serão mais fornecidas através do WinBox, e você poderá encontrar comportamentos incorretos caso continue a usá-lo com versões mais recentes do 86Box. Quaisquer relatórios de bugs relacionados ao comportamento do WinBox serão fechados como inválidos. Acesse 86box.net para obter uma lista de outros gerenciadores que você pode usar.
ru_ru: Разработка менеджера WinBox прекратилась в 2022 году из-за отсутствия сопровождающих. Поскольку мы направляем наши усилия на то, чтобы сделать 86Box еще лучше, мы приняли решение больше не поддерживать WinBox в качестве менеджера. WinBox больше не будет обновляться, и вы можете столкнуться с некорректным поведением, если продолжите использовать его с новыми версиями 86Box. Любые сообщения об ошибках, связанных с поведением WinBox, будут закрыты как недействительные. Перейдите на сайт 86box.net для получения списка других менеджеров, которые вы можете использовать.
sk_sk: Vývoj správcu WinBox sa zastavil v roku 2022 z dôvodu nedostatku správcov. Keďže naše úsilie smerujeme k ešte lepšiemu systému 86Box, rozhodli sme sa, že správca WinBox už nebude podporovaný. Prostredníctvom WinBoxu nebudú poskytované žiadne ďalšie aktualizácie a v prípade, že ho budete naďalej používať s novšími verziami programu 86Box, môžete sa stretnúť s nesprávnym správaním. Všetky hlásenia o chybách týkajúce sa správania WinBoxu budú uzavreté ako neplatné. Na stránke 86box.net nájdete zoznam iných správcov, ktoré môžete používať.
sl_si: Razvoj upravitelja WinBox se je leta 2022 ustavil zaradi pomanjkanja vzdrževalcev. Ker svoja prizadevanja usmerjamo v še boljše delovanje programa 86Box, smo se odločili, da programa WinBox kot upravitelja ne bomo več podpirali. WinBox ne bo več zagotavljal posodobitev, če ga boste še naprej uporabljali z novejšimi različicami programa 86Box, pa lahko naletite na nepravilno obnašanje. Vsa poročila o napakah, povezana z obnašanjem programa WinBox, bodo zaprta kot neveljavna. Za seznam drugih upraviteljev, ki jih lahko uporabite, obiščite spletno stran 86box.net.
tr_tr: WinBox yöneticisinin geliştirilmesi, bakımcı eksikliği nedeniyle 2022 yılında durduruldu. Çabalarımızı 86Box'ı daha da iyi hale getirmeye yönlendirdiğimiz için, WinBox'ı artık bir yönetici olarak desteklememe kararı aldık. WinBox aracılığıyla daha fazla güncelleme sağlanmayacak ve 86Box'ın daha yeni sürümleriyle kullanmaya devam ederseniz hatalı davranışlarla karşılaşabilirsiniz. WinBox davranışıyla ilgili tüm hata raporları geçersiz olarak kapatılacaktır. Kullanabileceğiniz diğer yöneticilerin bir listesi için 86box.net adresine gidin.
uk_ua: Розробку менеджера WinBox було припинено у 2022 році через брак супровідників. Оскільки ми спрямовуємо наші зусилля на те, щоб зробити 86Box ще кращим, ми прийняли рішення більше не підтримувати WinBox як менеджер. Більше ніяких оновлень не буде надаватися через WinBox, і ви можете зіткнутися з некоректною поведінкою, якщо продовжите використовувати його з новими версіями 86Box. Будь-які повідомлення про помилки, пов'язані з поведінкою WinBox, будуть закриті як недійсні. Перейдіть на 86box.net для отримання списку інших менеджерів, які ви можете використовувати.
vi_vn: Trình quản lý phiên WinBox đã bị dừng phát triển năm 2022 do thiếu nhân sự duy trì. Vì những quyết định để cho 86Box trở nên tốt hơn, chúng tôi đã không còn hỗ trợ trình quản lý WinBox. Sẽ không có bản cập nhật mới cho WinBox nữa, và nếu bạn tiếp tục sử dụng với các bản 86Box mới hơn có thể gặp lỗi. Bất kì các bản bug report liên quan đến lỗi của WinBox sẽ bị coi là không hợp lệ và bị đóng. Truy cập 86Box.net để tìm qua các trình quản lý phiên/manager khác cho phù hợp.

source: Make sure %1 is installed and that you are on a libpcap-compatible network connection.
sk_sk: Uistite sa, že je nainštalovaný %1 a používate sieťové pripojenie s ním kompatibilné.
sl_si: Prepičajte se, da je nameščen %1 in da ste na omrežni povezavi, združljivi z libpcap.
tr_tr: %1 kurulu olduğundan ve libpcap-uyumlu bir internet ağında bulunduğunuzdan emin olun.
uk_ua: Переконайтесь, що %1 встановлений і ваше мережеве з'єднання, сумісне з libpcap.

source: &Qt (Software)
fi_fi: &Qt (ohjelmistopohjainen)
fr_fr: &Qt (Logiciel)
hr_hr: &Qt (Softver)
hu_hu: &Qt (Szoftveres)
ja_jp: Qt (ソフトウェア)(&Q)
sl_si: &Qt (programsko)
tr_tr: &Qt (Yazılım)
vi_vn: &Qt (phần mềm)

source: FPU:
cs_cz: Koprocesor:
de_de: FPU-Einheit:
fi_fi: Apusuoritin:
hr_hr: FPU uređaj:
hu_hu: FPU-egység:
pl_pl: Jednostka FPU:
sk_sk: Koprocesor:
sl_si: Procesor plavajoče vejice:

source: ISA RTC:
cs_cz: ISA hodiny:
de_de: ISA-Echtzeituhr:
fi_fi: ISA-RTC (kello):
fr_fr: Horloge temps réel ISA:
hr_hr: Sat stvarnog vremena (RTC):
hu_hu: ISA RTC (óra):
it_it: RTC ISA:
ja_jp: ISA RTCカード:
pt_br: RTC ISA:
sk_sk: ISA hodiny:
sl_si: Ura v realnem času ISA:

source: &Ctrl+Alt+Del Ctrl+F12
de_de: &Strg+Alt+Entf Strg+F12
ja_jp: Ctrl+Alt+Del(&C) Ctrl+F12

source: Ctrl+Alt+&Esc
de_de: Strg+Alt+&Esc
ja_jp: Ctrl+Alt+Esc(&E)

source: Qt (&OpenGL)
ja_jp: Qt (OpenGL)(&O)

source: &VNC
ja_jp: VNC(&V)

source: &0.5x
ja_jp: 0.5x(&0)

source: &1x
ja_jp: 1x(&1)

source: 1.&5x
ja_jp: 1.5x(&5)

source: &2x
ja_jp: 2x(&2)

source: &3x
ja_jp: 3x(&3)

source: &4x
ja_jp: 4x(&4)

source: &5x
ja_jp: 5x(&5)

source: &6x
ja_jp: 6x(&6)

source: &7x
ja_jp: 7x(&7)

source: &8x
ja_jp: 8x(&8)

source: BT&601 (NTSC/PAL)
ja_jp: BT601 (NTSC/PAL)(&6)

source: BT&709 (HDTV)
ja_jp: BT709 (HDTV)(&7)

source: &VSync
fr_fr: Synchronisation &verticale
ja_jp: 垂直同期(VSync)(&V)
pt_br: Sincronização &vertical

source: Microsoft SideWinder Pad
ja_jp: Microsoft SideWinderパッド

source: H
fr_fr: T
pt_br: CA

source: C
pt_br: CI

source: S
pt_br: SE

source: 86Box v
de_de: 86Box Version
hr_hr: 86Box verzija
pt_br: 86Box versão

source: OK
ca_es: D'acord
es_es: Aceptar
hr_hr: U redu
sl_si: V redu
tr_tr: Tamam
vi_vn: Đồng ý

source: %i estat(s) d'espera
ca_es: %i estado(s) de Espera

source: Ctrl+End
de_de: Strg+Ende
