Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: Remove
ru_ru: Удалить

source: Bus:
cs_cz: Sběrnice:
fi_fi: Väylä:
hr_hr: Sabirnica:
hu_hu: Busz:
ja_jp: バス:
pl_pl: Magistrala:
pt_br: Barramento:
ru_ru: Шина:
sk_sk: Zbernica:
sl_si: Vodilo:
tr_tr: Veri yolu:
uk_ua: Шина:

source: Channel:
ca_es: Canal:
cs_cz: Kanál:
de_de: Kanal:
es_es: Canal:
fi_fi: Kanava:
fr_fr: Canal:
hr_hr: Kanal:
hu_hu: Csatorna:
it_it: Canale:
ja_jp: チャンネル:
pl_pl: Kanał:
pt_br: Canal:
ru_ru: Канал:
sk_sk: Kanál:
sl_si: Kanal:
tr_tr: Kanal:
uk_ua: Канал:
vi_vn: Kênh:

source: &Specify...
ca_es: E&specificar...
cs_cz: &Zadat...
de_de: &Festlegen...
es_es: E&specificar...
fi_fi: &Määritä...
fr_fr: &Spécifier...
hr_hr: &Odredi...
hu_hu: &Kiválasztás...
it_it: &Specifica...
ja_jp: 参照(&S)...
pl_pl: &Określ...
pt_br: &Especificar...
ru_ru: &Указать...
sk_sk: &Zadať...
sl_si: Določi...
tr_tr: &Belirle...
uk_ua: &Вказати...
vi_vn: Chỉ &rõ...

source: Sectors:
cs_cz: Sektory:
de_de: Sektoren:
es_es: Sectores:
fi_fi: Sektorit:
fr_fr: Secteurs:
hr_hr: Sektori:
hu_hu: Szektor:
it_it: Settori:
ja_jp: セクター:
pl_pl: Sektory:
pt_br: Setores:
ru_ru: Секторы:
sk_sk: Sektory:
sl_si: Sektorji:
tr_tr: Sektörler:
uk_ua: Сектора:
vi_vn: Sector:

source: Heads:
ca_es: Caps:
cs_cz: Hlavy:
de_de: Köpfe:
es_es: Cabezas:
fi_fi: Lukupäät:
fr_fr: Têtes:
hr_hr: Glave:
hu_hu: Fej:
it_it: Testine:
ja_jp: ヘッド:
pl_pl: Głowice:
pt_br: Cabeças:
ru_ru: Головки:
sk_sk: Hlavy:
sl_si: Glave:
tr_tr: Veri Kafaları:
uk_ua: Головки:
vi_vn: Đầu ghi:

source: Cylinders:
ca_es: Cilindres:
cs_cz: Cylindry:
de_de: Zylinder:
es_es: Cilindros:
fi_fi: Sylinterit:
fr_fr: Cylindres:
hr_hr: Cilindri:
hu_hu: Cilinder:
it_it: Cilindri:
ja_jp: シリンダー:
pl_pl: Cylindry:
pt_br: Cilindros:
ru_ru: Цилиндры:
sk_sk: Cylindre:
sl_si: Cilindri:
tr_tr: Silindirler:
uk_ua: Циліндри:
vi_vn: Trụ:

source: Size (MB):
ca_es: Mida (MB):
cs_cz: Velikost (MB):
de_de: Größe (MB):
es_es: Tamaño (MB):
fi_fi: Koko (Mt):
fr_fr: Taille (Mo):
hr_hr: Veličina (MB):
hu_hu: Méret (MB):
it_it: Dimensioni (MB):
ja_jp: サイズ(MB):
pl_pl: Rozmiar (MB):
pt_br: Tamanho (MB):
ru_ru: Размер (МБ):
sk_sk: Veľkosť (MB):
sl_si: Velikost (MB):
tr_tr: Boyut (MB):
uk_ua: Розмір (МБ):
vi_vn: Kích thước (MB):

source: Type:
ca_es: Tipus:
cs_cz: Typ:
de_de: Typ:
es_es: Tipo:
fi_fi: Tyyppi:
hr_hr: Tip:
hu_hu: Típus:
it_it: Tipo:
ja_jp: タイプ:
pl_pl: Rodzaj:
pt_br: Tipo:
ru_ru: Тип:
sk_sk: Typ:
sl_si: Vrsta:
tr_tr: Tip:
uk_ua: Тип:
vi_vn: Loại:

source: Image Format:
ca_es: Format d'imatge:
cs_cz: Formát obrazu:
es_es: Formato de imagen:
fi_fi: Tiedostomuoto:
fr_fr: Format Image:
hr_hr: Format slike:
hu_hu: Formátum:
it_it: Formato immagine:
ja_jp: イメージ形式:
pl_pl: Format obrazu:
pt_br: Formato:
ru_ru: Тип образа:
sk_sk: Formát obrazu:
sl_si: Format slike:
tr_tr: İmaj Düzeni:
uk_ua: Тип образу:
vi_vn: Định dạng ảnh đĩa:

source: Block Size:
ca_es: Mida del bloc:
cs_cz: Velikost bloků:
de_de: Blockgröße:
es_es: Tamaño de bloque:
fi_fi: Lohkon koko:
fr_fr: Taille du bloc:
hr_hr: Veličina slike:
hu_hu: Blokkméret:
it_it: Dimensioni blocco:
ja_jp: ブロックサイズ:
pl_pl: Rozmiar bloku:
pt_br: Blocos:
ru_ru: Размер блока:
sk_sk: Veľkosť blokov:
sl_si: Velikost bloka:
tr_tr: Blok Boyutu:
uk_ua: Розмір блоку:
vi_vn: Kích thước bloc:

source: Floppy drives:
ca_es: Unitats de disquet:
cs_cz: Disketové mechaniky:
de_de: Diskettenlaufwerke:
es_es: Unidades de disquete:
fi_fi: Levykeasemat:
fr_fr: Lecteurs de disquettes:
hr_hr: Disketni pogoni:
hu_hu: Floppy-meghajtók:
it_it: Unità floppy:
ja_jp: フロッピードライブ:
pl_pl: Napędy dyskietek:
pt_br: Unidades de disquete:
ru_ru: Гибкие диски:
sk_sk: Disketové mechaniky:
sl_si: Disketni pogoni:
tr_tr: Disket sürücüleri:
uk_ua: Гнучкі диски:
vi_vn: Ổ đĩa mềm:

source: Turbo timings
ca_es: Temps turbo
cs_cz: Turbo časování
es_es: Temporizaciones Turbo
fi_fi: Turbo-ajoitukset
fr_fr: Turbo
hr_hr: Turbo vrijemena
hu_hu: Turbó időzítés
it_it: Turbo
ja_jp: 高速タイミング
pl_pl: Rozrządy Turbo
pt_br: Turbo
ru_ru: Турбо тайминги
sk_sk: Turbo časovanie
sl_si: Turbo časovniki
tr_tr: Turbo zamanlamaları
uk_ua: Турбо таймінги
vi_vn: Thời gian turbo

source: Check BPB
ca_es: Comprovar BPB
cs_cz: Kontrola BPB
de_de: BPB überprüfen
es_es: Chequear BPB
fi_fi: Tarkista BPB
fr_fr: Vérifier BPB
hr_hr: Provjeraj BPB
hu_hu: BPB ellenőrzés
it_it: Verifica BPB
ja_jp: BPBチェック
pl_pl: Sprawdzaj BPB
pt_br: Verificar BPB
ru_ru: Проверять BPB
sk_sk: Kontrola BPB
sl_si: Preverjaj BPB
tr_tr: BPB'yi denetle
uk_ua: Перевіряти BPB
vi_vn: Kiểm tra BPB

source: CD-ROM drives:
ca_es: Unitats de CD-ROM:
cs_cz: Mechaniky CD-ROM:
de_de: CD-ROM-Laufwerke:
es_es: Unidades de CD-ROM:
fi_fi: CD-ROM-asemat:
fr_fr: Lecterus CD-ROM:
hr_hr: CD-ROM pogoni:
hu_hu: CD-ROM meghajtók:
it_it: Unità CD-ROM:
ja_jp: CD-ROMドライブ:
pl_pl: Napędy CD-ROM:
pt_br: Unidades de CD-ROM:
ru_ru: Дисководы CD-ROM:
sk_sk: Mechaniky CD-ROM:
sl_si: Pogoni CD-ROM:
tr_tr: CD-ROM sürücüleri:
uk_ua: Дисководи CD-ROM:
vi_vn: Ổ đĩa CD-ROM:

source: MO drives:
ca_es: Unitats MO:
cs_cz: Magnetooptické mechaniky:
de_de: MO-Laufwerke:
es_es: Unidades MO:
fi_fi: Magneettisoptiset asemat (MO):
fr_fr: Lecteurs magnéto-optiques:
hr_hr: MO pogoni:
hu_hu: MO-meghajtók:
it_it: Unità magneto-ottiche:
ja_jp: 光磁気ドライブ:
pl_pl: Napędy MO:
pt_br: Unidades magneto-ópticas:
ru_ru: Магнитооптические дисководы:
sk_sk: Magnetooptické mechaniky:
sl_si: Magnetno-optični pogoni:
tr_tr: MO sürücüleri:
uk_ua: Магнітооптичні дисководи:
vi_vn: Ổ đĩa MO:

source: ZIP drives:
ca_es: Unitats ZIP:
cs_cz: Mechaniky ZIP:
de_de: ZIP-Laufwerke:
es_es: Unidades ZIP:
fi_fi: ZIP-asemat:
fr_fr: Lecteurs ZIP:
hr_hr: ZIP pogoni:
hu_hu: ZIP-meghajtók:
it_it: Unità ZIP:
ja_jp: ZIPドライブ:
pl_pl: Napędy ZIP:
pt_br: Unidades ZIP:
ru_ru: ZIP дисководы:
sk_sk: Mechaniky ZIP:
sl_si: Pogoni ZIP:
tr_tr: ZIP sürücüleri:
uk_ua: ZIP дисководи:
vi_vn: Ổ đĩa ZIP:

source: ISA Memory Expansion
ca_es: Expansió de memòria ISA
cs_cz: ISA rozšíření paměti
de_de: ISA-Speichererweiterung:
es_es: Expansión de Memoria ISA
fi_fi: ISA-muistilaajennus
fr_fr: Expansion de la mémoire ISA
hr_hr: Proširenje memorije ISA
hu_hu: ISA memóriabővítők
it_it: Espansione memoria ISA
ja_jp: ISAメモリ拡張カード
pl_pl: Rozszerzenie pamięci ISA
pt_br: Expansão de memória ISA
ru_ru: Карта расширения памяти ISA
sk_sk: ISA rozšírenie pamäte
sl_si: Razširitev spomina ISA
tr_tr: ISA Bellek Artırma
uk_ua: Карта розширення пам'яті (ISA)
vi_vn: Mở rộng bộ nhớ qua ISA

source: Card 1:
ca_es: Targeta 1:
cs_cz: Karta 1:
de_de: Steckkarte 1:
es_es: Tarjeta 1:
fi_fi: Kortti 1:
fr_fr: Carte 1:
hr_hr: Kartica 1:
hu_hu: Kártya 1:
it_it: Scheda 1:
ja_jp: カード1:
pl_pl: Karta 1:
pt_br: Placa 1:
ru_ru: Карта 1:
sk_sk: Karta 1:
sl_si: Kartica 1:
tr_tr: Kart 1:
uk_ua: Карта 1:
vi_vn: Thẻ 1:

source: Card 2:
ca_es: Targeta 2:
cs_cz: Karta 2:
de_de: Steckkarte 2:
es_es: Tarjeta 2:
fi_fi: Kortti 2:
fr_fr: Carte 2:
hr_hr: Kartica 2:
hu_hu: Kártya 2:
it_it: Scheda 2:
ja_jp: カード2:
pl_pl: Karta 2:
pt_br: Placa 2:
ru_ru: Карта 2:
sk_sk: Karta 2:
sl_si: Kartica 2:
tr_tr: Kart 2:
uk_ua: Карта 2:
vi_vn: Thẻ 2:

source: Card 3:
ca_es: Targeta 3:
cs_cz: Karta 3:
de_de: Steckkarte 3:
es_es: Tarjeta 3:
fi_fi: Kortti 3:
fr_fr: Carte 3:
hr_hr: Kartica 3:
hu_hu: Kártya 3:
it_it: Scheda 3:
ja_jp: カード3:
pl_pl: Karta 3:
pt_br: Placa 3:
ru_ru: Карта 3:
sk_sk: Karta 3:
sl_si: Kartica 3:
tr_tr: Kart 3:
uk_ua: Карта 3:
vi_vn: Thẻ 3:

source: Card 4:
ca_es: Targeta 4:
cs_cz: Karta 4:
de_de: Steckkarte 4:
es_es: Tarjeta 4:
fi_fi: Kortti 4:
fr_fr: Carte 4:
hr_hr: Kartica 4:
hu_hu: Kártya 4:
it_it: Scheda 4:
ja_jp: カード4:
pl_pl: Karta 4:
pt_br: Placa 4:
ru_ru: Карта 4:
sk_sk: Karta 4:
sl_si: Kartica 4:
tr_tr: Kart 4:
uk_ua: Карта 4:
vi_vn: Thẻ 4:

source: ISABugger device
ca_es: Dispositiu ISABugger
cs_cz: Zařízení ISABugger
de_de: ISABugger-Gerät
es_es: Dispositivo ISABugger
fi_fi: ISABugger-laite
fr_fr: Dispositif ISABugger
hr_hr: Uređaj ISABugger
hu_hu: ISABugger eszköz
it_it: Dispositivo ISABugger
ja_jp: ISABuggerデバイス
pl_pl: Urządzenie ISABugger
pt_br: Dispositivo ISABugger
ru_ru: Устройство ISABugger
sk_sk: Zariadenie ISABugger
sl_si: Naprava ISABugger
tr_tr: ISABugger cihazı
uk_ua: Пристрій ISABugger
vi_vn: Thiết bị ISABugger

source: POST card
ca_es: Targeta POST
cs_cz: Karta pro kódy POST
de_de: POST-Code-Karte
es_es: Tarjeta POST
fi_fi: POST-kortti
fr_fr: Carte POST
hr_hr: Kartica POST
hu_hu: POST kártya
it_it: Scheda POST
ja_jp: POSTカード
pl_pl: Karta POST
pt_br: Placa de diagnóstico
ru_ru: Карта POST
sk_sk: Karta pre kódy POST
sl_si: Kartica POST
tr_tr: POST kartı
uk_ua: Карта POST
vi_vn: Thẻ POST

source: 86Box Unit Tester
ru_ru: Модульный Тестер 86Box

source: Error
cs_cz: Chyba
de_de: Fehler
fi_fi: Virhe
fr_fr: Erreur
hr_hr: Greška
hu_hu: Hiba
it_it: Errore
ja_jp: エラー
pl_pl: Błąd
pt_br: Erro
ru_ru: Ошибка
sk_sk: Chyba
sl_si: Napaka
tr_tr: Hata
uk_ua: Помилка
vi_vn: Lỗi

source: Fatal error
ca_es: Error fatal
cs_cz: Kritická chyba
de_de: Fataler Fehler
es_es: Error fatal
fi_fi: Vakava virhe
fr_fr: Erreur fatale
hr_hr: Fatalna greška
hu_hu: Végzetes hiba
it_it: Errore fatale
ja_jp: 致命的なエラー
pl_pl: Fatalny błąd
pt_br: Erro fatal
ru_ru: Неустранимая ошибка
sk_sk: Kritická chyba
sl_si: Kritična napaka
tr_tr: Kritik hata
uk_ua: Непереробна помилка
vi_vn: Lỗi nghiêm trọng

source: - PAUSED
ca_es: - EN PAUSA
fi_fi: - TAUKO
ja_jp: - 一時停止
pt_br: - PAUSADO
ru_ru: - ПАУЗА
sk_sk: - POZASTAVENÝ
vi_vn: - TẠM DỪNG

source: Press Ctrl+Alt+PgDn to return to windowed mode.
ca_es: Premeu Ctrl+Alt+PgDn per tornar al mode de finestra.
cs_cz: Stiskněte Ctrl+Alt+PgDn pro návrat z režimu celé obrazovky.
de_de: Bitte Strg+Alt+Bild ab zur Rückkehr in den Fenstermodus drücken.
es_es: Pulsa Ctrl+Alt+PgDn para volver a modo ventana.
fi_fi: Paina Ctrl+Alt+PgDn palataksesi ikkunoituun tilaan.
fr_fr: Appuyez sur Ctrl+Alt+PgDn pour revenir au mode fenêtré.
hr_hr: Pritisnite Ctrl+Alt+PgDn za povratak u prozorski način rada.
hu_hu: Használja a Ctrl+Alt+PgDn gombokat az ablakhoz való visszatéréshez.
it_it: Usa Ctrl+Alt+PgDn per tornare alla modalità finestra.
ja_jp: Ctrl+Alt+PgDnでウィンドウ モードに戻ります。
pl_pl: Naciśnij klawisze Ctrl+Alt+PgDn aby wrócić to trybu okna.
pt_br: Use Ctrl+Alt+PgDn para retornar ao modo janela
ru_ru: Нажмите Ctrl+Alt+PgDn для возврата в оконный режим.
sk_sk: Stlačte Ctrl+Alt+PgDn pre návrat z režimu celej obrazovky.
sl_si: Pritisnite Ctrl+Alt+PgDn za povratek iz celozaslonskega načina.
tr_tr: Pencere moduna geri dönmek için Ctrl+Alt+PgDn tuşlarına basın.
uk_ua: Натисніть Ctrl+Alt+PgDn для повернення у віконний режим.
vi_vn: Bấm Ctrl+Alt+PgDn để quay lại chế độ cửa sổ.

source: Speed
ca_es: Velocitat
cs_cz: Rychlost
de_de: Geschwindigkeit
es_es: Velocidad
fi_fi: Nopeus
fr_fr: Vitesse
hr_hr: Brzina
hu_hu: Sebesség
it_it: Velocità
ja_jp: 速度
pl_pl: Szybkość
pt_br: Velocidade
ru_ru: Скорость
sk_sk: Rýchlosť
sl_si: Hitrost
tr_tr: Hız
uk_ua: Швидкість
vi_vn: Vận tốc

source: ZIP images
ca_es: Imatges ZIP
cs_cz: Obrazy ZIP disků
es_es: Imagenes ZIP
fi_fi: ZIP-levykuvat
fr_fr: Images ZIP
hr_hr: ZIP slike
hu_hu: ZIP-lemezképek
it_it: Immagini ZIP
ja_jp: ZIPイメージ
pl_pl: Obrazy ZIP
pt_br: Imagens ZIP
ru_ru: Образы ZIP
sk_sk: Obrazy ZIP diskov
sl_si: ZIP slike
tr_tr: ZIP imajları
uk_ua: Образи ZIP
vi_vn: Ảnh đĩa ZIP

source: 86Box could not find any usable ROM images. Please <a href="https://github.com/86Box/roms/releases/latest">download</a> a ROM set and extract it into the "roms" directory.
ca_es: 86Box no ha pogut trobar cap imatge ROM utilitzable. Si us plau, <a href="https://github.com/86Box/roms/releases/latest">descarregueu</a> un conjunt de ROM i extreu-lo al directori "roms".
cs_cz: 86Box nenalezl žádné použitelné image pamětí ROM. <a href="https://github.com/86Box/roms/releases/latest">Stáhněte</a> sadu obrazů ROM a extrahujte ji do složky "roms".
de_de: 86Box konnte keine nutzbaren ROM-Dateien finden. Bitte besuchen Sie <a href="https://github.com/86Box/roms/releases/latest">download</a>, laden ein ROM-Set herunter und extrahieren dies in das "roms"-Verzeichnis.
es_es: 86Box no pudo encontrar ninguna imagen ROM usable. Por favor <a href="https://github.com/86Box/roms/releases/latest">descargue</a> un conjunte de ROMs y extráigalo en el directorio "roms".
fi_fi: 86Box ei löytänyt käyttökelpoisia ROM-tiedostoja. Voit <a href="https://github.com/86Box/roms/releases/latest">ladata</a> ROM-paketin ja purkaa sen "roms"-hakemistoon.
fr_fr: 86Box n'a pas pu trouver d'images ROM utilisables. S'il vous plait, <a href="https://github.com/86Box/roms/releases/latest">téléchargez</a> un ensemble ROM et extrayez-le dans le répertoire "roms".
hr_hr: 86Box nije mogao pronaći upotrebljive ROM datoteke. Molimte posjetite <a href="https://github.com/86Box/roms/releases/latest"></a> sknite paket s ROM datotekama i ekstrahirajte paket u "roms" mapu.
hu_hu: A 86Box nem talált használható ROM-képeket Kérem <a href="https://github.com/86Box/roms/releases/latest">töltse le</a> a ROM készletet és bontsa ki a "roms" könyvtárba.
it_it: 86Box non può trovare immagini ROM utilizzabili. Please <a href="https://github.com/86Box/roms/releases/latest">download</a> a ROM set and extract it into the "roms" directory.
ja_jp: 86Boxで使用可能なROMイメージが見つかりません。 ROMセットを<a href="https://github.com/86Box/roms/releases/latest">ダウンロード</a>して、roms ディレクトリに解凍してください。
pl_pl: 86Box nie może znaleźć obrazów ROM nadających się do użytku. Proszę pobrać zestaw obrazów ROM ze strony <a href="https://github.com/86Box/roms/releases/latest">download</a>, i rozpakować je do katalogu "roms".
pt_br: O 86Box não conseguiu encontrar nenhuma imagem de ROM utilizável. Por favor, <a href="https://github.com/86Box/roms/releases/latest">baixe</a> um conjunto de ROM e extraia no diretório "roms".
ru_ru: 86Box не смог найти ни одного подходящего для использования файла с ПЗУ. Пожалуйста <a href="https://github.com/86Box/roms/releases/latest">скачайте</a> набор ПЗУ и извлеките его в каталог "roms".
sk_sk: 86Box nenašiel žiadne použiteľné imidž pamätí ROM. <a href="https://github.com/86Box/roms/releases/latest">Stiahnite</a> sadu obrazov ROM a extrahujte ju do zložky "roms".
sl_si: 86Box ni našel nobenih uporabnih ROM slik. Prosim <a href="https://github.com/86Box/roms/releases/latest">prenesite</a> set ROM-ov in ga razširite v mapo "roms".
tr_tr: 86Box hiç bir kullanılabilir ROM imajı bulamadı. Lütfen <a href="https://github.com/86Box/roms/releases/latest">ROM setini indirin</a> ve onu "Roms" klasörüne çıkarın.
uk_ua: 86Box не зміг знайти жодного відповідного для використання файлу з ПЗУ. Будь ласка <a href="https://github.com/86Box/roms/releases/latest">завантажте</a> набір ПЗУ і витягніть його в каталог "roms".
vi_vn: 86Box không tìm được bản ROM nào. Vui lòng <a href="https://github.com/86Box/roms/releases/latest">tải về</a> bộ ROM và trích xuất về thư mục "roms".

source: (empty)
ca_es: (buit)
cs_cz: (prázdné)
de_de: (leer)
es_es: (vacío)
fi_fi: (tyhjä)
fr_fr: (vide)
hr_hr: (prazno)
hu_hu: (üres)
ja_jp: (空)
pl_pl: (pusty)
pt_br: (vazio)
ru_ru: (пусто)
sk_sk: (prázdne)
sl_si: (prazno)
uk_ua: (порожньо)
vi_vn: (trống trơn)

source: Clear image history
ru_ru: Очистить историю образов

source: All files
ca_es: Tots els fitxers
cs_cz: Všechny soubory
de_de: Alle Dateien
es_es: Todos los archivos
fi_fi: Kaikki tiedostot
fr_fr: Tous les fichiers
hr_hr: Sve datoteke
hu_hu: Minden fájl
it_it: Tutti i file
ja_jp: すべてのファイル
pl_pl: Wszystkie pliki
pt_br: Todos os arquivos
ru_ru: Все файлы
sk_sk: Všetky súbory
sl_si: Vse datoteke
uk_ua: Всі файли
vi_vn: Tất cả file

source: Turbo
hu_hu: Turbó
ja_jp: 高速
ru_ru: Турбо
uk_ua: Турбо

source: On
cs_cz: Zap.
de_de: An
fi_fi: Päällä
fr_fr: Activé
hr_hr: Uključeno
hu_hu: Bekapcsolva
it_it: Acceso
ja_jp: オン
pl_pl: Włącz
pt_br: Lig.
ru_ru: Вкл
sk_sk: Zap.
sl_si: Vključeno
tr_tr: Açık
uk_ua: Увімк
vi_vn: Bật

source: Off
cs_cz: Vyp.
de_de: Aus
fi_fi: Pois
fr_fr: Désactivé
hr_hr: Isključeno
hu_hu: Kikapcsolva
it_it: Spento
ja_jp: オフ
pl_pl: Wyłącz
pt_br: Desl.
ru_ru: Выкл
sk_sk: Vyp.
sl_si: Izključeno
tr_tr: Kapalı
uk_ua: Вимк
vi_vn: Tắt

source: All images
ca_es: Totes les imatges
cs_cz: Všechny obrazy disků
de_de: Alle Images
es_es: Todas las imagenes
fi_fi: Kaikki levykuvat
fr_fr: Tous les images
hr_hr: Sve slike
hu_hu: Minden képfájl
it_it: Tutte le immagini
ja_jp: すべてのイメージ
pl_pl: Wszystkie obrazy
pt_br: Todas as imagens
ru_ru: Все образы
sk_sk: Všetky obrazy diskov
sl_si: Vse slike
tr_tr: Tüm imajlar
uk_ua: Всі образи
vi_vn: Tất cả ảnh

source: Basic sector images
ca_es: Imatges sectorials bàsiques
cs_cz: Základní sektorové obrazy
de_de: Basissektorimages
fi_fi: Perussektorilevykuvat
fr_fr: Images basiques du secteur
hr_hr: BOsnovne sektorske slike
hu_hu: Alapvető szektor képfájlok
it_it: Immagini di settori base
ja_jp: ベーシック セクター イメージ
pl_pl: Podstawowe obrazy sektorów
pt_br: Imagens de setor básico
ru_ru: Простые посекторные образы
sk_sk: Základné sektorové obrazy
sl_si: Osnovne sektorske slike
tr_tr: Basit sektör imajları
uk_ua: Прості посекторні образи
vi_vn: Ảnh sector cơ bản

source: Surface images
ca_es: Imatges superficials
cs_cz: Obrazy povrchu
de_de: Oberflächenimages
fi_fi: Pintalevykuvat
fr_fr: Images de la surface
hr_hr: Površinske slike
hu_hu: Felületi képfájlok
it_it: Immagini di superficie
ja_jp: サーフェス イメージ
pl_pl: Obrazy powierzchniowe
pt_br: Imagens de superfície
ru_ru: Surface образы
sk_sk: Obrazy povrchu
sl_si: Površinske slike
tr_tr: Yüzey imajları
uk_ua: Образ поверхні
vi_vn: Ảnh bề mặt

source: Machine "%hs" is not available due to missing ROMs in the roms/machines directory. Switching to an available machine.
ca_es: La màquina "%hs" no està disponible perquè falten ROM al directori roms/machines. Canvi a una màquina disponible.
cs_cz: Počítač "%hs" není dostupný, jelikož chybí obraz jeho paměti ROM ve složce "roms/machines". Konfigurace se přepne na jiný dostupný počítač.
de_de: Das System "%hs" ist aufgrund von fehlenden ROMs im Verzeichnis roms/machines nicht verfügbar. Es wird auf ein verfügbares System gewechselt.
es_es: La máquina "%hs" no está disponible debido a ROMs faltantes en el directorio roms/machines. Cambiando a una máquina disponible.
fi_fi: Konetta "%hs" ei voi käyttää puuttuvien ROM-tiedostojen vuoksi. Vaihdetaan käyttökelpoiseen koneeseen.
fr_fr: La machine "%hs" n'est pas disponible en raison de l'absence de ROMs dans le répertoire roms/machines. Basculer vers une machine disponible.
hr_hr: Sistem "%hs" nije dostupan jer ne postoje potrebni ROM-ovi u mapu roms/machines. Prebacivanje na dostupno računalo.
hu_hu: A számítógép "%hs" nem elérhető a "roms/machines" mappából hiányzó ROM-képek miatt. Ehelyett egy másik gép kerül futtatásra.
it_it: La macchina "%hs" non è disponibile a causa di immagini ROM mancanti nella directory roms/machines. Cambiando ad una macchina disponibile.
ja_jp: roms/machines ディレクトリにROMがないため、マシン「%hs」は使用できません。使用可能なマシンに切り替えます。
pl_pl: Maszyna "%hs" nie jest dostępna, ponieważ brakuje obrazów ROM w katalogu roms/machines. Przełączanie na dostępną maszynę.
pt_br: A máquina "%hs" não está disponível devido à falta de ROMs no diretório roms/machines. Mudando para uma máquina disponível.
ru_ru: Системная плата "%hs" недоступна из-за отсутствия файла её ПЗУ в каталоге roms/machines. Переключение на доступную системную плату.
sk_sk: Počítač "%hs" ie je dostupný, pretože chýba obraz jeho pamäte ROM v zložke "roms/machines". Konfigurácia sa prepne na iný dostupný počítač.
sl_si: Sistem "%hs" ni na voljo zaradi manjkajočih ROM-ov v mapi roms/machines. Preklapljam na drug sistem, ki je na voljo.
tr_tr: "%hs" makinesi roms/machines klasöründe mevcut olmayan ROM imajı yüzünden mevcut değil. Mevcut olan bir makineye geçiş yapılıyor.
uk_ua: Системна плата "%hs" недоступна через відсутність файлу її ПЗУ в каталозі roms/machines. Переключення на доступну системну плату.
vi_vn: Mẫu máy "%hs" không giả lập được do thiếu file ROM tương ứng trong mục roms/machines. Hãy chọn mẫu máy khác.

source: Video card "%hs" is not available due to missing ROMs in the roms/video directory. Switching to an available video card.
ca_es: La targeta de vídeo "%hs" no està disponible perquè falten ROM al directori roms/video. Canvi a una targeta de vídeo disponible.
cs_cz: Video adaptér "%hs" není dostupný, jelikož chybí obraz jeho paměti ROM ve složce "roms/video". Konfigurace se přepne na jiný dostupný adaptér.
de_de: Die Videokarte "%hs" ist aufgrund von fehlenden ROMs im Verzeichnis roms/video nicht verfügbar. Es wird auf eine verfügbare Videokarte gewechselt.
es_es: La tarjeta de vídeo "%hs" no está disponible debido a ROMs faltantes en el directorio roms/machines. Cambiando a una tarjeta de vídeo disponible.
fi_fi: Näytönohjainta "%hs" ei voi käyttää puuttuvien ROM-tiedostojen vuoksi. Vaihdetaan käyttökelpoiseen näytönohjaimeen.
fr_fr: La carte vidéo "%hs" n'est pas disponible en raison de l'absence de ROMs dans le répertoire roms/video. Basculer vers une carte vidéo disponible.
hr_hr: Video kartica "%hs" nije dostupna jer ne postoje potrebni ROM-ovi u mapu roms/video. Prebacivanje na dostupnu video karticu.
hu_hu: A videokártya "%hs" nem elérhető a "roms/video" mappából hiányzó ROM-képek miatt. Ehelyett egy másik kártya kerül futtatásra.
it_it: La scheda video "%hs" non è disponibile a causa di immagini ROM mancanti nella directory roms/video. Cambiando ad una scheda video disponibile.
ja_jp: roms/video ディレクトリにROMがないため、ビデオ カード「%hs」は使用できません。使用可能なビデオカードに切り替えます。
pl_pl: Karta wideo "%hs" nie jest dostępna, ponieważ brakuje obrazów ROM w katalogu roms/video. Przełączanie na dostępną kartę wideo.
pt_br: A placa de vídeo "%hs" não está disponível devido à falta de ROMs no diretório roms/video. Mudando para uma placa de vídeo disponível.
ru_ru: Видеокарта "%hs" недоступна из-за отсутствия файла её ПЗУ в каталоге roms/video. Переключение на доступную видеокарту.
sk_sk: Video adaptér "%hs" nie je dostupný, pretože chýba obraz jeho pamäte ROM v zložke "roms/video". Konfigurácia sa prepne na iný dostupný adaptér.
sl_si: Grafična kartica "%hs" ni na voljo zaradi manjkajočih ROM-ov v mapi roms/video. Preklapljam na drugo grafično kartico, ki je na voljo..
tr_tr: "%hs" ekran kartı roms/video klasöründe mevcut olmayan ROM imajı yüzünden mevcut değil. Mevcut olan bir ekran kartına geçiş yapılıyor.
uk_ua: Відеокарта "%hs" недоступна через відсутність файлу її ПЗУ в каталозі roms/video. Переключення на доступну відеокарту.
vi_vn: Card đồ họa "%hs" không giả lập được do thiếu file ROM tương ứng trong mục roms/video. Hãy chọn card đồ họa khác.

source: Machine
ca_es: Màquina
cs_cz: Počítač
de_de: System
es_es: Máquina
fi_fi: Tietokone
hr_hr: Sistem
hu_hu: Számítógép
it_it: Piastra madre
ja_jp: マシン
pl_pl: Maszyna
pt_br: Máquina
ru_ru: Компьютер
sk_sk: Počítač
sl_si: Sistem
tr_tr: Makine
uk_ua: Комп'ютер
vi_vn: Mẫu máy

source: Display
ca_es: Vídeo
cs_cz: Obraz
de_de: Anzeige
es_es: Vídeo
fi_fi: Näyttö
fr_fr: Affichage
hr_hr: Video
hu_hu: Megjelenítő
it_it: Schermo
ja_jp: ディスプレイ
pl_pl: Ekran
pt_br: Vídeo
ru_ru: Дисплей
sk_sk: Obraz
sl_si: Zaslon
tr_tr: Görüntü
uk_ua: Дисплей
vi_vn: Hiển thị

source: Input devices
ca_es: Dispositius d'entrada
cs_cz: Vstupní zařízení
de_de: Eingabegeräte
es_es: Dispositivos de Entrada
fi_fi: Syöttölaitteet
fr_fr: Dispositifs d'entrée
hr_hr: Ulazni uređaji
hu_hu: Beviteli eszközök
it_it: Dispositivi di entrata
ja_jp: 入力デバイス
pl_pl: Urządzenia wejściowe
pt_br: Dispositivos de entrada
ru_ru: Устройства ввода
sk_sk: Vstupné zariadenie
sl_si: Vhodne naprave
tr_tr: Giriş aygıtları
uk_ua: Пристрій введення
vi_vn: Thiết bị nhập

source: Sound
ca_es: So
cs_cz: Zvuk
de_de: Multimedia
es_es: Sonido
fi_fi: Ääni
fr_fr: Son
hr_hr: Zvuk
hu_hu: Hang
it_it: Audio
ja_jp: サウンド
pl_pl: Dźwięk
pt_br: Som
ru_ru: Звук
sk_sk: Zvuk
sl_si: Zvok
tr_tr: Ses
uk_ua: Звук
vi_vn: Thanh âm
