Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: &Action
ca_es: &Acció
cs_cz: &Akce
de_de: &Aktionen
es_es: &Acción
fi_fi: &Toiminto
hr_hr: &Radnje
hu_hu: &Művelet
it_it: &Azione
ja_jp: 操作(&A)
pl_pl: &Akcje
pt_br: &Ação
ru_ru: &Действие
sk_sk: &Podujatia
sl_si: &Dejanja
tr_tr: &Komutlar
uk_ua: &Дія
vi_vn: &Thực hiện

source: &Keyboard requires capture
ca_es: &Teclat requereix captura
cs_cz: &Klávesnice vyžaduje záběr
de_de: &Tastatur benötigt das Einfangen des Mauszeigers
es_es: &Teclado requiere captura
fi_fi: &Vaadi näppäimistön kaappaus
fr_fr: &Capturer le clavier
hr_hr: &Tipkovnica zahtijeva hvatanje miša
hu_hu: A &billentyűzet elfogást igényel
it_it: &Tastiera richiede la cattura
ja_jp: キーボードはキャプチャが必要(&K)
pl_pl: &Klawaitura wymaga przechwytu myszy
pt_br: &Teclado requer captura
ru_ru: &Клавиатура требует захвата
sk_sk: &Klávesnica vyžaduje záber
sl_si: &Tipkovnica potrebuje zajem
tr_tr: &Klavye sadece fare yakalandığında çalışsın
uk_ua: &Клавіатура потребує захвату
vi_vn: Bàn phím &hoạt động cần capture chuột

source: &Right CTRL is left ALT
ca_es: CTRL &dret és ALT esquerre
cs_cz: &Pravý Ctrl je levý Alt
de_de: &Die rechte Strg-Taste ist die Linke Alt-Taste
es_es: CTRL &derecho es ALT izquierdo
fi_fi: &Oikea CTRL on vasen ALT
fr_fr: CTRL &Droite devient ALT Gauche
hr_hr: &Desni CTRL je lijevi ALT
hu_hu: A &jobb oldali CTRL a bal ALT
it_it: &CTRL destro è ALT sinistro
ja_jp: 右CTRLを左ALTへ変換(&R)
pl_pl: &Prawy CTRL to lewy Alt
pt_br: CTRL &direito é o ALT esquerdo
ru_ru: &Правый CTRL - это левый ALT
sk_sk: &Pravý Ctrl je ľavý Alt
sl_si: &Desni CTRL je levi ALT
tr_tr: &Sağ CTRL tuşunu sol ALT tuşu olarak ayarla
uk_ua: &Правий CTRL - це лівий ALT
vi_vn: Gắn CTRL p&hải vào ALT trái

source: &Hard Reset...
ca_es: &Reinicialització completa...
cs_cz: &Resetovat
fi_fi: &Uudelleenkäynnistys (kylmä)...
hr_hr: &Ponovno pokretanje...
hu_hu: Hardveres &újraindítás...
it_it: &Riavvia...
ja_jp: ハード リセット(&H)...
pl_pl: &Twardy reset...
pt_br: &Reinicialização completa...
ru_ru: &Холодная перезагрузка...
sk_sk: &Resetovať
sl_si: &Ponovni zagon...
tr_tr: &Makineyi yeniden başlat...
uk_ua: &Холодне перезавантаження...
vi_vn: Buộc khởi độn&g lại

source: &Pause
ca_es: &Pausa
cs_cz: P&ozastavit
es_es: &Pausa
fi_fi: &Tauko
hr_hr: &Pauza
hu_hu: &Szüneteltetés
it_it: &Pausa
ja_jp: 一時停止(&P)
pl_pl: &Pauza
pt_br: &Pausar
ru_ru: &Пауза
sk_sk: P&ozastaviť
sl_si: &Premor
tr_tr: &Duraklat
uk_ua: &Пауза
vi_vn: Tạm &dừng

source: E&xit...
ca_es: &Sortir...
cs_cz: &Ukončit
de_de: Be&enden...
es_es: &Salir...
fi_fi: &Poistu...
fr_fr: &Quitter...
hr_hr: Iz&laz...
hu_hu: &Kilépés...
it_it: E&sci...
ja_jp: 終了(&X)...
pl_pl: W&yjdź...
pt_br: &Sair...
ru_ru: &Выход...
sk_sk: &Ukončiť
sl_si: Iz&hod...
tr_tr: Emülatörden &çık...
uk_ua: &Вихід...
vi_vn: Th&oát...

source: &View
ca_es: &Vista
cs_cz: &Zobrazení
de_de: &Ansicht
es_es: &Vista
fi_fi: &Näytä
fr_fr: &Vue
hr_hr: &Pogled
hu_hu: &Nézet
it_it: &Visualizza
ja_jp: 表示(&V)
pl_pl: &Widok
pt_br: &Exibir
ru_ru: &Вид
sk_sk: &Zobrazenie
sl_si: &Pogled
tr_tr: &Görüntüleme
uk_ua: &Вигляд
vi_vn: &Xem

source: &Hide status bar
ca_es: &Amagar barra d'estat
cs_cz: &Schovat stavový řádek
de_de: &Statusleiste ausblenden
es_es: &Ocultar barra de estado
fi_fi: &Piilota tilapalkki
fr_fr: &Masquer la barre de status
hr_hr: &Sakrij statusni redak
hu_hu: Állapotsor &elrejtése
it_it: &Nascondi barra di stato
ja_jp: ステータス バーを隠す(&H)
pl_pl: &Ukryj pasek statusu
pt_br: &Ocultar barra de status
ru_ru: &Скрыть строку состояния
sk_sk: &Skryť stavový riadok
sl_si: &Skrij statusno vrstico
tr_tr: &Durum çubuğunu gizle
uk_ua: &Приховати рядок стану
vi_vn: Ẩn tha&nh trạng thái

source: Hide &toolbar
ca_es: Amagar &barra d'eines
cs_cz: Schovat panel &nástrojů
de_de: &Werkzeugleiste ausblenden
es_es: Ocultar &barra de herramientas
fi_fi: Piilota &työkalupalkki
hr_hr: &Sakrij alatni redak
ja_jp: ツール バーを隠す(&T)
pl_pl: Ukryj &pasek narzędzi
pt_br: Ocultar &barra de ferramenta
ru_ru: С&крыть панель инструментов
sk_sk: Skryť panel &nástrojov
uk_ua: &Приховати панель інструментів
vi_vn: Ẩn thanh &công cụ

source: Show non-primary monitors
ru_ru: &Показывать неосновные мониторы

source: &Resizeable window
ca_es: &Finestra redimensionable
cs_cz: &Měnitelná velikost okna
de_de: &Größenverstellbares Fenster
es_es: &Ventana redimensionable
fi_fi: &Salli koon muuttaminen
fr_fr: Fenètre &Retaillable
hr_hr: &Prozor s promjenjivim veličinama
hu_hu: &Átméretezhető ablak
it_it: &Finestra ridimensionabile
ja_jp: ウィンドウのサイズを変更可能(&R)
pl_pl: &Okno o zmiennym rozmiarze
pt_br: &Janela redimensionável
ru_ru: &Изменяемый размер окна
sk_sk: &Premenná veľkosť okna
sl_si: S&premenljiva velikost okna
tr_tr: &Yeniden boyutlandırılabilir pencere
uk_ua: &Змінний розмір вікна
vi_vn: Tùy chỉnh cỡ cử&a sổ

source: R&emember size && position
ca_es: &Recordar mida i posició
cs_cz: &Pamatovat velikost a pozici
de_de: &Größe && Position merken
es_es: &Recordar tamaño y posición
fi_fi: &Muista koko ja sijainti
fr_fr: S&auvegarder taille && position
hr_hr: &Zapamtite veličinu i položaj
hu_hu: Méret és pozíció &megjegyzése
it_it: R&icorda dimensioni e posizione
ja_jp: ウィンドウのサイズと位置を保存(&E)
pl_pl: P&amiętaj rozmiar &i pozycję
pt_br: &Lembrar tamanho e posição
ru_ru: &Запомнить размер и положение
sk_sk: &Pamätať si veľkosť a polohu
sl_si: &Zapomni si velikost in položaj
tr_tr: &Pencere boyut ve pozisyonunu hatırla
uk_ua: &Запам'ятати розмір і становище
vi_vn: Ghi nhớ vị trí và kíc&h thước cửa sổ

source: Re&nderer
ca_es: Re&nderitzador
es_es: Re&nderizador
fi_fi: &Renderöijä
fr_fr: Moteur de &rendu vidéo
hu_hu: &Megjelenítő
ja_jp: レンダラー(&N)
pt_br: &Renderizador
ru_ru: &Рендеринг
sl_si: &Upodabljanje
tr_tr: &İşleyici
uk_ua: &Рендеринг

source: Open&GL (3.0 Core)
de_de: Open&GL (3.0-Kern)
hr_hr: Open&GL (3.0 jezgra)
ja_jp: OpenGL (3.0 Core)(&G)
pt_br: Open&GL (Núcleo 3.0)
ru_ru: Open&GL (3.0)
sl_si: Open&GL (Jedro 3.0)
uk_ua: Open&GL (3.0)

source: Renderer options...
ru_ru: Параметры рендеринга...

source: OpenGL 3.0 renderer options
ru_ru: Параметры рендеринга OpenGL 3.0

source: Render behavior
ru_ru: Режим рендеринга

source: Synchronize with video
ru_ru: Синхронизировать с видео

source: Use target framerate:
ru_ru: Использовать целевую частоту кадров:

source: VSync
ru_ru: Вертикальная синхронизация

source: Shaders
ru_ru: Шейдеры

source: No shader selected
ru_ru: Шейдер не выбран

source: Specify dimensions...
ca_es: E&specificar dimensions...
cs_cz: &Zadat velikost...
de_de: Fenstergröße einstellen...
es_es: E&specificar dimensiones...
fi_fi: &Määritä koko...
fr_fr: Specifier dimensions...
hr_hr: Odrediti veličinu...
hu_hu: Méretek kézi megadása...
it_it: Specifica dimensioni...
ja_jp: ディメンションを指定...
pl_pl: Określ rozmiary...
pt_br: Especificar as dimensões...
ru_ru: &Указать размеры главного окна...
sk_sk: &Zadať veľkosť...
sl_si: &Določi velikost...
tr_tr: Pencere &boyutunu belirle...
uk_ua: &Вказати розміри...
vi_vn: Tự nhập độ &phân giải...

source: F&orce 4:3 display ratio
ca_es: F&orçar ràtio 4:3
cs_cz: &Dodržovat poměr stran 4:3
de_de: &4:3-Seitenverhältnis erzwingen
es_es: F&orzar ratio 4:3
fi_fi: Pakota 4:3-näyttösuhde
fr_fr: F&orcer 4:3
hr_hr: &4:3 omjer prikaza
hu_hu: &Rögzített 4:3 képarány
it_it: F&orza display 4:3
ja_jp: 4:3の縦横比を強制表示(&O)
pl_pl: &Wymuś proporcje wyświetlania 4:3
pt_br: F&orçar proporção de tela em 4:3
ru_ru: У&становить соотношение сторон 4:3
sk_sk: &Zachovať pomer strán 4:3
sl_si: &Vsili 4:3 razmerje zaslona
tr_tr: &4:3 görüntüleme oranına zorla
uk_ua: &Встановити відношення сторін 4:3
vi_vn: Giữ n&guyên khung hình 4:3

source: &Window scale factor
ca_es: &Factor d'escalat de finestra
cs_cz: &Násobek zvětšení okna
de_de: &Fensterskalierungsfaktor
es_es: &Factor de escalado de ventana
fi_fi: &Ikkunan kokokerroin
fr_fr: &Echelle facteur
hr_hr: &Faktor skaliranja prozora
hu_hu: &Ablak méretezési tényező
it_it: &Fattore scalare della finestra
ja_jp: ウィンドウの表示倍率(&W)
pl_pl: &Czynnik skalowania okna
pt_br: &Fator de redimensionamento da janela
ru_ru: &Масштаб окна
sk_sk: &Násobné zväčšenie okna
sl_si: &Faktor velikosti okna
tr_tr: Pencere &ölçek çarpanı
uk_ua: &Масштаб вікна
vi_vn: Đổi &tỷ lệ cửa sổ

source: Filter method
ca_es: &Mètode de filtrat
cs_cz: Metoda &filtrování
de_de: Filteringmethode
es_es: &Método de filtrado
fi_fi: &Suodatusmetodi
fr_fr: Methode Filtre
hr_hr: Metoda filtriranja
hu_hu: Szűrési mód
it_it: Metodo filtro
ja_jp: フィルター方式
pl_pl: Metoda filtrowania
pt_br: Método de filtragem
ru_ru: Метод фильтрации
sk_sk: Spôsob &filtrovania
sl_si: &Metoda filtriranja
tr_tr: &Filtre metodu
uk_ua: Метод фільтрації
vi_vn: &Bộ lọc hình ảnh

source: &Nearest
ca_es: &Més proper
cs_cz: &Nejbližší
de_de: &Nächst
es_es: &Más cercano
fi_fi: &Lähin naapuri
fr_fr: &Plus proche
hr_hr: &Najbliža
hu_hu: &Szomszédos
it_it: &Dal più vicino
ja_jp: 最近傍補間(&N)
pt_br: &Mais próximo
ru_ru: &Ближайший
sk_sk: &Najbližší
sl_si: &Najbližja
tr_tr: &Nearest (En yakın)
uk_ua: &Найближчий
vi_vn: &Cực cận

source: &Linear
ca_es: &Lineal
cs_cz: &Lineární
es_es: &Lineal
fi_fi: Li&neaarinen interpolaatio
fr_fr: &Lineaire
hr_hr: &Linearna
hu_hu: &Lineáris
it_it: &Lineare
ja_jp: 線形補間(&L)
ru_ru: &Линейный
sk_sk: &Lineárny
sl_si: &Linearna
tr_tr: &Linear (Doğrusal)
uk_ua: &Лінійний
vi_vn: Tu&yến tính

source: Hi&DPI scaling
ca_es: &Escalat alta densitat
cs_cz: Š&kálování HiDPI
de_de: Hi&DPI-Skalierung
es_es: &Escalado alta densidad
fi_fi: &Suuri DPI-skaalaus
fr_fr: Mise à l'échelle Hi&DPI
hr_hr: &HiDPI skaliranje
hu_hu: Hi&DPI méretezés
it_it: Scala Hi&DPI
ja_jp: HiDPIスケーリング(&D)
pl_pl: Skalowanie Hi&DPI
pt_br: Escala Hi&DPI
ru_ru: Масштабирование Hi&DPI
sk_sk: Š&kálovanie HiDPI
sl_si: &Raztezanje za visok DPI
tr_tr: Hi&DPI ölçeklemesi
uk_ua: Масштабування Hi&DPI
vi_vn: Tỷ lệ hinh ảnh phân giải cao

source: &Fullscreen Ctrl+Alt+PgUp
ca_es: &Pantalla completa Ctrl+Alt+PgUp
cs_cz: &Celá obrazovka Ctrl+Alt+PgUp
de_de: &Vollbild Strg+Alt+Bild auf
es_es: &Pantalla completa Ctrl+Alt+PgUp
fi_fi: &Koko näytön tila Ctrl+Alt+PgUp
fr_fr: &Plein Ecran Ctrl+Alt+PgUp
hr_hr: &Cijelozaslonski način Ctrl+Alt+PgUp
hu_hu: &Teljes képernyő Ctrl+Alt+PgUp
it_it: &Schermo intero Ctrl+Alt+PgUp
ja_jp: 全画面表示(&F) Ctrl+Alt+PgUp
pl_pl: &Pełny ekran Ctrl+Alt+PgUp
pt_br: &Tela cheia Ctrl+Alt+PgUp
ru_ru: &Полноэкранный режим Ctrl+Alt+PgUp
sk_sk: &Celá obrazovka Ctrl+Alt+PgUp
sl_si: &Celozaslonski način Ctrl+Alt+PgUp
tr_tr: &Tam ekran Ctrl+Alt+PgUp
uk_ua: &Повноекранний режим Ctrl+Alt+PgUp
vi_vn: Toàn màn &hình Ctrl+Alt+PgUp

source: Fullscreen &stretch mode
ca_es: Escalat pantalla completa
cs_cz: Režím roztá&hnutí při celé obrazovce
de_de: &Stretching-Modus im Vollbildmodus
es_es: Escalado pantalla completa
fi_fi: Koko näytön &skaalaustila
fr_fr: Mode &Elargi plein écran
hr_hr: &Način cijelozaslonskog rastezanja
hu_hu: Teljes képernyős &méretezés
it_it: Modalità adattamento &schermo intero
ja_jp: 全画面の拡大表示モード(&S)
pt_br: Modo de &redimensionamento da tela cheia
ru_ru: &Растягивание в полноэкранном режиме
sk_sk: Režim roztia&hnutia na celú obrazovku
sl_si: &Način celozaslonskega raztezanja
tr_tr: Tam ekran &germe modu
uk_ua: &Розстягування у повноекранному режимі
vi_vn: &Chế độ kéo giãn hình

source: &Full screen stretch
ca_es: &Estirar
cs_cz: &Roztáhnout
de_de: &Vollbild-Stretching
es_es: &Estirar
fi_fi: &Venytä koko näyttöön
fr_fr: &Plein écran étiré
hr_hr: &Razvuci na cijeli zaslona
hu_hu: &Nyújtás a teljes képernyőre
it_it: &Adatta a schermo intero
ja_jp: 全画面の拡大表示(&F)
pl_pl: &Tryb rozciągania na pełnym ekranie
pt_br: &Tela cheia esticada
ru_ru: &На весь экран
sk_sk: &Rozšíriť
sl_si: &Raztegni na celoten zaslon
tr_tr: &Tam ekrana ger
uk_ua: &На весь екран
vi_vn: Kéo giãn hình

source: &Square pixels (Keep ratio)
ca_es: &Píxels quadrats (Mant. aspecte)
cs_cz: &Zachovat poměr stran
de_de: &Quadratische Pixel (Seitenverhältnis beibehalten)
es_es: &Píxeles cuadrados (Mant. aspecto)
fi_fi: &Tasasivuiset kuvapisteet (säilytä kuvasuhde)
fr_fr: pixels &Carrés(Keep ratio)
hr_hr: &Kvadratni pikseli (zadrži omjer)
hu_hu: &Négyzetes képpontok (aránytartás)
it_it: &Pixel quadrati (mantiene l'aspetto)
ja_jp: 正方形ピクセル(アスペクト比を維持)(&S)
pl_pl: &Kwadratowe piksele (Zachowaj proporcje)
pt_br: Pixel&s quadrados (manter proporção)
ru_ru: &Квадратные пиксели (сохранить соотношение)
sk_sk: &Zachovať pomer strán
sl_si: &Kvadratni piksli (ohrani razmerje)
tr_tr: &Kare piksel (ölçeği koru)
uk_ua: &Квадратні пікселі (зберегти відношення)
vi_vn: Điểm ảnh vuông (giữ tỷ lệ)

source: &Integer scale
ca_es: &Escala de valor enter
cs_cz: &Celočíselné škálování
de_de: &Integer-Skalierung
es_es: &Escalado valor entero
fi_fi: &Kokonaislukuskaalaus
fr_fr: Echelle &Entière
hr_hr: &Cijelobrojno skaliranje
hu_hu: &Egész tényezős nagyítás
it_it: &Scala intera
ja_jp: 整数倍(&I)
pl_pl: &Skalowanie całkowite
pt_br: &Redimensionamento com valores inteiros
ru_ru: &Целочисленное масштабирование
sk_sk: &Celočíselné škálovanie
sl_si: &Celoštevilsko raztezanje
tr_tr: Tam &sayı ölçeklemesi
uk_ua: &Цілісночисленне масштабування
vi_vn: Căn tỷ lệ số nguyên

source: 4:&3 Integer scale
ca_es: Escala de valor enter 4:&3
cs_cz: 4:&3 Celočíselné škálování
de_de: 4:&3 Integer-Skalierung
es_es: Escalado valor entero 4:&3
fi_fi: 4:&3 Kokonaislukuskaalaus
fr_fr: Echelle Entière 4:&3
hr_hr: 4:&3 Cijelobrojno skaliranje
hu_hu: 4:&3 Egész tényezős nagyítás
it_it: Scala intera 4:&3
ja_jp: 4:3 整数倍(&3)
pl_pl: Skalowanie całkowite 4:&3
pt_br: Redimensionamento com valores inteiros 4:&3
ru_ru: 4:&3 Целочисленное масштабирование
sk_sk: 4:&3 Celočíselné škálovanie
sl_si: Celoštevilsko raztezanje 4:&3
tr_tr: 4:&3 Tam sayı ölçeklemesi
uk_ua: Цілісночисленне масштабування 4:&3
vi_vn: Căn tỷ lệ 4:3 số nguyên

source: Apply fullscreen stretch mode when maximized
ru_ru: Применить полноэкранный режим растяжения при разворачивании окна

source: E&GA/(S)VGA settings
ca_es: &Ajustaments EGA/(S)VGA
cs_cz: Nastavení pro E&GA a (S)VGA
de_de: E&GA/(S)VGA-Einstellungen
es_es: &Configuraciones EGA/(S)VGA
fi_fi: &EGA/(S)VGA-asetukset
fr_fr: Réglages E&GA/(S)VGA
hr_hr: E&GA/(S)VGA postavke
hu_hu: E&GA/(S)VGA beállítások
it_it: Impostazioni E&GA/(S)VGA
ja_jp: E&GA/(S)VGAの設定
pl_pl: Ustawienia E&GA/(S)VGA
pt_br: Configurações E&GA/(S)VGA
ru_ru: Настройки E&GA/(S)VGA
sk_sk: Nastavenia pre E&GA a (S)VGA
sl_si: Nastavitve E&GA/(S)VGA
tr_tr: EGA/&(S)VGA ayarları
uk_ua: Налаштування E&GA/(S)VGA
vi_vn: Cài đặt EGA/(S)VGA

source: &Inverted VGA monitor
ca_es: &Monitor VGA invertit
cs_cz: &Převrátit barvy
de_de: &Invertierte VGA-Anzeige
es_es: &Monitor VGA invertido
fi_fi: &VGA-näyttö käänteisillä väreillä
fr_fr: Moniteur VGA &Inversé
hr_hr: &Obrni boje zaslona VGA
hu_hu: &Invertált VGA kijelző
it_it: &Invertire monitor VGA
ja_jp: 色反転(&I)
pl_pl: &Odwrócony monitor VGA
pt_br: Monitor VGA &invertido
ru_ru: &Инвертировать цвета VGA
sk_sk: &Obrátiť farby
sl_si: &Obrni barve zaslona VGA
tr_tr: Ters &renk VGA monitör
uk_ua: &Інвертувати кольори VGA
vi_vn: Đảo mà&u VGA

source: VGA screen &type
ca_es: &Tipus de pantalla VGA
cs_cz: &Typ VGA monitoru
de_de: &VGA-Bildschirmtyp
es_es: &Tipo de pantalla VGA
fi_fi: VGA-näytön &tyyppi
fr_fr: &Type Ecran VGA
hr_hr: &Tip zaslona VGA
hu_hu: VGA képernyő &típusa
it_it: Schermi VGA &
ja_jp: 画面タイプ(&T)
pl_pl: Rodzaj ekranu &VGA
pt_br: &Tipo de tela VGA
ru_ru: &Тип экрана VGA
sk_sk: &Typ monitora VGA
sl_si: &Vrsta zaslona VGA
tr_tr: VGA ekran &tipi
uk_ua: &Тип екрана VGA
vi_vn: L&oại màn VGA

source: RGB &Color
cs_cz: RGB &barevný
de_de: &RGB-Farbe
fi_fi: RGB, &värit
fr_fr: RGB &Couleur
hr_hr: RGB u &boji
hu_hu: RGB &színes
ja_jp: RGB(カラー)(&C)
pl_pl: RGB - &Kolorowy
pt_br: &Cores RGB
ru_ru: RGB &цветной
sk_sk: RGB &farebný
sl_si: &Barvni RGB
tr_tr: RGB (&renkli)
uk_ua: RGB &кольоровий
vi_vn: Màu R&GB

source: &RGB Grayscale
ca_es: RGB &Grisos
cs_cz: &Odstíny šedi
de_de: &RGB-Graustufen
es_es: RGB &Grises
fi_fi: &RGB, harmaasävy
fr_fr: &RGB Ton de Gris
hr_hr: &RGB u nijansama sive boje
hu_hu: &RGB szürkeárnyalatos
it_it: &RGB Monocroma
ja_jp: RGB(グレースケール)(&R)
pl_pl: &RGB - Skala szarości
pt_br: Tons de cinza &RGB
ru_ru: &RGB монохромный
sk_sk: &Odtiene sivej
sl_si: &Sivinski RGB
tr_tr: RGB (&gri tonlama)
uk_ua: &RGB монохромний
vi_vn: Thang xám RG&B

source: &Amber monitor
ca_es: Monitor & Ambre
cs_cz: &Jantarová obrazovka
de_de: &Bernstein-Monitor
es_es: Monitor &Ámbar
fi_fi: &Meripihkanvärinen
fr_fr: Moniteur &Ambre
hr_hr: &Jantarni zaslon
hu_hu: &Gyömbér kijelző
it_it: &Monitor ambra
ja_jp: モニター(黄色)(&A)
pl_pl: &Bursztynowy monitor
pt_br: Monitor &âmbar
ru_ru: &Янтарный оттенок
sk_sk: &Jantárová obrazovka
sl_si: &Rumeni zaslon
tr_tr: &Kehribar rengi monitör
uk_ua: &Бурштиновий відтінок
vi_vn: Màn hình vàng hổ phách (amber)

source: &Green monitor
ca_es: Monitor &Verd
cs_cz: &Zelená obrazovka
de_de: &Grüner Monitor
es_es: Monitor &Verde
fi_fi: V&ihreä
fr_fr: Moniteur &Vert
hr_hr: &Zeleni zaslon
hu_hu: &Zöld kijelző
it_it: &Monitor verde
ja_jp: モニター(緑色)(&G)
pl_pl: &Zielony monitor
pt_br: Monitor &verde
ru_ru: &Зелёный оттенок
sk_sk: &Zelená obrazovka
sl_si: &Zeleni zaslon
tr_tr: &Yeşil renk monitör
uk_ua: &Зелений відтінок
vi_vn: Màn hình lục

source: &White monitor
ca_es: Monitor &Blanc
cs_cz: &Bílá obrazovka
de_de: &Weißer Monitor
es_es: Monitor &Blanco
fi_fi: V&alkoinen
fr_fr: Moniteur &Blanc
hr_hr: &Bijeli zaslon
hu_hu: &Fehér kijelző
it_it: &Monitor bianco
ja_jp: モニター(白色)(&W)
pl_pl: &Biały monitor
pt_br: Monitor &branco
ru_ru: &Белый оттенок
sk_sk: &Biela obrazovka
sl_si: B&eli zaslon
tr_tr: &Beyaz renk monitör
uk_ua: &Білий відтінок
vi_vn: Màn hinh trắng

source: Grayscale &conversion type
ca_es: &Conversió a grisos
cs_cz: Převod na &odstíny šedi
de_de: Methode zur &Graustufenkonversion
es_es: &Conversión a grises
fi_fi: &Harmaasävymuunnoksen tyyppi
hr_hr: &Vrsta konverzije nijansa sive boje
hu_hu: Szürkéskála &konzerziós eljárás
it_it: Conversione &scala grigia
ja_jp: グレースケール変換タイプ(&C)
pl_pl: Typ konwersji &w skali szarości
pt_br: Tipo de &conversão de tons de cinza
ru_ru: Тип монохромного &конвертирования
sk_sk: Konverzia na &odtiene sivej
sl_si: V&rsta pretvorbe sivin
tr_tr: &Gri tonlama dönüştürme tipi
uk_ua: Тип монохромного &конвертування
vi_vn: Chuyển đổi thang &màu xám

source: &Average
ca_es: &Mitjana
cs_cz: &Průměr
de_de: &Durchschnittsmethode
es_es: &Media
fi_fi: &Keskiarvo
fr_fr: &Moyenne
hr_hr: &Prosjek
hu_hu: &Átlag szerint
it_it: &AMedia
ja_jp: 平均(&A)
pl_pl: &Średni
pt_br: &Média
ru_ru: &Усреднённый
sk_sk: &Priemer
sl_si: &Povprečje
tr_tr: &Ortalama
uk_ua: &Усереднений
vi_vn: &Trung bình

source: CGA/PCjr/Tandy/E&GA/(S)VGA overscan
ca_es: &Overscan CGA/PCjr/Tandy/EGA/(S)VGA
cs_cz: Přesah obrazu CGA/PCjr/Tandy/E&GA/(S)VGA
de_de: Overscan für CGA/PCjr/Tandy/E&GA/(S)VGA-Displays
es_es: &Overscan CGA/PCjr/Tandy/EGA/(S)VGA
fi_fi: CGA/PCjr/Tandy/E&GA/(S)VGA &yliskannaus
hr_hr: &Višak slike CGA/PCjr/Tandy/EGA/(S)VGA
hu_hu: CGA/PCjr/Tandy/E&GA/(S)VGA túlpásztázás
it_it: Sovrascansione CGA/PCjr/Tandy/E&GA/(S)VGA
ja_jp: CGA/PCjr/Tandy/EGA/(S)VGAオーバースキャン(&G)
pl_pl: Overscan dla CGA/PCjr/Tandy/E&GA/(S)VGA
pt_br: Overscan do CGA/PCjr/Tandy/E&GA/(S)VGA
ru_ru: Вылеты развёртки CGA/PCjr/Tandy/E&GA/(S)VGA
sk_sk: Prekrytie obrazu CGA/PCjr/Tandy/E&GA/(S)VGA
sl_si: &Presežek slike CGA/PCjr/Tandy/EGA/(S)VGA
tr_tr: CGA/PCjr/Tandy/E&GA/(S)VGA aşırı taraması
uk_ua: Вильоти розгортки CGA/PCjr/Tandy/E&GA/(S)VGA
vi_vn: &Overscan CGA/PCjr/Tandy/EGA/(S)VGA

source: Change contrast for &monochrome display
ca_es: Canviar contrast per a pantalla &monocroma
cs_cz: &Upravit kontrast černobílé obrazovky
de_de: Kontrast für &monochrome Displays ändern
es_es: Cambiar contraste para pantalla &monocroma
fi_fi: &Muuta harmaavärinäytön kontrastia
fr_fr: Modifier contraste affichage &monochrome
hr_hr: &Promjeni kontrast za crno-bijeli zaslon
hu_hu: Kontraszt illesztése &monokróm kijelzőhöz
it_it: Cambia il contrasto per &display monocromatici
ja_jp: 単色モニター用コントラストを変更(&M)
pl_pl: Zmień kontrast dla &monochromatycznego ekranu
pt_br: Alterar contraste para exibição &monocromática
ru_ru: Изменить контрастность &монохромного дисплея
sk_sk: &Úprava kontrastu čiernobielej obrazovky
sl_si: &Spremeni contrast za črno-beli zaslon
tr_tr: Gri to&nlamalı görüntü için kontrastı değiştir
uk_ua: Змінити контрастність &монохромного дисплея
vi_vn: Chỉnh tương phản cho màn hình đơn sắc

source: &Media
ca_es: &Mitjans
cs_cz: &Média
de_de: &Medien
es_es: &Medios
hr_hr: &Mediji
hu_hu: &Média
it_it: &Dispositivi
ja_jp: メディア(&M)
pl_pl: &Nośnik
pt_br: &Mídia
ru_ru: &Носители
sk_sk: &Média
sl_si: &Mediji
tr_tr: &Medya
uk_ua: &Носії
vi_vn: &Phương tiện

source: &Tools
ca_es: &Eines
cs_cz: &Nástroje
de_de: &Werkzeuge
es_es: &Herramientas
fi_fi: Työ&kalut
fr_fr: Ou&tils
hr_hr: &Alati
hu_hu: &Eszközök
it_it: &Strumenti
ja_jp: ツール(&T)
pl_pl: &Narzędzia
pt_br: &Ferramentas
ru_ru: &Инструменты
sk_sk: &Nástroje
sl_si: &Orodja
tr_tr: &Araçlar
uk_ua: &Інструменти
vi_vn: &Công cụ

source: &Settings...
ca_es: &Ajustaments...
cs_cz: &Nastavení...
de_de: &Optionen...
es_es: &Configuraciones...
fi_fi: &Kokoonpano...
fr_fr: &Réglages...
hr_hr: &Opcije...
hu_hu: &Konfigurálás...
it_it: &Impostazioni...
ja_jp: 設定(&S)...
pl_pl: &Ustawienia...
pt_br: &Configurações...
ru_ru: &Настройки машины...
sk_sk: &Nastavenia...
sl_si: &Nastavitve...
tr_tr: &Ayarlar...
uk_ua: &Налаштування машини...
vi_vn: &Cài đặt...

source: &Update status bar icons
ca_es: &Actualitzar icones a la barra d'estat
cs_cz: &Aktualizovat ikony stavového řádku
de_de: &Statusleistenicons aktualisieren
es_es: &Actualizar iconos en barra de estado
fi_fi: &Päivitä tilapalkin kuvakkeita
fr_fr: Mettre à jour la barre de stat&us
hr_hr: &Ažuriraj ikone statusnog redka
hu_hu: Állapotsori ikonok &frissítése
it_it: &Aggiorna icone della barra di stato
ja_jp: ステータスバーのアイコンを更新(&U)
pl_pl: &Aktualizuj ikony na pasku statusu
pt_br: &Atualizar ícones da barra de status
ru_ru: &Обновление значков строки состояния
sk_sk: &Aktualizovať ikony na stavovom riadku
sl_si: &Posodabljaj ikone statusne vrstice
tr_tr: Durum &çubuğu ikonlarını güncelle
uk_ua: &Обновлення значків рядка стану
vi_vn: Cậ&p nhật biểu tượng thanh trạng thái

source: Take s&creenshot Ctrl+F11
ca_es: Prendre c&aptura Ctrl+F11
cs_cz: Pořídit &screenshot Ctrl+F11
de_de: S&creenshot aufnehmen Strg+F11
es_es: Tomar c&aptura Ctrl+F11
fi_fi: Ota &kuvakaappaus Ctrl+F11
fr_fr: Copie &Ecran Ctrl+F11
hr_hr: Napravi &snimku zaslona Ctrl+F11
hu_hu: &Képernyőkép készítése Ctrl+F11
it_it: Cattura schermata Ctrl+F11
ja_jp: スクリーンショットを撮る(&C) Ctrl+F11
pl_pl: Zrób &zrzut ekranu Ctrl+F11
pt_br: Capturar &tela Ctrl+F11
ru_ru: Сделать с&криншот Ctrl+F11
sk_sk: Urobiť snímku &obrazovky Ctrl+F11
sl_si: &Zajemi posnetek zaslona Ctrl+F11
tr_tr: &Ekran görüntüsü al Ctrl+F11
uk_ua: Зробити &знімок Ctrl+F11
vi_vn: Chụp &màn hình Ctrl+F11

source: &Preferences...
ca_es: &Preferències...
cs_cz: &Předvolby...
de_de: &Einstellungen...
es_es: &Preferencias...
fi_fi: &Sovellusasetukset...
fr_fr: &Préférences...
hr_hr: &Postavke...
hu_hu: &Beállítások...
it_it: &Preferenze...
ja_jp: 環境設定(&P)...
pl_pl: &Preferencje...
pt_br: &Preferências...
ru_ru: &Параметры...
sk_sk: &Predvoľby...
sl_si: &Možnosti...
tr_tr: &Tercihler...
uk_ua: &Параметри...
vi_vn: &Tùy biến...

source: Enable &Discord integration
ca_es: Habilita la integració amb el &Discord
cs_cz: Povolit integraci s &Discordem
de_de: &Discord-Integration aktivieren
es_es: Habilitar integración con &Discord
fi_fi: Käytä &Discord-integraatiota
fr_fr: Activer intégration &Discord
hr_hr: Omogući integraciju sa programom &Discord
hu_hu: &Discord integráció engedélyezése
it_it: Abilita &integrazione Discord
ja_jp: Discord連携機能(&D)
pl_pl: Włącz integrację z &Discord
pt_br: Ativar integração com o &Discord
ru_ru: Включить интеграцию &Discord
sk_sk: Povolenie integrácie s &Discordem
sl_si: Omogoči integracijo s programom &Discord
tr_tr: &Discord entegrasyonunu etkinleştir
uk_ua: Увімкнути інтеграцію &Discord
vi_vn: Bật trình trạng thái cho Discord
