Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: CPU type filtering based on selected machine is disabled for this emulated machine. This makes it possible to choose a CPU that is otherwise incompatible with the selected machine. However, you may run into incompatibilities with the machine BIOS or other software. Enabling this setting is not officially supported and any bug reports filed may be closed as invalid.
ca_es: El Filtratge de tipus de CPU basat en màquina seleccionada està deshabilitat per a aquesta màquina. Això fa possible seleccionar una CPU que sigui incompatible amb aquesta màquina. Per això, poden aparèixer incompatibilitat amb la BIOS de la màquina o un altre programari. Activar aquest ajustament no està oficialment suportat i qualsevol informe de fallada pot ser tancat com a invàlid.
cs_cz: Pro tuto konfiguraci bylo vypnuto filtrování procesorů podle zvoleného počítače. Toto umožňuje zvolit procesor, který by jinak se zvoleným počítačem nebyl kompatibilní. Můžou však nastat potíže s BIOSem nebo jiným softwarem. Povolení tohoto nastavení není oficiálně podporováno a jakákoliv hlášení o chybách mohou být uzavřeny jako neplatné.
de_de: Das Filtern der CPU-Typen basierend auf dem ausgewählten System ist für dieses System deaktiviert. Dies ermöglicht es, dass man eine sonst nicht mit dem ausgewählten System inkompatible CPU auswählen kann. Allerdings kann dies zu Inkompatiblilitäten mit dem BIOS des Systems oder anderen Programmen kommen. Das Aktivieren dieser Einstellung wird nicht unterstützt und sämtliche Bugreports können als "invalid" geschlossen werden.
es_es: El Filtrado de tipo de CPU basado en máquina seleccionada está deshabilitado para la esta máquina. Esto hace posible seleccionar una CPU que sea incompatible con esta máquina. Por ello, pueden aparecer incompatibilidader con la BIOS de la máquina u otro software. Activar esta configuración no está oficialmente soportado y cualquier reporte de fallo puede ser cerrado como inválido.
fi_fi: Valittuun tietokoneeseen perustuva suoritintyypin suodatus ei ole käytössä tällä emuloidulla koneella. Tämä mahdollistaa muutoin yhteensopimattoman suorittimen valinnan kyseisen tietokoneen kanssa. Voit kuitenkin kohdata ongelmia tietokoneen BIOS:in tai muun ohjelmiston kanssa. Tämän asetuksen käyttö ei ole virallisesti tuettua ja kaikki tehdyt virheraportit voidaan sulkea epäpätevinä.
fr_fr: La filtrage du type du processeur sur la base de la machine sélectionné est désactivé pur cette machine émulée. Cela permet de sélectionner une processeur que est sinon incompatible avec la machine sélectionné. Cependant, il pourrait y avoir des incompatibilités avec le BIOS de la machine ou autres logiciels. L'activatione de cette configuration non est officiellement prise en charge et tout rapport de bogue peut être fermé comme étant invalide.
hr_hr: Filtriranje tipa CPU-a na temelju odabranog sistema onemogućeno je za ovaj emulirani sistem. Ovo omogućuje odabir procesora koji inače nisu kompatibilne s odabranog sistem. Međutim, možete naići na na nekompatibilnosti s BIOS-om sustava ili drugim softverom. Omogućavanje ove postavke nije službeno podržano i sva prijava o greškama mogu biti zatvorena kao "invalid".
hu_hu: A kiválasztott gépen alapuló CPU-típusszűrés le van tiltva ezen az emulált gépen. Ez lehetővé teszi olyan CPU kiválasztását, amely egyébként nem kompatibilis a kiválasztott géppel. Előfordulhat azonban, hogy nem kompatibilis a gép BIOS-ával vagy más szoftverekkel. A beállítás engedélyezése hivatalosan nem támogatott, és a benyújtott hibajelentéseket érvénytelenként lezárhatjuk.
it_it: Il filtraggio della tipologia di CPU è disabilitato per la macchina selezionata. Questo lo rende possibile scegliere un CPU che è altrimenti incompatibile con la macchina selezionata. Tuttavia, portresti incorrere in incompatibilità con il BIOS della macchina o altri programmi. L'abilitare di questa impostazione non è ufficialmente supportato e tutte le segnalazioni di errori saranno considerate invalide.
ja_jp: 選択したマシンに基づくCPUタイプのフィルター機能は、使用中のマシンでは無効になっています。 これにより、選択したマシンと互換性のないCPUが選択できます。しかし、マシンのBIOSや他のソフトウェアと互換性がない場合があります。 この設定を有効にすることは公式にはサポートされておらず、バグレポートは無効として中止される可能性があります。
pl_pl: Wybór rodzaju procesora oparty na wybranej maszynie jest wyłączony dla tej emulowanej maszyny. Pozwala to na wybór procesora który jest niekompatybilny z wybraną maszyną. Jednak możesz napotkać niezgodności z BIOS-em maszyny lub innym oprogramowaniem. Aktywacja tego ustawienia nie jest wspierana i każde zgłoszenie błędu może zostać zamknięte jako nieważne.
pt_br: A filtragem do tipo CPU baseada na máquina selecionada é desativada para esta máquina emulada. Isto torna possível escolher uma CPU que de outra forma seria incompatível com a máquina selecionada. Entretanto, você pode encontrar incompatibilidades com a BIOS da máquina ou outro software. A ativação desta configuração não é oficialmente suportada e qualquer relatório de erro arquivado pode ser fechado como inválido.
ru_ru: Выбор типов ЦП для этой системной платы на данной эмулируемой машине отключен. Это позволяет выбрать процессор, который в противном случае несовместим с выбранной материнской платой. Однако, вы можете столкнуться с несовместимостью с BIOS материнской платы или другим ПО. Включение этого параметра официально не поддерживается, и все поданные отчеты об ошибках могут быть закрыты как недействительные.
sk_sk: Pre túto konfiguráciu bolo vypnuté filtrovanie procesorov podľa zvoleného počítača. Toto umožňuje zvoliť procesor, ktorý by inak so zvoleným počítačom nebol kompatibilný. Môžu však nastať problémy s BIOSom alebo iným softvérom. Povolenie tohto nastavenia nie je oficiálne podporované a akékoľvek hlásenia o chybách môžu byť uzavreté ako neplatné.
sl_si: Filtriranje vrste procesorja glede na izbran sistem je onemogočeno za ta emuliran sistem. Tako lahko izberete procesor, ki je sicer nezdružljiv z izbranim sistemom. Vendar lahko naletite na nezdružljivosti z BIOS-om sistema ali drugo programsko opremo Omogočanje te nastavitve ni uradno podprto, vsa poročila o hroščih iz tega naslova pa bodo zaprta kot neveljavna.
tr_tr: Seçtiğiniz makineye uygun CPU (işlemci) türü filtrelemesi bu emülasyon için devre dışı bırakıldı. Bu, normalde seçilen makine ile uyumlu olmayan bir CPU seçmenizi mümkün kılmaktadır. Ancak, bundan dolayı seçilen makinenin BIOS'u veya diğer yazılımlar ile uyumsuzluk sorunu yaşayabilirsiniz. Bu filtrelemeyi devre dışı bırakmak emülatör tarafından resmi olarak desteklenmemektedir ve açtığınız bug (hata) raporları geçersiz olarak kapatılabilir.
uk_ua: Вибір типів ЦП для цієї системної плати на даній емульованій машині відключено. Це дозволяє вибрати процесор, який в іншому випадку не сумісний з вибраною материнською платою. Однак, ви можете зіткнутися з несумісністю з BIOS материнської плати або іншим ПО. Включення цього параметра офіційно не підтримується, і всі подані звіти про помилки можуть бути закриті як недійсні.
vi_vn: Phần chọn loại CPU dựa trên mẫu máy đã chọn bị vô hiệu hóa. Ở đây bạn có thể chọn loại CPU có thể không tương thích với mẫu máy hiện tại. Tuy nhiên bạn có thể gặp vấn đề tương khắc với BIOS hay phần mềm khác. Việc bật tùy chọn này lên không được khuyến cáo chính thức và các bản bug report (báo lỗi) với nội dung tương tự sẽ bị coi là phạm quy và đóng.

source: Continue
ca_es: Continuar
cs_cz: Pokračovat
de_de: Fortfahren
es_es: Continuar
fi_fi: Jatka
fr_fr: Continuer
hr_hr: Nastavi
hu_hu: Folytatás
it_it: Continua
ja_jp: 続行
pl_pl: Kontynuuj
pt_br: Continuar
ru_ru: Продолжить
sk_sk: Pokračovať
sl_si: Nadaljuj
tr_tr: Devam et
uk_ua: Продовжити
vi_vn: Tiếp tục

source: Cassette: %s
ca_es: Casset: %s
cs_cz: Kazeta: %s
de_de: Kassette: %s
fi_fi: Kasetti: %s
hr_hr: Audio kaseta: %s
hu_hu: Magnókazetta: %s
it_it: Cassetta: %s
ja_jp: カセット: %s
pl_pl: Kaseta: %s
pt_br: Cassete: %s
ru_ru: Кассета: %s
sk_sk: Kazeta: %s
sl_si: Kaseta: %s
tr_tr: Kaset: %s
uk_ua: Касета: %s

source: Cassette images
ca_es: Imatges de casset
cs_cz: Kazetové nahrávky
de_de: Kassettenimages
es_es: Imágenes de Cassette
fi_fi: Kasettitiedostot
fr_fr: Images cassette
hr_hr: Slike audio kasete
hu_hu: Magnókazetta-képek
it_it: Immagini cassetta
ja_jp: カセットイメージ
pl_pl: Obrazy kaset
pt_br: Imagens de cassete
ru_ru: Образы кассет
sk_sk: Kazetové nahrávky
sl_si: Slike kaset
tr_tr: Kaset imajları
uk_ua: Образи касет
vi_vn: Ảnh đĩa Cassette

source: Cartridge %i: %ls
ca_es: Cartutx %i: %ls
es_es: Cartucho %i: %ls
fi_fi: ROM-moduuli %i: %ls
fr_fr: Cartouche %i: %ls
hr_hr: Kaseta %i: %ls
hu_hu: ROM-kazetta %i: %ls
it_it: Cartuccia %i: %ls
ja_jp: カートリッジ %i: %ls
pl_pl: Kartrydż %i: %ls
pt_br: Cartucho %i: %ls
ru_ru: Картридж %i: %ls
sl_si: Spominski vložek %i: %ls
tr_tr: Kartuş %i: %ls
uk_ua: Картридж %i: %ls
vi_vn: Băng cartridge %i: %ls

source: Cartridge images
ca_es: Imatges de cartutx
cs_cz: Obrazy cartridge
es_es: Imágenes de Cartucho
fi_fi: ROM-moduulikuvat
fr_fr: Images cartouche
hr_hr: Slike kasete
hu_hu: ROM-kazetta képek
it_it: Immagini cartuccia
ja_jp: カートリッジイメージ
pl_pl: Obrazy kartrydżu
pt_br: Imagens de cartucho
ru_ru: Образы картриджей
sk_sk: Obrazy cartridge
sl_si: Slike spominskega vložka
tr_tr: Kartuş imajları
uk_ua: Образи картриджів
vi_vn: Ảnh đĩa băng cartridge

source: Error initializing renderer
ca_es: Error en inicialitzar el renderitzador
cs_cz: Chyba při inicializaci vykreslovače
de_de: Fehler bei der Rendererinitialisierung
es_es: Error al inicializar el renderizador
fi_fi: Virhe renderöijän alustuksessa
fr_fr: Erreur d'initialisation du moteur de rendu
hr_hr: Nije moguće inicijalizirati renderer
hu_hu: Hiba történt a renderelő inicializálásakor
it_it: Errore nell'inizializzazione del renderer
ja_jp: レンダラーの初期化エラー
pl_pl: Błąd inicjalizacji renderera
pt_br: Erro ao inicializar o renderizador
ru_ru: Ошибка инициализации рендерера
sk_sk: Chyba pri inicializácii vykresľovača
sl_si: Napaka pri zagonu sistema za upodabljanje
tr_tr: Oluşturucu başlatılırken hata oluştu
uk_ua: Помилка ініціалізації рендерера
vi_vn: Lỗi khởi tạo renderer (trình kết xuất)

source: OpenGL (3.0 Core) renderer could not be initialized. Use another renderer.
ca_es: No has estat possible inicialitzar el renderitzador OpenGL (3.0 Core). Utilitzar un altre renderitzador.
cs_cz: Vykreslovač OpenGL (3.0 Core) se nepodařilo inicializovat. Použijte jiný renderer.
de_de: Der OpenGL (3.0-Kern)-Renderer konnte nicht initialisiert werden. Bitte benutzen Sie einen anderen Renderer.
es_es: No fué posible inicializar el renderizador OpenGL (3.0 Core). Utilice otro renderizador.
fi_fi: OpenGL (3.0 Core) -renderöijän alustus epäonnistui. Käytä toista renderöijää.
fr_fr: Le moteur de rendu OpenGL (3.0 Core) n'a pas pu être initialisé. Utilisez un autre moteur de rendu.
hr_hr: Nije moguće inicijalizirati OpenGL (3.0 jezgra) renderer. Molimte koristite drugi renderer.
hu_hu: Az OpenGL (3.0 Core) megjelenítő-motort nem sikerült inicializálni. Kérem használjon másik renderelőt.
it_it: Non è stato possibile inizializzare il renderer OpenGL (3.0 Core). Utilizzare un altro renderer.
ja_jp: OpenGL (3.0 Core) レンダラーが初期化できません。別のレンダラーを使用してください。
pl_pl: Nie można zainicjować renderera OpenGL (3.0 Core). Użyj innego.
pt_br: O renderizador OpenGL (Núcleo 3.0) não pôde ser inicializado. Use outro renderizador.
ru_ru: Невозможно инициализировать рендерер OpenGL (3.0). Пожалуйста, используйте другой рендерер.
sk_sk: Vykresľovač OpenGL (3.0 Core) sa nepodarilo inicializovať. Použite iný renderer.
sl_si: Sistema za upodabljanje OpenGL (3.0 Core) ni bilo mogoče zagnati. Uporabite drug sistem za upodabljanje.
tr_tr: OpenGL (3.0 Core) görüntüleyici başlatılamadı. Başka bir görüntüleyici kullanın.
uk_ua: Неможливо ініціалізувати рендерер OpenGL (3.0). Будь ласка, використовуйте інший рендерер.
vi_vn: Không khởi tạo được renderer OpenGL (3.0 Core). Hãy dùng renderer khác.

source: Resume execution
ca_es: Reprendre l'execució
cs_cz: Obnovit
de_de: Fortsetzen
es_es: Retomar la ejecución
fi_fi: Jatka suoritusta
fr_fr: Reprendre l'exécution
hr_hr: Nastavi
hu_hu: Folytassa a végrehajtást
it_it: Riprendere l'esecuzione
ja_jp: 実行を再開
pl_pl: Wznów wykonywanie
pt_br: Continuar a execução
ru_ru: Возобновить выполнение
sk_sk: Obnoviť
sl_si: Nadaljuj izvajanje
tr_tr: Yürütmeye devam et
uk_ua: Відновити виконання
vi_vn: Tiếp tục chạy thực thi

source: Pause execution
ca_es: Pausar l'execució
cs_cz: Pozastavit
de_de: Pausieren
es_es: Pausar la ejecución
fi_fi: Pysäytä suoritus
fr_fr: Pause de l'exécution
hr_hr: Pauziraj
hu_hu: Kivitelezés szüneteltetése
it_it: Sospendere l'esecuzione
ja_jp: 実行を一時停止
pl_pl: Zatrzymaj wykonywanie
pt_br: Pausar a execução
ru_ru: Приостановить выполнение
sk_sk: Pozastaviť
sl_si: Prekini izvajanje
tr_tr: Yürütmeyi duraklat
uk_ua: Призупинити виконання
vi_vn: Tạm dừng thực thi

source: Press Ctrl+Alt+Del
ca_es: Pulsar Ctrl+Alt+Supr
cs_cz: Stisknout Ctrl+Alt+Delete
de_de: Strg+Alt+Entf drücken
es_es: Pulsar Ctrl+Alt+Supr
fi_fi: Paina Ctrl+Alt+Del
fr_fr: Appuyer sur Ctrl+Alt+Suppr.
hr_hr: Stisni Ctrl+Alt+Del
hu_hu: Nyomja meg a Ctrl+Alt+Del
it_it: Premere Ctrl+Alt+Canc
ja_jp: Ctrl+Alt+DELを押す
pl_pl: Naciśnij Ctrl+Alt+Del
pt_br: Pressionar Ctrl+Alt+Del
ru_ru: Нажать Ctrl+Alt+Del
sk_sk: Stlačiť Ctrl+Alt+Delete
sl_si: Pritisni Ctrl+Alt+Del
tr_tr: Ctrl+Alt+Del
uk_ua: Натиснути Ctrl+Alt+Del
vi_vn: Nhấn Ctrl+Alt+Del

source: Press Ctrl+Alt+Esc
ca_es: Pulsar Ctrl+Alt+Esc
cs_cz: Stisknout Ctrl+Alt+Esc
de_de: Strg+Alt+Esc drücken
es_es: Pulsar Ctrl+Alt+Esc
fi_fi: Paina Ctrl+Alt+Esc
fr_fr: Appuyer sur Ctrl+Alt+Esc
hr_hr: Stisni Ctrl+Alt+Esc
hu_hu: Nyomja meg a Ctrl+Alt+Esc
it_it: Premere Ctrl+Alt+Esc
ja_jp: Ctrl+Alt+Escを押す
pl_pl: Naciśnij Ctrl+Alt+Esc
pt_br: Pressionar Ctrl+Alt+Esc
ru_ru: Нажать Ctrl+Alt+Esc
sk_sk: Stlačiť Ctrl+Alt+Esc
sl_si: Pritisni Ctrl+Alt+Esc
tr_tr: Ctrl+Alt+Esc
uk_ua: Натиснути Ctrl+Alt+Esc
vi_vn: Nhấn Ctrl+Alt+Esc

source: Hard reset
ca_es: Reinicialització completa
cs_cz: Resetovat
fi_fi: Kylmä uudelleenkäynnistys
hr_hr: Ponovno pokretanje
hu_hu: Hardveres újraindítás
it_it: Riavvia
ja_jp: ハードリセット
pl_pl: Twardy reset
pt_br: Reinicialização completa
ru_ru: Холодная перезагрузка
sk_sk: Resetovať
sl_si: Ponovni zagon
tr_tr: Makineyi yeniden başlat
uk_ua: Холодне перезавантаження
vi_vn: Buộc khởi động lại

source: ACPI shutdown
ca_es: Apagada ACPI
cs_cz: Vypnout skrze rozhraní ACPI
de_de: ACPI-basiertes Herunterfahren
es_es: Parada ACPI
fi_fi: ACPI-sammutus
fr_fr: Arrêt ACPI
hr_hr: ACPI bazirano gašenje
hu_hu: ACPI leállítás
it_it: Arresto ACPI
ja_jp: ACPIシャットダウン
pl_pl: Wyłączenie ACPI
pt_br: Desligamento por ACPI
ru_ru: Сигнал завершения ACPI
sk_sk: Vypnúť cez rozhranie ACPI
sl_si: Zaustavitev ACPI
tr_tr: ACPI kapatma
uk_ua: Сигнал завершення ACPI
vi_vn: Tắt máy theo ACPI

source: Hard disk (%1)
ca_es: Disc dur (%1)
cs_cz: Pevný disk (%1)
de_de: Festplatte (%1)
es_es: Disco duro (%1)
fi_fi: Kiintolevy (%1)
fr_fr: Disque dur (%1)
hr_hr: Tvrdi disk (%1)
hu_hu: Merevlemez (%1)
ja_jp: ハードディスク (%1)
pl_pl: Dysk twardy (%1)
pt_br: Disco rígido (%1)
ru_ru: Жёсткий диск (%1)
sk_sk: Pevný disk (%1)
sl_si: Trdi disk (%1)
uk_ua: Жорсткий диск (%1)
vi_vn: Ổ cứng (%1)

source: MFM/RLL or ESDI CD-ROM drives never existed
ca_es: Les unitats de CD-ROM MFM/RLL o ESDI no van existir mai
cs_cz: CD-ROM mechaniky pro rozhraní MFM/RLL nebo ESDI nikdy neexistovaly
de_de: MFM/RLL- oder ESDI CD-ROM-Laufwerke hat es niemals gegeben
es_es: Nunca existieron unidades de CD-ROM MFM/RLL o ESDI
fi_fi: MFM/RLL- tai ESDI-CD-ROM-asemia ei ole koskaan ollut olemassa
fr_fr: Les lecteurs de CD-ROM MFM/RLL ou ESDI n'ont jamais existé
hr_hr: MFM/RLL ili ESDI CD-ROM pogoni nisu nikada postojali
hu_hu: MFM/RLL vagy ESDI CD-ROM meghajtók soha nem léteztek
it_it: Le unità CD-ROM MFM/RLL o ESDI non sono mai esistite.
ja_jp: MFM/RLLやESDI CD-ROMドライブが存在しません
pl_pl: Napędy CD-ROM MFM/RLL lub ESDI nigdy nie istniały
pt_br: As unidades de CD-ROM MFM/RLL ou ESDI nunca existiram
ru_ru: MFM/RLL или ESDI дисководов CD-ROM никогда не существовало
sk_sk: CD-ROM mechaniky pre rozhranie MFM/RLL alebo ESDI nikdy neexistovali
sl_si: MFM/RLL ali ESDI pogoni CD-ROM niso nikoli obstajali
tr_tr: MFM/RLL veya ESDI CD-ROM sürücüleri hiçbir zaman var olmamıştır
uk_ua: MFM/RLL або ESDI дисководів CD-ROM ніколи не існувало
vi_vn: Không hề có ổ CD-ROM MFM/RLL hay ESDI nào tồn tại

source: Custom...
ca_es: Personalitzat...
cs_cz: Vlastní...
de_de: Angepasst...
es_es: A medida...
fi_fi: Mukautettu...
fr_fr: Personnalisé...
hr_hr: Prilagođeno...
hu_hu: Egyéni...
it_it: Personalizzata...
ja_jp: カスタム...
pl_pl: Niestandardowy...
pt_br: Personalizado...
ru_ru: Задать вручную...
sk_sk: Vlastná...
sl_si: Po meri...
tr_tr: Diğer...
uk_ua: Задати вручну...
vi_vn: Tùy chỉnh...

source: Custom (large)...
ca_es: Personalitzat (gran)...
cs_cz: Vlastní (velký)...
de_de: Angepasst (Groß)...
es_es: A medida (grande)...
fi_fi: Mukautettu (suuri)...
fr_fr: Personnalisé (grand)...
hr_hr: Prilagođeno (veliko)...
hu_hu: Egyéni (nagy)...
it_it: Personalizzata (grande)...
ja_jp: カスタム (大容量)...
pl_pl: Niestandardowy (duży)...
pt_br: Personalizado (grande)...
ru_ru: Задать вручную (large)...
sk_sk: Vlastná (veľká)...
sl_si: Po meri (velik)...
tr_tr: Diğer (büyük)...
uk_ua: Задати вручну (large)...
vi_vn: Tùy chỉnh (dung tích lớn)...

source: Add New Hard Disk
ca_es: Afegir disc dur nou
cs_cz: Přidat nový pevný disk
de_de: Neue Festplatte hinzufügen
es_es: Añadir Nuevo Disco Duro
fi_fi: Lisää uusi kiintolevy
fr_fr: Ajouter un nouveau disque dur
hr_hr: Dodajte novi tvrdi disk
hu_hu: Új merevlemez hozzáadása
it_it: Aggiungi un nuovo disco rigido
ja_jp: 新規のディスクを追加
pl_pl: Dodaj nowy dysk twardy
pt_br: Adicionar novo disco rígido
ru_ru: Создать новый жёсткий диск
sk_sk: Pridať nový pevný disk
sl_si: Dodaj nov trdi disk
tr_tr: Yeni Hard Disk Dosyası Oluştur
uk_ua: Створити новий жорсткий диск
vi_vn: Thêm ổ cứng mới

source: Add Existing Hard Disk
ca_es: Afegir disc dur existent
cs_cz: Přidat existující pevný disk
de_de: Bestehende Festplatte hinzufügen
es_es: Añadir Disco Duro Existente
fi_fi: Lisää olemassaoleva kiintolevy
fr_fr: Ajouter un disque dur existant
hr_hr: Dodajte postojeći tvrdi disk
hu_hu: Meglévő merevlemez hozzáadása
it_it: Aggiungi un disco rigido esistente
ja_jp: 既定のディスクを追加
pl_pl: Dodaj istniejący dysk twardy
pt_br: Adicionar disco rígido existente
ru_ru: Выбрать существующий жёсткий диск
sk_sk: Pridať existujúci pevný disk
sl_si: Dodaj obstoječ trdi disk
tr_tr: Var Olan Hard Disk Dosyası Ekle
uk_ua: Вибрати існуючий жорсткий диск
vi_vn: Thêm ổ cứng đã có

source: HDI disk images cannot be larger than 4 GB.
ca_es: Les imatges de disc HDI no poden superar els 4 GB.
cs_cz: Obraz disku formátu HDI nemůžou být větší než 4 GB.
de_de: HDI-Diskimages können nicht größer als 4 GB groß sein.
es_es: Las imágenes de disco HDI no pueden superar los 4 GB.
fi_fi: HDI-levykuvan suurin mahdollinen koko on 4 Gt.
fr_fr: Les images de disque HDI ne peuvent pas avoir une taille supériure à Go.
hr_hr: HDI disk image datoteke ne mogu biti veće od 4 GB.
hu_hu: A HDI lemezképek nem lehetnek nagyobbak 4 GB-nál.
it_it: Le immagini HDI non possono essere più grandi di 4 GB.
ja_jp: HDIディスクイメージは4GBを超えることはできません。
pl_pl: Obrazy dysków HDI nie mogą być większe niż 4 GB.
pt_br: As imagens de disco HDI não podem ser maiores do que 4GB.
ru_ru: Размер образов дисков HDI не может превышать 4 ГБ.
sk_sk: Obraz disku formátu HDI nemôžu byť väčší ako 4 GB.
sl_si: Slike diska HDI ne morejo biti večje od 4 GB.
tr_tr: HDI disk imajları 4 GB'tan daha büyük olamaz.
uk_ua: Розмір образів дисків HDI не може перевищувати 4 ГБ.
vi_vn: Ảnh đĩa ổ HDI không to hơn 4 GB.

source: Disk images cannot be larger than 127 GB.
ca_es: Les imatges del disc no poden superar els 127 GB.
cs_cz: Obraz disku nemůžou být větší než 127 GB.
de_de: Festplattenimages können nicht größer als 127 GB groß sein.
es_es: Las imágenes de disco no pueden superar los 127 GB.
fi_fi: Levykuvien suurin mahdollinen koko on 127 Gt.
fr_fr: Les images de disque ne peuvent pas avoir un taille supérieure à 127 Go.
hr_hr: Slike tvrdog diska ne mogu biti veće od 127 GB.
hu_hu: A lemezképek mérete nem haladhatja meg a 127 GB-ot.
it_it: Le immmagini disco non possono essere più grandi di 127 GB.
ja_jp: ディスクイメージは127GBを超えることはできません。
pl_pl: Obrazy dysków nie mogą być większe niż 127 GB.
pt_br: As imagens de disco não podem ser maiores do que 127GB.
ru_ru: Размер образов дисков не может превышать 127 ГБ.
sk_sk: Obraz disku nemôžu byť väčší ako 127 GB.
sl_si: Slike diska ne morejo biti večje od 127 GB.
tr_tr: Disk imajları 127 GB'tan daha büyük olamaz.
uk_ua: Розмір образів дисків не може перевищувати 127 ГБ.
vi_vn: Ảnh đĩa không to hơn 127 GB.

source: Hard disk images
ca_es: Imatges del disc dur
cs_cz: Obrazy pevného disku
de_de: Festplattenimages
es_es: Imágenes de Disco Duro
fi_fi: Kiintolevykuvat
fr_fr: Images de dique dur
hr_hr: Slike za tvrde diskove
hu_hu: Merevlemez-képfájlok
it_it: Immagini disco rigido
ja_jp: ハードディスクイメージ
pl_pl: Obrazy dysku twardego
pt_br: Imagens de disco rígido
ru_ru: Образы жёстких дисков
sk_sk: Obrazy pevného disku
sl_si: Slike trdega diska
tr_tr: Hard disk imajları
uk_ua: Образи жорстких дисків
vi_vn: Ảnh đĩa ổ cứng

source: Unable to read file
ca_es: No has estat possible llegir el fitxer
cs_cz: Nebylo možné přečíst soubor
de_de: Die Datei konnte nicht gelesen werden
es_es: No se pudo leer el archivo
fi_fi: Tiedostoa ei voi lukea
fr_fr: Impossible de lire le fichier
hr_hr: Nije moguće pročitati datoteku
hu_hu: A fájl nem olvasható
it_it: Impossibile leggere il file
ja_jp: ファイルの読み込みができません
pl_pl: Nie można odczytać pliku
pt_br: Não foi possível ler o arquivo
ru_ru: Невозможно прочитать файл
sk_sk: Nebolo možné prečítať súbor
sl_si: Ne morem prebrati datoteke
tr_tr: Dosya okunamıyor
uk_ua: Неможливо прочитати файл
vi_vn: Không đọc được file

source: Unable to write file
ca_es: No has estat possible escriure el fitxer
cs_cz: Nebylo možné zapisovat do souboru
de_de: Die Datei konnte nicht beschrieben werden
es_es: No se pudo escribir el archivo
fi_fi: Tiedostoon ei voi kirjoittaa
fr_fr: Impossible d'écrire le fichier
hr_hr: Nije moguće napisati datoteku
hu_hu: A fájl nem írható
it_it: Impossibile scrivere al file
ja_jp: ファイルの書き込みができません
pl_pl: Nie można zapisać pliku
pt_br: Não foi possível escrever o arquivo
ru_ru: Невозможно записать файл
sk_sk: Nebolo možné zapisovať do súboru
sl_si: Ne morem pisati v datoteko
tr_tr: Dosyanın üzerine yazılamıyor
uk_ua: Неможливо записати файл
vi_vn: Không ghi được vào file
