Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: An emulator of old computers Authors: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Released under the GNU General Public License version 2 or later. See LICENSE for more information.
ca_es: Un emulador d'ordinadors antics Autors: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne i altres. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho i altres. Alliberat sota la GNU General Public License versió 2 o posterior. Veure LLICENSE per a més informació.
cs_cz: Emulátor starých počítačů Autoři: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Zveřejněno pod licencí GNU General Public License verze 2 nebo novější. Viz soubor LICENSE pro více informací.
de_de: Ein Emulator für alte Computer Autoren: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne sowie andere. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho sowie andere. Übersetzt von: dob205 Veröffentlicht unter der GNU General Public License in der Version 2 oder neuer. Siehe LICENSE für mehr Informationen.
es_es: Un emulador de ordenadores antigüos Autores: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, y otros. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, y otros. Liberado bajo la GNU General Public License versión 2 o posterior. Ver LICENSE para más información.
fi_fi: Vanhojen tietokoneiden emulaattori Tekijät: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne ja muut. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho ja muut. Julkaistu GNU General Public License 2. version tai myöhemmän alaisena. Tarkempia tietoja LICENSE-tiedostossa.
fr_fr: Un émulateur de vieux ordinateurs Auteurs: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Libéré sous la licence GNU General Public License version 2 ou ultérieure. Pour plus d'informations, voir le fichier LICENSE.
hr_hr: Emulator starih računala Autori: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, i drugi. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, i drugi. Preveo: dob205 Objavljeno pod licencom GNU General Public License, verzija 2 ili novije. Za više informacija pogledajte datoteku LICENCE.
hu_hu: Régi számítógépek emulátora Fejlesztők: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Fordította: Laci bá' Megjelent a GNU General Public License v2 vagy újabb alatt. További információért lásd a LICENSE fájlt.
it_it: Un emulatore di computer vecchi Autori: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Tradotto da: explorerdotexe Rilasciato sotto la Licenza Pubblica GNU versione 2 o dopo. Vedi LICENSE per maggior informazioni.
ja_jp: 古いパソコンのエミュレーター 著者: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. GNU General Public License version 2以降でリリースされています。詳しくは LICENSE をご覧ください。
pl_pl: Emulator starych komputerów Autorzy: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, i inni. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, i inni. Przetłumaczony przez: Fanta-Shokata Wydany na licencji GNU General Public License w wersji 2 lub nowszej. Zobacz LICENSE aby uzyskać więcej informacji.
pt_br: Um emulador de computadores antigos Autores: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, e outros. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, e outros. Traduzido por: Altieres Lima da Silva Lançado sob a Licença Pública Geral GNU versão 2 ou posterior. Veja o arquivo LICENSE para mais informações.
ru_ru: Эмулятор старых компьютеров Авторы: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Выпускается под лицензией GNU General Public License версии 2 или более поздней. Дополнительную информацию см. в файле LICENSE.
sk_sk: Emulátor starých počítačov Autori: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Zverejnené pod licenciou GNU General Public License verzie 2 alebo novšej. Pozri súbor LICENSE pre viac informácií.
sl_si: Emulator starih računalnikov Avtorji: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne in drugi. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho in drugi. Izdano pod licenco GNU General Public License različica 2 ali novejša. Glej datoteko LICENSE za več informacij.
tr_tr: Bir eski bilgisayar emülatörü Yapanlar: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, ve diğerleri. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, ve diğerleri. GNU Genel Kamu Lisansı versiyon 2 veya sonrası altında yayınlanmıştır. Daha fazla bilgi için LICENSE'ı gözden geçirin.
uk_ua: Емулятор старих комп'ютерів Автори: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, and others. With previous core contributions from Sarah Walker, leilei, JohnElliott, greatpsycho, and others. Випускаєтся під ліцензією GNU General Public License версії 2 або більше пізніше. Додадкову інформацію см. у файлі LICENSE.
vi_vn: Trình giả lập các dòng máy tính cổ. Tác giả: Miran Grča (OBattler), RichardG867, Jasmine Iwanek, TC1995, coldbrewed, Teemu Korhonen (Manaatti), Joakim L. Gilje, Adrien Moulin (elyosh), Daniel Balsom (gloriouscow), Cacodemon345, Fred N. van Kempen (waltje), Tiseno100, reenigne, cùng những người khác. Cùng với những đóng góp cốt cán từ Sarah Walker, leilei, JohnElliott, greatpsycho, và một số người khác. Phát hành dưới giấy phép GNU General Public License version 2 trở đi. Đọc LICENSE để biết thêm thông tin.

source: Hardware not available
ca_es: Maquinari no disponible
cs_cz: Hardware není dostupný
de_de: Hardware nicht verfügbar
es_es: Equipo no disponible
fi_fi: Laitteisto ei ole saatavilla
fr_fr: Matériel non disponible
hr_hr: Hardver nije dostupan
hu_hu: Hardver nem elérhető
it_it: Hardware non disponibile
ja_jp: ハードウェアが利用できません
pl_pl: Sprzęt niedostępny
pt_br: Hardware não disponível
ru_ru: Оборудование недоступно
sk_sk: Hardvér nie je dostupný
sl_si: Strojna oprema ni na voljo
tr_tr: Donanım mevcut değil
uk_ua: Обладнання недоступне
vi_vn: Phần cứng không có sẵn

source: Make sure %1 is installed and that you are on a %1-compatible network connection.
ca_es: Assegureu-vos que el %1 està instal·lat i que està en una connexió de xarxa compatible amb %1.
cs_cz: Ujistěte se, že je nainstalován %1 a používáte síťové připojení s ním kompatibilní.
de_de: Bitte stellen Sie sicher, dass %1 installiert ist und sie eine %1-kompatible Netzwerkverbindung nutzen.
es_es: Asegúrate de que %1 está instalado y de que estás en una conexión de red compatible con %1.
fi_fi: Varmista, että %1 on asennettu ja että verkkoyhteytesi on %1-yhteensopiva.
fr_fr: Assurez-vous que %1 est installé et que vou utilisez une connexion réseau compatible avec %1.
hr_hr: Provjerite je li %1 instaliran i jeste li na mreži, kompadibilnoj s %1.
hu_hu: Győződjön meg hogy a(z) %1 telepítve van és jelenleg a %1-kompatibilis kapcsolatot használja.
it_it: Controllare se %1 è installato e che tu sia connesso ad una connessione %1 compatibile.
ja_jp: がインストールされてるか、%1に対応したネットワークに接続されてるか確認してください。
pl_pl: Sprawdź, czy %1 jest zainstalowany i czy posiadasz połączenie sieciowe kompatybilne z %1.
pt_br: Certifique-se de que %1 esteja instalado e que você tenha uma conexão de rede compatível com %1.
ru_ru: Убедитесь, что %1 установлен и ваше сетевое соединение совместимо с %1.
vi_vn: Đảm bảo rằng %1 đã được cài đặt vào và bạn đang dùng kết nối mạng tương thích %1.

source: Invalid configuration
ca_es: Configuració invàlida
cs_cz: Neplatná konfigurace
de_de: Ungültige Konfiguration
es_es: Configuración inválida
fi_fi: Virheelliset määritykset
fr_fr: Configuration non valide
hr_hr: Nevažeća konfiguracija
hu_hu: Érvénytelen konfiguráció
it_it: Configurazione invalida
ja_jp: 不正な設定です
pl_pl: Nieprawidłowa konfiguracja
pt_br: Configuração inválida
ru_ru: Недопустимая конфигурация
sk_sk: Neplatná konfigurácia
sl_si: Neveljavna konfiguracija
tr_tr: Geçersiz konfigürasyon
uk_ua: Неприпустима конфігурація
vi_vn: Tinh chỉnh không hợp lý

source: %1 is required for automatic conversion of PostScript files to PDF. Any documents sent to the generic PostScript printer will be saved as PostScript (.ps) files.
ca_es: %1 és necessària per a la conversió automàtica de fitxers PostScript a PDF. Qualsevol document enviat a la impressora genèrica postScript es desarà com a fitxer PostScript (.ps).
cs_cz: %1 je potřeba pro automatický převod PostScript dokumentů do PDF. Jakékoliv dokumenty vytisknuté přes obecnou PostScriptovou tiskárnu budou uloženy jako PostScript (.ps) soubory.
de_de: %1 wird zur automatischen Konversion von PostScript-Dateien in das PDF-Format benötigt. Sämtliche an den generischen PostScript-Drucker gesendete Dateien werden als PostScript (.ps)-Dateien gesichert.
es_es: %1 es necesaria para la conversión automática de archivos PostScript a PDF. Cualquier documento enviado a la impresora genérica postScript se guardará como archivo PostScript (.ps).
fi_fi: %1 vaaditaan PostScript-tiedostojen automaattiseen muuntamiseen PDF-tiedostoiksi. Kaikki geneeriselle PostScript-tulostimelle lähetetyt asiakirjat tallennetaan PostScript (.ps) -tiedostoina.
fr_fr: %1 est nécessair pour la conversion automatique des fichiers PostScript dans PDF. Tous les documents envoyés à l'imprimante générique PostScript seront sauvés comme des fichiers PostScript (.ps).
hr_hr: %1 je potrebno za automatsku konverziju PostScript datoteke u PDF datoteke. Svi dokumenti poslani na generički PostScript pisač bit će spremljeni kao PostScript (.ps) datoteke.
hu_hu: %1 szükséges a PostScript fájlok PDF formátumba való automatikus konvertálásához. Az általános PostScript nyomtatóra küldött dokumentumok PostScript (.ps) fájlként kerülnek mentésre.
it_it: %1 è richiesto per la conversione automatica di file PostScript a file PDF. Qualsiasi documento mandato alla stampante generica PostScript sarà salvato come file PostScript. (.ps)
ja_jp: PostScriptファイルをPDFに自動変換するには%1が必要です。 汎用PostScriptプリンターに送信された文書は、PostScript (.ps) ファイルとして保存されます。
pl_pl: %1 jest wymagany do automatycznej konwersji plików PostScript do PDF. Dokumenty wysłane do ogólnej drukarki PostScript zostaną zapisane jako pliki PostScript (.ps).
pt_br: %1 é necessário para a conversão automática de arquivos PostScript para PDF. Qualquer documento enviado para a impressora genérica PostScript será salvo como arquivos PostScript (.ps).
ru_ru: Для автоматического преобразования файлов PostScript в PDF требуется %1. Все документы, отправленные на общий принтер PostScript, будут сохранены в виде файлов PostScript (.ps).
sk_sk: %1 je potrebná pre automatický prevod PostScript dokumentov do PDF. Akékoľvek dokumenty vytlačené cez všeobecnú PostScriptovú tlačiareň budú uložené ako PostScript (.ps) súbory.
sl_si: %1 je potreben za samodejno pretvorbo PostScript datotek v PDF. Vsi dokumenti, poslani generičnemu PostScript tiskalniku bodo shranjeni kot PostScript (.ps) datoteke.
tr_tr: %1 PostScript dosyalarının otomatik olarak PDF dosyalarına çevirilmesi için gereklidir. Genel PostScript yazıcısına gönderilen tüm dökümanlar PostScript (.ps) dosyaları olarak kaydedilecektir.
uk_ua: %1 потрібно для автоматичного перетворення файлів PostScript в PDF. Всі документи, відправлені на загальний принтер PostScript, будуть збережені у вигляді файлів PostScript (.ps).
vi_vn: Cần có %1 để tự động chuyển đổi file PostScript qua PDF. Mọi tài liệu được đưa qua máy in generic PostScript sẽ lưu ở dạng PostScript (.ps).

source: Entering fullscreen mode
ca_es: Entrant en mode pantalla completa
cs_cz: Vstup do režimu celé obrazovky
de_de: Vollbildmodus wird aktiviert
es_es: Entrando en modo pantalla completa
fi_fi: Siirrytään koko näytön tilaan
fr_fr: Entrer en mode plein écran
hr_hr: Ulazim u cijelozaslonski način
hu_hu: Teljes képernyős módra váltás
it_it: Entrando nella modalità schermo intero
ja_jp: 全画面モードを入力
pl_pl: Przechodzenie do trybu pełnoekranowego
pt_br: Entrando no modo de tela cheia
ru_ru: Вход в полноэкранный режим
sk_sk: Vstup do režimu celej obrazovky
sl_si: Preklapljam v celozaslonski način
tr_tr: Tam ekran moduna geçiliyor
uk_ua: Вхід у повноекранний режим
vi_vn: Đang tiến vào chế độ toàn màn hình

source: Don't show this message again
ca_es: No mostreu més aquest missatge
cs_cz: Nezobrazovat dále tuto zprávu
de_de: Diese Nachricht nicht mehr anzeigen
es_es: No mostrar más este mensaje
fi_fi: Älä näytä tätä viestiä uudelleen
fr_fr: Ne pas montrer ce message à nouveau
hr_hr: Ne pokazi više ovu poruku
hu_hu: Ne jelenítse meg újra ezt az üzenetet
it_it: Non mostrare più questo messaggio
ja_jp: 今後、このメッセージを表示しない
pl_pl: Nie pokazuj więcej tego komunikatu
pt_br: Não exibir esta mensagem novamente
ru_ru: Больше не показывать это сообщение
sk_sk: Nezobrazovať ďalej túto správu
sl_si: Ne pokaži več tega sporočila
tr_tr: Bu mesajı bir daha gösterme
uk_ua: Більше не показувати це повідомлення
vi_vn: Không hiện thông báo này nữa

source: Don't exit
ca_es: No sortir
cs_cz: Neukončovat
de_de: Nicht beenden
es_es: No salir
fi_fi: Älä poistu
fr_fr: Ne pas sortir
hr_hr: Ne izlazi
hu_hu: Ne lépjen ki
it_it: Non uscire
ja_jp: 終了しない
pl_pl: Nie kończ
pt_br: Não sair
ru_ru: Не выходить
sk_sk: Neukončovať
sl_si: Prekliči izhod
tr_tr: Çıkış yapma
uk_ua: Не виходити
vi_vn: Không thoát

source: Reset
ca_es: Resetejar
cs_cz: Resetovat
de_de: Zurücksetzen
es_es: Reinicializar
fi_fi: Käynnistä uudelleen
fr_fr: Réinitialiser
hr_hr: Resetiraj
hu_hu: Újraindítás
it_it: Riavvia
ja_jp: リセット
pl_pl: Przywróć
pt_br: Reiniciar
ru_ru: Перезагрузить
sk_sk: Resetovať
sl_si: Resetiraj
tr_tr: Yeniden başlat
uk_ua: Перезавантажити
vi_vn: Khởi động lại

source: Don't reset
ca_es: No resetejar
cs_cz: Neresetovat
de_de: Nicht zurücksetzen
es_es: No reinicializar
fi_fi: Älä käynnistä uudelleen
fr_fr: Ne pas réinitialiser
hr_hr: Ne resetiraj
hu_hu: Ne indítsa újra
it_it: Non riavviare
ja_jp: リセットしない
pl_pl: Nie przywracaj
pt_br: Não reiniciar
ru_ru: Не перезагружать
sk_sk: Neresetovať
sl_si: Ne resetiraj
tr_tr: Yeniden başlatma
uk_ua: Не перезавантажувати
vi_vn: Không khởi động lại

source: CD-ROM images
ca_es: Imatges de CD-ROM
cs_cz: Obraz CD-ROM disku
es_es: Imágenes de CD-ROM
fi_fi: CD-ROM-levykuvat
fr_fr: Images CD-ROM
hr_hr: CD-ROM slike
hu_hu: CD-ROM-képek
it_it: Immagini CD-ROM
ja_jp: CD-ROMイメージ
pl_pl: Obrazy CD-ROM
pt_br: Imagens de CD-ROM
ru_ru: Образы CD-ROM
sk_sk: Obraz CD-ROM disku
sl_si: Slike CD-ROM
tr_tr: CD-ROM imajları
uk_ua: Образи CD-ROM
vi_vn: Ảnh đĩa CD-ROM

source: %1 Device Configuration
ca_es: %1 Configuració de Dispositiu
cs_cz: Konfigurace zařízení %1
de_de: %1-Gerätekonfiguration
es_es: %1 Configuración de Dispositivo
fi_fi: %1 - Laitteen määritykset
fr_fr: Configuration du dispositif %1
hr_hr: Konfiguracija uređaja %1
hu_hu: %1 eszközkonfiguráció
it_it: Configurazione del dispositivo %1
ja_jp: %1 のデバイス設定
pl_pl: Konfiguracja urządzenia %1
pt_br: Configuração do dispositivo %1
ru_ru: Конфигурация устройства %1
sk_sk: Konfigurácia zariadenia %1
sl_si: Konfiguracija naprave %1
tr_tr: %1 Cihaz Konfigürasyonu
uk_ua: Конфігурація пристрою %1
vi_vn: Tinh chỉnh thiết bị %1

source: Monitor in sleep mode
ca_es: Monitor en mode estalvi
cs_cz: Monitor je v režimu spánku
de_de: Monitor im Standbymodus
es_es: Monitor en modo ahorro
fi_fi: Näyttö lepotilassa
fr_fr: Moniteur en mode veille
hr_hr: Ekran u stanju mirovanja
hu_hu: Képernyő alvó módban
it_it: Monitor in modalità riposo
ja_jp: モニターのスリープモード
pl_pl: Monitor w trybie czuwania
pt_br: Monitor em modo de suspensão
ru_ru: Монитор в спящем режиме
sk_sk: Monitor je v režime spánku
sl_si: Zaslon v načinu spanja
tr_tr: Monitör uyku modunda
uk_ua: Монітор у сплячому режимі
vi_vn: Màn hình chế độ chờ/ngủ

source: OpenGL Shaders
ca_es: Shaders OpenGL
cs_cz: Shadery OpenGL
de_de: OpenGL-Shader
es_es: Shaders OpenGL
fi_fi: OpenGL-varjostinohjelmat
fr_fr: Shaders OpenGL
hr_hr: OpenGL shaderi
hu_hu: OpenGL Shaderek
it_it: Shader OpenGL
ja_jp: OpenGLシェーダー
pl_pl: Shadery OpenGL
pt_br: Shaders OpenGL
ru_ru: Шейдеры OpenGL
sk_sk: Shadery OpenGL
sl_si: Senčilniki OpenGL
tr_tr: OpenGL Gölgelendiricileri
uk_ua: Шейдери OpenGL
vi_vn: Shader OpenGL

source: OpenGL options
ca_es: Opcions OpenGL
cs_cz: Možnosti OpenGL
de_de: OpenGL-Optionen
es_es: Opciones OpenGL
fi_fi: OpenGL-asetukset
fr_fr: Options OpenGL
hr_hr: OpenGL opcije
hu_hu: OpenGL beállítások
it_it: Impostazioni OpenGL
ja_jp: OpenGL設定
pl_pl: Opcje OpenGL
pt_br: Opções do OpenGL
ru_ru: Параметры OpenGL
sk_sk: Možnosti OpenGL
sl_si: Možnosti OpenGL
tr_tr: OpenGL ayarları
uk_ua: Параметри OpenGL
vi_vn: Tùy chọn OpenGL

source: You are loading an unsupported configuration
ca_es: S'està carregant una configuració no suportada
cs_cz: Pokoušíte se spustit nepodporovanou konfiguraci
de_de: Sie laden gerade eine nicht unterstützte Konfiguration
es_es: Está cargando una configuración no soportada
fi_fi: Olet lataamassa ei-tuettuja määrittelyjä
fr_fr: Vous chargez une configuration non prise en charge
hr_hr: Učitavate nepodržanu konfiguraciju
hu_hu: Egy nem támogatott konfigurációt tölt be
it_it: Stai caricando una configurazione non supportata
ja_jp: 読み込んでいる設定がサポートされません
pl_pl: Ładujesz nieobsługiwaną konfigurację
pt_br: Você está carregando uma configuração não suportada
ru_ru: Вы загружаете неподдерживаемую конфигурацию
sk_sk: Pokúšate sa spustiť nepodporovanú konfiguráciu
sl_si: Nalagate nepodprto konfiguracijo
tr_tr: Desteklenmeyen bir konfigürasyon yüklüyorsunuz
uk_ua: Ви завантажуєте непідтримувану конфігурацію
vi_vn: Bạn đang load tinh chỉnh không được hỗ trợ.
