Repository: 86Box/86Box
Catalog: src/qt/languages/*.po
Languages: ca_es, cs_cz, de_de, es_es, fi_fi, fr_fr, hr_hr, hu_hu, it_it, ja_jp, pl_pl, pt_br, ru_ru, sk_sk, sl_si, tr_tr, uk_ua, vi_vn

source: HDI or HDX images with a sector size other than 512 are not supported.
ca_es: Les imatges HDI o HDX amb una mida de sector diferent de 512 no s'admeten.
cs_cz: Obraz disku ve formátu HDI nebo HDX s velikostí sektoru jinou než 512 bajtů nejsou podporovány.
de_de: HDI- oder HDX-Images mit einer Sektorgröße größer als 512 kB werden nicht unterstützt.
es_es: No se soportan las imágenes HDI o HDX con un tamaño de sector diferente a 512.
fi_fi: HDI- ja HDX-levykuvien ainoa tuettu sektorikoko on 512
fr_fr: Les images HDI ou HDX avec une taille de secteur différente de 512 non sont pas prises en charge.
hr_hr: HDI ili HDX slike s veličinom sektora koja nije 512 kB nisu podržane.
hu_hu: Az 512-től eltérő szektorméretű HDI vagy HDX képek nem támogatottak.
it_it: Le immagini HDI o HDX con settori di dimensioni diverse da 512 non sono supportati.
ja_jp: 512以外のセクタサイズを持つHDIまたはHDXイメージはサポートされていません。
pl_pl: Obrazy HDI lub HDX z rozmiarem sektora innym niż 512 nie są wspierane.
pt_br: Imagens HDI ou HDX com um tamanho de setor que não seja 512 não são suportadas.
ru_ru: Образы HDI или HDX с размером сектора, отличным от 512, не поддерживаются.
sk_sk: Obraz disku vo formáte HDI alebo HDX s veľkosťou sektora inou ako 512 bajtov nie sú podporované.
sl_si: Slike HDI ali HDX, ki nimajo sektorjev velikosti 512 bajtov, niso podprte.
tr_tr: 512 dışında sektör boyutu olan HDI veya HDX imajları desteklenmemektedir.
uk_ua: Образи HDI або HDX з розміром сектора, відмінним від 512, не підтримуються.
vi_vn: Ảnh đĩa HDI hoặc HDX với kích thước sector khác 512 không được hỗ trợ.

source: Disk image file already exists
ca_es: El fitxer d'imatge de disc ja existeix
cs_cz: Soubor obrazu disku již existuje
de_de: Die Festplattenimagedatei existiert bereits
es_es: La imagen de disco ya existe
fi_fi: Levykuva on jo olemassa
fr_fr: Le fichier de l'image disque existe déjà.
hr_hr: Slika diska već postoji
hu_hu: A lemezképfájl már létezik
it_it: Immagine disco già esiste
ja_jp: ディスクイメージファイルが既に存在します
pl_pl: Plik obrazu dysku już istnieje
pt_br: Esta imagem existe
ru_ru: Файл образа диска уже существует
sk_sk: Súbor obrazu disku už existuje
sl_si: Datoteka s sliko diska že obstaja
tr_tr: Disk imaj dosyası zaten var olmakta
uk_ua: Файл образу диска вже існує
vi_vn: Đã có file ảnh đĩa rồi

source: Please specify a valid file name.
ca_es: Especifiqueu un nom de fitxer vàlid.
cs_cz: Zadejte platný název souboru.
de_de: Bitte geben Sie einen gültigen Dateinamen ein.
es_es: Por favor especifique un nombre de archivo válido.
fi_fi: Anna kelvollinen tiedostonimi.
fr_fr: Veuillez spécifier un nom de fichier valide.
hr_hr: Molimte unesite važeći naziv datoteke.
hu_hu: Adjon meg egy érvényes fájlnevet.
it_it: Specifica un nome file valido.
ja_jp: 有効なファイル名を指定してください。
pl_pl: Określ prawidłową nazwę pliku.
pt_br: Digite um nome de arquivo válido.
ru_ru: Пожалуйста, укажите правильное имя файла.
sk_sk: Zadajte platný názov súboru.
sl_si: Prosim, navedite veljavno ime datoteke.
tr_tr: Lütfen geçerli bir dosya ismi belirleyin.
uk_ua: Вкажіть правильне ім'я файлу.
vi_vn: Vui lòng đặt tên hợp lệ.

source: Disk image created
ca_es: La imatge de disc ha estat creada
cs_cz: Obraz disku byl vytvořen
de_de: Disk-Image wurde erstellt
es_es: Imagen de disco creada
fi_fi: Levykuva luotu
fr_fr: Image de disque créée
hr_hr: Slika je stvorena
hu_hu: A lemezképfájl létrehozásra került
it_it: Immagine disco creata
ja_jp: ディスクイメージが作成されました
pl_pl: Utworzono obraz dysku
pt_br: A imagem foi criada com sucesso
ru_ru: Образ диска создан
sk_sk: Obraz disku bol vytvorený
sl_si: Slika diska ustvarjena
tr_tr: Disk imajı oluşturuldu
uk_ua: Образ диску створено
vi_vn: Đã tạo ảnh đĩa

source: Make sure the file exists and is readable.
ca_es: Assegureu-vos que el fitxer existeix i és llegible.
cs_cz: Ujistěte se, že soubor existuje a lze jej přečíst.
de_de: Bitte stellen Sie sicher, dass die Datei existiert und lesbar ist.
es_es: Asegúrese de que el archivo existe y es leíble.
fi_fi: Varmista, että tiedosto on olemassa ja lukukelpoinen
fr_fr: Assurez-vous que le fichier existe et est lisible.
hr_hr: Provjerite je li postoji datoteka i je li čitljiva.
hu_hu: Győződjön meg arról, hogy a fájl létezik és olvasható.
it_it: Controlla che il file esiste e che sia leggibile.
ja_jp: ファイルが存在し、読み取り可能であることを確認してください。
pl_pl: Sprawdź, czy plik istnieje i nadaje się do odczytu.
pt_br: Certifique-se de que o arquivo existe e é legível.
ru_ru: Убедитесь, что файл существует и доступен для чтения.
sk_sk: Uistite sa, že súbor existuje a možno ho prečítať.
sl_si: Prepričajte se, da datoteka obstaja in je berljiva.
tr_tr: Dosyanın var olduğuna ve okunabildiğine emin olun.
uk_ua: Переконайтеся, що файл є доступним для читання.
vi_vn: Chắc chắn rằng file tồn tại và đọc được.

source: Make sure the file is being saved to a writable directory.
ca_es: Assegureu-vos que el fitxer s'està desant en un directori que es pugui escriure.
cs_cz: Ujistěte se, že se do složky, kde se má soubor uložit, dá zapisovat.
de_de: Bitte stellen Sie sicher, dass die Datei in ein Verzeichnis mit Schreibberechtigungen gespeichert wird.
es_es: Asegúrese de que el archivo en un directorio con permiso de escritura.
fi_fi: Varmista, että tiedoston tallennuskansioon on kirjoitusoikeus
fr_fr: Assurez-vous que le fichier en cours d'enregistrement se trouve dans un répertoire accessible en écriture.
hr_hr: Provjerite je li se datoteka sprema u mapu s dopuštenjima za pisanje.
hu_hu: Győződjön meg arról, hogy a fájlt egy írható könyvtárba menti.
it_it: Controlla che il file viene salvato ad un percorso con diritti di scrittura
ja_jp: ファイルが書き込み可能なディレクトリに保存されていることを確認してください。
pl_pl: Sprawdź, czy plik jest zapiyswany w katalogu z możliwością zapisu.
pt_br: Certifique-se de que o arquivo está sendo salvo em um diretório gravável.
ru_ru: Убедитесь, что файл сохраняется в директории доступной для записи.
sk_sk: Uistite sa, že sa do zložky, kde sa má súbor uložiť, dá zapisovať.
sl_si: Prepričajte se, da datoteko shranjujete v zapisljivo mapo.
tr_tr: Dosyanın yazılabilir bir klasöre kaydedildiğinden emin olun.
uk_ua: Переконайтеся, що файл зберігається в каталог, який є доступним для запису.
vi_vn: Chắc chắn rằng file được lưu ở địa chỉ thư mục có thể ghi đè.

source: Disk image too large
ca_es: La imatge del disc és massa gran
cs_cz: Obraz disku je příliš velký
de_de: Festplattenimage ist zu groß
es_es: Imagen de disco demasiado grande
fi_fi: Liian suuri levykuva
fr_fr: Image disque trop grande
hr_hr: Slika diska je prevelika
hu_hu: A lemezképfájl túl nagy
it_it: Immagine disco troppo grande
ja_jp: ディスクイメージのサイズが大きすぎます
pl_pl: Obraz dysku jest za duży
pt_br: A imagem do disco é muito grande
ru_ru: Слишком большой образ диска
sk_sk: Obraz disku je príliš veľký
sl_si: Slika diska je prevelika
tr_tr: Disk imajı çok büyük
uk_ua: Занадто великий образ диска
vi_vn: Ảnh đĩa quá to

source: Remember to partition and format the newly-created drive.
ca_es: Recordeu particionar i formatar la unitat de nova creació.
cs_cz: Nezapomeňte nově vytvořený disk rozdělit a naformátovat.
de_de: Bitte denken Sie an das Partitionieren und Formatieren des neu erstellten Laufwerks.
es_es: Recuerde particionar y formatear la nueva unidad.
fi_fi: Muista osioida ja alustaa juuri luomasi asema.
fr_fr: N'oubliez pas de partitionner et de formater le nouveau disque créé.
hr_hr: Ne zaboravite stvoriti particije i formatirati ih na novom disku.
hu_hu: Ne felejtse el particionálni és formázni az újonnan létrehozott meghajtót.
it_it: Ricordati di partizionare e formattare il disco appena creato.
ja_jp: 新規ドライブをパーティション分割し、フォーマットを必ずしといてください。
pl_pl: Nie zapomnij o partycjonowaniu i sformatowaniu nowo utworzego dysku
pt_br: Lembre-se de particionar e formatar a unidade recém-criada.
ru_ru: Не забудьте разметить и отформатировать вновь созданный диск.
sk_sk: Nezabudnite novo vytvorený disk rozdeliť a naformátovať.
sl_si: Ne pozabite na novem disku ustvariti particij in jih formatirati.
tr_tr: Yeni oluşturulan diski bölmeyi ve formatlamayı unutmayın.
uk_ua: Не забудьте розмітити та відформатувати новостворений диск.
vi_vn: Nhớ phân vùng và định dạng ổ đĩa mới tạo.

source: The selected file will be overwritten. Are you sure you want to use it?
ca_es: El fitxer seleccionat se sobreescriurà. Esteu segur que voleu utilitzar-lo?
cs_cz: Zvolený soubor bude přepsán. Opravdu jej chcete použít?
de_de: Die ausgewählte Datei wird überschrieben. Möchten Sie diese Datei nutzen?
es_es: El archivo selecionado será sobreescrito. ¿Está seguro de querer usarlo?
fi_fi: Valittu tiedosto korvataan. Oletko varma, että haluat käyttää sitä?
fr_fr: Le fichier sélectionné sera écrasé. Etes-vous sûr de vouloir l'utiliser?
hr_hr: Odabrana datoteka bit će prebrisana. Jeste li sigurni da želite koristiti ovu daoteku?
hu_hu: A kiválasztott fájl felülírásra kerül. Biztos, hogy ezt kívánja használni?
it_it: Il file selezionato sarà sovrascritto, sei sicuro di volerlo usare?
ja_jp: 選択したファイルは上書きされます。よろしいですか？
pl_pl: Wybrany plik zostanie nadpisany. Czy na pewno chcesz użyć tego pliku?
pt_br: O arquivo selecionado será sobrescrito. Você tem certeza de que deseja usá-lo?
ru_ru: Выбранный файл будет перезаписан. Вы уверены, что хотите использовать его?
sk_sk: Zvolený súbor bude prepísaný. Naozaj ho chcete použiť?
sl_si: Izbrana datoteka bo prepisana. Ali jo res želite uporabiti?
tr_tr: Seçili dosyanın üzerine yazılacaktır. Bunu yapmak istediğinizden emin misiniz?
uk_ua: Вибраний файл буде перезаписано. Ви впевнені, що хочете використовувати його?
vi_vn: File được chọn sẽ bị ghi đè lên. Bạn có chắc muốn chọn dùng không?

source: Unsupported disk image
ca_es: Imatge de disc no compatible
cs_cz: Nepodporovaný obraz disku
de_de: Nicht unterstütztes Festplattenimage
es_es: Imagen de disco no soportada
fi_fi: Levykuvaa ei tueta
fr_fr: Image disque non prise en charge
hr_hr: Nepodržana slika diska
hu_hu: Nem támogatott lemezkép
it_it: Immagine disco non supportata
ja_jp: 非対応のディスクイメージジ
pl_pl: Niewspierany obraz dysku
pt_br: Imagem de disco sem suporte
ru_ru: Неподдерживаемый образ диска
sk_sk: Nepodporovaný obraz disku
sl_si: Nepodprta slika diska
tr_tr: Desteklenmeyen disk imajı
uk_ua: Образ диска, що не підтримується
vi_vn: File ảnh đĩa không được hỗ trợ

source: Overwrite
ca_es: Sobreescriure
cs_cz: Přepsat
de_de: Überschreiben
es_es: Sobreescribir
fi_fi: Korvaa
fr_fr: Écraser
hr_hr: Prepiši
hu_hu: Felülírás
it_it: Sovrascrivi
ja_jp: 上書き
pl_pl: Nadpisz
pt_br: Sobrescrever
ru_ru: Перезаписать
sk_sk: Prepísať
sl_si: Prepiši
tr_tr: Üzerine yaz
uk_ua: Перезаписати
vi_vn: Có ghi đè

source: Don't overwrite
ca_es: No sobreescriure
cs_cz: Nepřepisovat
de_de: Nicht überschreiben
es_es: No sobreescribir
fi_fi: Älä korvaa
fr_fr: Ne pas écraser
hr_hr: Ne prepiši
hu_hu: Ne írja felül
it_it: Non sovrascrivere
ja_jp: 上書きしない
pl_pl: Nie nadpisuj
pt_br: Não sobrescrever
ru_ru: Не перезаписывать
sk_sk: Neprepisovať
sl_si: Ne prepiši
tr_tr: Üzerine yazma
uk_ua: Не перезаписувати
vi_vn: Không ghi đè

source: Raw image (.img)
ca_es: Imatge crua (.img)
cs_cz: Surový obraz (.img)
de_de: Rohdatenimages (.img)
es_es: Imagen plana (.img)
fi_fi: Raaka levykuva (.img)
fr_fr: Image brute (.img)
hr_hr: Slika neobrađenih podataka (.img)
hu_hu: Nyers lemezkép (.img)
it_it: Immagine raw (.img)
ja_jp: Rawイメージ (.img)
pl_pl: Obraz surowy (.img)
pt_br: Imagem bruta (.img)
ru_ru: RAW образ (.img)
sk_sk: Surový obraz (.img)
sl_si: Surova slika (.img)
tr_tr: Ham imaj (.img)
uk_ua: RAW образ (.img)
vi_vn: Ảnh đĩa thô (.img)

source: HDI image (.hdi)
ca_es: Imatge HDI (.hdi)
cs_cz: HDI obraz (.hdi)
de_de: HDI-Images (.hdi)
es_es: Imagen HDI (.hdi)
fi_fi: HDI-levykuva (.hdi)
fr_fr: Image HDI (.hdi)
hr_hr: HDI slika (.hdi)
hu_hu: HDI-lemezkép (.hdi)
it_it: Immagine HDI (.hdi)
ja_jp: HDIイメージ (.hdi)
pl_pl: Obraz HDI (.hdi)
pt_br: Imagem HDI (.hdi)
ru_ru: Образ HDI (.hdi)
sk_sk: HDI obraz (.hdi)
sl_si: Slika HDI (.hdi)
tr_tr: HDI imajı (.hdi)
uk_ua: Образ HDI (.hdi)
vi_vn: Ảnh đĩa HDI (.hdi)

source: HDX image (.hdx)
ca_es: Imatge HDX (.hdx)
cs_cz: HDX obraz (.hdx)
de_de: HDX-Images (.hdx)
es_es: Imagen HDX (.hdx)
fi_fi: HDX-levykuva (.hdx)
fr_fr: Image HDX (.hdx)
hr_hr: HDX slika (.hdx)
hu_hu: HDX-lemezkép (.hdx)
it_it: Immagine HDX (.hdx)
ja_jp: HDXイメージ (.hdx)
pl_pl: Obraz HDX (.hdx)
pt_br: Imagem HDX (.hdx)
ru_ru: Образ HDX (.hdx)
sk_sk: HDX obraz (.hdx)
sl_si: Slika HDX (.hdx)
tr_tr: HDX imajı (.hdx)
uk_ua: Образ HDX (.hdx)
vi_vn: Ảnh đĩa HDX (.hdx)

source: Fixed-size VHD (.vhd)
ca_es: VHD de mida fixa (.vhd)
cs_cz: VHD s pevnou velikostí (.vhd)
de_de: VHD mit fester Größe (.vhd)
es_es: VHD de tamaño fijo (.vhd)
fi_fi: Kiinteä VHD (.vhd)
fr_fr: VHD à taille fixe (.vhd)
hr_hr: VHD fiksne veličine (.vhd)
hu_hu: Rögzített méretű VHD (.vhd)
it_it: VHD di dimensioni fisse (.vhd)
ja_jp: VHD (容量固定) (.vhd)
pl_pl: VHD o stałym rozmiarze (.vhd)
pt_br: VHD de tamanho fixo (.vhd)
ru_ru: VHD фиксированного размера (.vhd)
sk_sk: VHD s pevnou veľkosťou (.vhd)
sl_si: VHD fiksne velikosti (.vhd)
tr_tr: Sabit-boyutlu VHD (.vhd)
uk_ua: VHD фіксованого розміру (.vhd)
vi_vn: Ảnh VHD kích thước cố định (.vhd)

source: Dynamic-size VHD (.vhd)
ca_es: VHD de mida dinàmica (.vhd)
cs_cz: VHD s dynamickou velikostí (.vhd)
de_de: VHD mit dynamischer Größe (.vhd)
es_es: VHD de tamaño dinámico (.vhd)
fi_fi: Dynaaminen VHD (.vhd)
fr_fr: VHD à taille dynamique (.vhd)
hr_hr: VHD dinamičke veličine (.vhd)
hu_hu: Dinamikusan bővülő VHD (.vhd)
it_it: VHD di dimensioni dinamiche (.vhd)
ja_jp: VHD (容量可変) (.vhd)
pl_pl: VHD o dynamicznym rozmiarze (.vhd)
pt_br: VHD de tamanho dinâmico (.vhd)
ru_ru: VHD динамического размера (.vhd)
sk_sk: VHD s dynamickou veľkosťou (.vhd)
sl_si: Dinamičen VHD (.vhd)
tr_tr: Dinamik-boyutlu VHD (.vhd)
uk_ua: VHD динамічного розміру (.vhd)
vi_vn: Ảnh VHD kích thước tăng dần (.vhd)

source: Differencing VHD (.vhd)
ca_es: VHD diferencial (.vhd)
cs_cz: Rozdílový VHD (.vhd)
de_de: Differenzierende VHD (.vhd)
es_es: VHD diferencial (.vhd)
fi_fi: Differentiaalinen VHD (.vhd)
fr_fr: VHD à différenciation (.vhd)
hr_hr: Različiti VHD (.vhd)
hu_hu: Különbség-VHD (.vhd)
it_it: VHD differenziato (.vhd)
ja_jp: VHD (差分) (.vhd)
pl_pl: VHD różnicujący (.vhd)
pt_br: VHD diferencial (.vhd)
ru_ru: Дифференцированный образ VHD (.vhd)
sk_sk: Rozdielový VHD (.vhd)
sl_si: Diferencialni VHD (.vhd)
uk_ua: Диференційований образ VHD (.vhd)
vi_vn: Ảnh VHD đa chủng (differencing) (.vhd)

source: Large blocks (2 MB)
ca_es: Blocs grans (2 MB)
cs_cz: Velké bloky (2 MB)
de_de: Große Blöcke (2 MB)
es_es: Bloques grandes (2 MB)
fi_fi: Suuret lohkot (2 Mt)
fr_fr: Blocs grands (2 Mo)
hr_hr: Veliki blokovi (2 MB)
hu_hu: Nagy blokkméret (2 MB)
it_it: Blocchi larghi (2 MB)
ja_jp: 大きなブロック (2 MB)
pl_pl: Duże bloki (2 MB)
pt_br: Blocos grandes (2 MB)
ru_ru: Большие блоки (2 МБ)
sk_sk: Veľké bloky (2 MB)
sl_si: Veliki bloki (2 MB)
tr_tr: Büyük bloklar (2 MB)
uk_ua: Великі блоки (2 МБ)
vi_vn: Bloc lớn (2 MB)

source: Small blocks (512 KB)
ca_es: Blocs petits (512 KB)
cs_cz: Malé bloky (512 KB)
de_de: Kleine Blöcke (512 KB)
es_es: Bloques pequeños (512 KB)
fi_fi: Pienet lohkot (512 kt)
fr_fr: Blocs petits (512 Ko)
hr_hr: Mali blokovi (512 KB)
hu_hu: Kis blokkméret (512 KB)
it_it: Blocchi piccoli (512 KB)
ja_jp: 小さなブロック (512 KB)
pl_pl: Małe bloki (512 KB)
pt_br: Blocos pequenos (512 KB)
ru_ru: Маленькие блоки (512 КБ)
sk_sk: Malé bloky (512 KB)
sl_si: Mali bloki (512 KB)
tr_tr: Küçük bloklar (512 KB)
uk_ua: Маленькі блоки (512 КБ)
vi_vn: Bloc bé (512 KB)

source: VHD files
ca_es: Fitxers VHD
cs_cz: Soubory VHD
de_de: VHD-Dateien
es_es: Archivos VHD
fi_fi: VHD-tiedostot
fr_fr: Fichiers VHD
hr_hr: VHD slike
hu_hu: VHD fájlok
it_it: File VHD
ja_jp: VHDファイル
pl_pl: Pliki VHD
pt_br: Arquivos VHD
ru_ru: Файлы VHD
sk_sk: Súbory VHD
sl_si: Datoteke VHD
tr_tr: VHD dosyaları
uk_ua: Файли VHD
vi_vn: File VHD

source: Select the parent VHD
ca_es: Seleccioneu el VHD pare
cs_cz: Vyberte nadřazený virtuální disk
de_de: Eltern-VHD-Datei bitte auswählen
es_es: Seleccione el VHD padre
fi_fi: Valitse ylätason VHD
fr_fr: Sélectionnez le VHD parent
hr_hr: Izaberi matičnu sliku VHD
hu_hu: Válassza ki a szülő VHD-t
it_it: Seleziona il VHD padre.
ja_jp: 親VHDの選択
pl_pl: Wybierz nadrzędny plik VHD
pt_br: Selecione o VHD pai
ru_ru: Выберите родительский VHD
sk_sk: Vyberte nadradený virtuálny disk
sl_si: Izberite starševsko sliko VHD
tr_tr: Ana VHD dosyasını seçin
uk_ua: Виберіть батьківський VHD
vi_vn: Chọn file VHD cha (parent)

source: This could mean that the parent image was modified after the differencing image was created. It can also happen if the image files were moved or copied, or by a bug in the program that created this disk. Do you want to fix the timestamps?
ca_es: Això pot ser perquè la imatge pare es va modificar després que la imatge diferencial es creés. També pot passar si les imatges van ser mogudes o copiades, o per una fallada al programa que va crear aquest disc. ¿ Voleu corregir els registres de temps?
cs_cz: To může znamenat, že se obsahy nadřazeného disku změnily po vytvoření rozdílového disku. Tato chyba také může nastat, pokud byl obraz disku kopírován nebo přesunut, nebo kvůli chybě v programu, který jej vytvořil. Chcete časová razítka opravit?
de_de: Dies bedeutet, dass das Elternimage nach der Erstellung des differenzierenden Images erzeugt wurde. Dies kann auch passieren, falls die Image-Dateien verschoben oder kopiert wurden. Ebenso kann auch dies durch einen Bug im Programm, welches das Image erstellt hat, passieren. Möchten Sie die Zeitstempel korrigieren?
es_es: Esto puede deberse a que la imagen padre se modificó después de que la imagen diferencial se crease. También puede ocurrir si las imágenes fueron movidas o copiadas, o por un fallo en el programa que creó este disco. ¿Quiere corregir los registros de tiempo?
fi_fi: Tämä saattaa tarkoittaa, että ylätason levykuvaa on muokattu differentiaalisen levykuvan luonnin jälkeen. Näin voi käydä myös, jos levykuvatiedostoja on siirretty tai kopioitu. Lisäksi syynä voi olla levyn luoneessa sovelluksessa oleva ohjelmistovirhe. Korjataanko aikaleimat?
fr_fr: Il est possible que l'image parente a été modifié après la création de l'image à différenciation. Il est même possible que les fichiers de l'mage ont été déplacés ou copiés ou il existe un bogue dans le programme que a créé ce disque. Voulez-vous réparer l'horodatage?
hr_hr: To bi moglo značiti da je matična slika promijenjena nakon što je stvorena različita slika. To se također može dogoditi ako su slike premještene ili kopirane, ili greška u programu koji je stvorio ovaj disk. Želite li popraviti vremenske oznake?
hu_hu: Ez azt jelentheti, hogy a szülőkép módosult az eltérő kép létrehozása után. Ez akkor is előfordulhat, ha a képfájlokat áthelyezték vagy másolták, vagy a lemezt létrehozó program hibája miatt. Szeretné kijavítani az időbélyegeket?
it_it: Questo potrebbe significare che l'immagine padre sia stata modificata dopo la creazione dell'immagine di differenziazione. Può anche succedere se i file immagini sono stati spostati o copiati, o da un errore nel programma che ha creato questo disco. Vuoi aggiustare le marcature di tempo?
ja_jp: 親イメージが差分イメージの作成の後に変更される可能性があります。 イメージ ファイルが移動またはコピーされたか、イメージ ファイルを作成したプログラムにバグが発生した可能性があります。 タイムスタンプを修正しますか？
pl_pl: Może to oznaczać, że obraz nadrzędny został zmodyfikowany po utworzeniu obrazu różnicującego. Może się to również zdarzyć, jeśli pliki obrazów zostały przeniesione lub skopiowane, lub wystąpił błąd w programie, który utworzył ten dysk Czy chcesz naprawić sygnatury czasowe?
pt_br: Isto pode significar que a imagem de origem foi modificada após a criação da imagem diferencial. Também pode acontecer caso os arquivos de imagem tenham sido movidos ou copiados, ou por um erro no programa que criou este disco. Você quer consertar os marcadores de tempo?
ru_ru: Это может означать, что родительский образ был изменён после того, как был создан дифференцированный образ. Это также может произойти, если файлы образа были перемещены или скопированы, или из-за ошибки в программе, создавшей этот диск. Вы хотите исправить временные метки?
sk_sk: To môže znamenať, že sa obsahy nadradeného disku zmenili po vytvorení rozdielového disku. Táto chyba tiež môže nastať, ak bol obraz disku kopírovaný alebo presunutý, alebo kvôli chybe v programe, ktorý ho vytvoril. Chcete časové pečiatky opraviť?
sl_si: To lahko pomeni, da je bila starševska slika spremenjena potem, ko je že bila ustvarjena diferencialna slika. Do tega lahko pride tudi kadar so datoteke slik diska premaknjene ali kopirane, ali pa gre za hrošča v programu, ki je ustvaril ta disk. Želite popraviti časovni žig?
tr_tr: Bu, farkı alınan imaj oluşturulduktan sonra ana imaj dosyasının düzenlendiği anlamına geliyor olabilir. Bu durum ayrıca imaj dosyaları kopyalandığında veya yerleri değiştirildiğinde veya imaj dosyalarını oluşturan programdaki bir hatadan dolayı olmuş olabilir. Zaman damgalarını düzeltmek ister misiniz?
uk_ua: Це може означати, що батьківський образ був змінений після того, як було створено диференційований образ. Це також може статися, якщо файли зображення були переміщені або скопійовані, або через помилку в програмі, що створила цей диск. Ви хочете виправити тимчасові позначки?
vi_vn: Ở đây tức là ảnh đĩa cha (parent) có thể đã bị chỉnh sửa sau khi ảnh đĩa đa chủng (differencing image) được tạo ra. Cũng có thể do ảnh đĩa bị chuyển đi hay bị copy, hoặc do bug/lỗi của phần mềm tạo ảnh đĩa gây ra. Bạn có muốn sửa lại mốc thời gian (timestamp) không?

source: Parent and child disk timestamps do not match
ca_es: Les marques de temps del pare i el fill no coincideixen
cs_cz: Časová razítka nadřazeného a podřazeného disku nesouhlasí
de_de: Die Zeitstempel der Eltern- und der Kindesplatte stimmen nicht überein
es_es: Las marcas de tiempo del padre e hijo no coinciden
fi_fi: Ylä- ja alatason levyjen aikaleimat eivät täsmää
fr_fr: Les horodatages des disques parent et enfant ne correspondent pas
hr_hr: Vremenske ozanke matične i poređenog diska ne odgovaraju.
hu_hu: A szülő- és a gyermeklemez időbélyegei nem egyeznek
it_it: Le marcature di tempo padre e figlio non corrispondono
ja_jp: 親ディスクと子ディスクのタイムス タンプが一致しません
pl_pl: Sygnatury czasowe dysku nadrzędnego i podrzędnego nie zgadzają się
pt_br: A data/hora dos arquivos de pais e filhos não correspondem
ru_ru: Временные метки родительского и дочернего дисков не совпадают
sk_sk: Časové pečiatky nadradeného a podradeného disku nesúhlasia
sl_si: Časovna žiga starševske slike diska in slike diska otroka se ne ujemata
tr_tr: Ana ve ek disk zaman damgaları uyuşmuyor
uk_ua: Тимчасові мітки батьківського та дочірнього дисків не співпадають
vi_vn: Mốc timestamp của đĩa con (child) và đĩa cha (parent) không trùng khớp

source: Could not fix VHD timestamp.
ca_es: No has estat possible corregir la marca de temps del VHD.
cs_cz: Nebylo možné opravit časové razítko VHD.
de_de: Der Zeitstempel der VHD konnte nicht korrigiert werden.
es_es: No fué posible corregir la marca de tiempo del VHD.
fi_fi: VHD aikaleimaa ei pystytty korjaamaan.
fr_fr: Impossible de réparer l'horodatage du VHD.
hr_hr: Ne mogu popraviti vremensku oznaku slike VHD.
hu_hu: Nem sikerült kijavítani a VHD időbélyegét.
it_it: Impossibile aggiustare marcature di tempo VHD.
ja_jp: VHD のタイムスタンプを修正できません。
pl_pl: Nie można naprawić sygnatury czasowej VHD.
pt_br: Não foi possível consertar o carimbo de data/hora da VHD.
ru_ru: Не удалось исправить временную метку VHD.
sk_sk: Nebolo možné opraviť časovú pečiatku VHD.
sl_si: Ne morem popraviti časovnega žiga slike VHD.
tr_tr: VHD zaman damgası düzeltilemedi.
uk_ua: Не вдалося виправити тимчасову позначку VHD.
vi_vn: Không thể sửa mốc timestamp cho VHD.

source: 160 kB
fi_fi: 160 kt
fr_fr: 160 Ko
ru_ru: 160 кБ
uk_ua: 160 кБ

source: 180 kB
fi_fi: 180 kt
fr_fr: 180 Ko
ru_ru: 180 кБ
uk_ua: 180 кБ
